<?xml version="1.0" encoding="iso-8859-1"?>
<rss version="2.0"><channel><title>MartianZ!</title><link>http://blog.4321.la</link><description></description><lastBuildDate>Sat, 09 Mar 2013 14:01:54 GMT</lastBuildDate><generator>PyRSS2Gen-1.1.0</generator><docs>http://blogs.law.harvard.edu/tech/rss</docs><item><title>LED Matrix Clock</title><link>http://blog.4321.la/article/2013-02-04-led-matrix-clock</link><description>&lt;p&gt;&#21834;&#8230;&#8230;&#35797;&#19968;&#19979;&#26032;&#30340;&#20840;&#30011;&#24133;D600&#30456;&#26426;&#8230;&#8230;&#38236;&#22836;&#27809;&#37197;&#22909;&#21834;&#65292;&#21333;&#21453;&#27585;&#19968;&#29983;&#36824;&#26159;&#22238;&#26469;&#20877;&#25240;&#33150;&#21543; QuQ&lt;/p&gt;
&lt;p&gt;&#25293;&#19968;&#19979;&#21018;&#21018;&#20570;&#23436;&#30340;LED Matrix Clock&#65292;&#32473;&#22899;&#21451;&#20570;&#30340;&#31036;&#29289;&#65292;&#22806;&#35266;&#20027;&#35201;&#26159;&#20223;&#36896;&#28120;&#23453;&#19968;&#24215;&#38138;&#37324;&#38754;&#30340;&#25104;&#21697;&#30340;&#26679;&#23376;&#65292;PCB&#12289;MCU&#30340;&#31243;&#24207;&#24320;&#21457;&#37117;&#26159;&#29420;&#31435;&#23436;&#25104;&#30340;&#65292;&#32487;&#25215;&#25105;&#30340;&#19968;&#36143;&#20316;&#39118;&#65292;&lt;strong&gt;&#36807;&#20960;&#22825;&#25226;PCB&#25991;&#20214;&#21644;MCU&#30340;&#28304;&#31243;&#24207;&#25991;&#20214;&#37117;&#25172;&#21040;GitHub&#19978;&lt;/strong&gt;&#65374;&lt;/p&gt;
&lt;p&gt;&#21333;&#29255;&#26426;&#29992;&#30340;&#26159;STC&#30340;12C5A60S2&#65292;&#25105;&#32477;&#23545;&#26159;&#26368;&#21518;&#19968;&#27425;&#29992;STC&#20102;&#65292;&#24615;&#33021;&#23601;&#20808;&#19981;&#35828;&#20102;&#65292;&#20013;&#38388;&#36824;&#20986;&#29616;&#36807;&#19968;&#27425;&#27809;&#27861;&#19979;&#36733;&#31243;&#24207;&#30340;&#38382;&#39064;&#65292;&#21518;&#26469;&#35895;&#27468;&#20102;&#25165;&#35299;&#20915;&#12290;&#36214;&#32039;&#36716;&#20837;MSP430&#21644;STM32&#21543;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&lt;img alt="LED Matrix Clock IMG1" src="https://lh5.googleusercontent.com/-VUKTiDAuinA/UQ-3prWEOsI/AAAAAAAAEDA/QYPlzFUnUw4/s1118/DSC_0049.JPG" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="LED Matrix Clock IMG2" src="https://lh4.googleusercontent.com/-7hq2jnclpvo/UQ-3xbu49KI/AAAAAAAAEDo/zfgLfJhLNvk/s1118/DSC_0055.JPG" /&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2013-02-04-led-matrix-clock</guid><pubDate>Mon, 04 Feb 2013 22:03:00 GMT</pubDate></item><item><title>MusicSeekerX&#20813;&#36153;&#26381;&#21153;&#21363;&#23558;&#20572;&#27490;</title><link>http://blog.4321.la/article/2013-01-17-musicseekerx</link><description>&lt;p&gt;MusicSeekerX&#30001;&#20110;&#38899;&#20048;&#28304;&#30340;&#21407;&#22240;&#20813;&#36153;&#26381;&#21153;&#21363;&#23558;&#20572;&#27490;&#12290;&lt;/p&gt;
&lt;p&gt;&#25105;&#20204;&#20250;&#23613;&#24555;&#26356;&#26032;&#19968;&#20010;&#8220;&#19981;&#20813;&#36153;&#8221;&#30340;&#29256;&#26412;&#65292;&#21363;&#24744;&#38656;&#35201;&#25903;&#20184;&#19968;&#23450;&#36153;&#29992;&#32473;&lt;strong&gt;&#31532;&#19977;&#26041;&lt;/strong&gt;&#12290;&lt;/p&gt;
&lt;p&gt;&#65288;&#20854;&#23454;&#23601;&#26159;&#25105;&#29616;&#22312;&#33258;&#24049;&#20184;&#38065;&#20813;&#36153;&#32473;&#22823;&#23478;&#29992;&#34987;&#25214;&#33580;&#31105;&#27490;&#20102;&#32780;&#24050; &#8594;&#9697;&#8594; &#27605;&#31455;&#36719;&#20214;&#19968;&#22825;&#19979;&#36733;&#25509;&#36817;&#19968;&#19975;&#39318;&#26080;&#25439;&#38899;&#20048;&#23454;&#22312;&#26159;&#22826;&#23481;&#26131;&#34987;&#30447;&#19978;&#20102;&#8230;&#8230;&#65289;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#35831;&#22823;&#23478;&#20445;&#30041;&#24744;&#30005;&#33041;&#37324;&#38754;&#30340;MusicSeekerX&#65292;&#26377;&#26356;&#26032;&#26102;&#36816;&#34892;&#36719;&#20214;&#20250;&#26377;&#25552;&#31034;&#24182;&#33258;&#21160;&#26356;&#26032;&#12290;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&#26032;&#29256;&#26412;&#26356;&#26032;&#21518;&#65292;&#20813;&#36153;&#30340;&#26381;&#21153;&#23558;&#19981;&#20877;&#21487;&#29992;&#12290;&lt;/p&gt;
&lt;p&gt;&#35874;&#35874;&#24744;&#30340;&#25903;&#25345;&#65281;&#21478;&#22806;&#65292;MusicSeekerX&#19979;&#36733;&#30340;&#27468;&#26354;&#31105;&#27490;&#29992;&#20110;&#20219;&#20309;&#21830;&#19994;&#29992;&#36884;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;&#20219;&#20309;&#38382;&#39064;&#25110;&#32416;&#32439;&#25105;&#21487;&#19981;&#36127;&#36131;&#21704;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2013-01-17-musicseekerx</guid><pubDate>Thu, 17 Jan 2013 12:07:00 GMT</pubDate></item><item><title>&#32487;&#32493;&#19982;&#36825;&#21517;&#20026;&#29616;&#23454;&#30340;&#24618;&#29289;&#25112;&#26007;&#21834;&#25684;&#65281;</title><link>http://blog.4321.la/article/2012-10-29-my-pathetic-life</link><description>&lt;p&gt;&#26368;&#36817;&#30495;&#26159;&#32047;&#30340;&#19968;B&#21834;&#8230;&#8230;&#29100;&#22812;&#36824;&#24471;&#26089;&#36215;&#65292;&#24555;&#25745;&#19981;&#20303;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#25277;&#31354;&#21448;&#30475;&#20102;&#19968;&#19979;51&#21333;&#29255;&#26426;&#65292;&#21457;&#29616;PWM&#20063;&#24456;&#31616;&#21333;&#65292;&#19978;&#19968;&#31687;&#25991;&#31456;&#30495;&#26159;&#27700;&#24471;&#21487;&#20197;&#12290;&#20598;&#23572;&#38386;&#24471;&#34507;&#30140;&#20080;&#20102;&#20960;&#20010;&#38646;&#20214;&#65292;&#25226;&#21488;&#28783;&#25913;&#25104;&#20102;&#36965;&#25511;&#24320;&#20851;&#65292;&#25226;&#24202;&#22836;&#30340;LED&#28783;&#25913;&#25104;&#20102;&#36965;&#25511;&#24320;&#20851; + &#36965;&#25511;PWM&#20142;&#24230;&#35843;&#33410;&#12290;&#21046;&#20316;&#36807;&#31243;&#20013;&#21457;&#29616;&#22266;&#24577;&#32487;&#30005;&#22120;&#30495;&#26159;&#29992;&#36215;&#26469;&#24456;&#29245;&#21834;&#8230;&#8230;&#21097;&#19979;&#20960;&#20010;&#38646;&#20214;&#25226;&#23517;&#23460;&#19978;&#38754;&#30340;&#28783;&#20063;&#25277;&#31354;&#25913;&#25104;&#36965;&#25511;&#30340;&#21543;&#12290;&lt;/p&gt;
&lt;p&gt;&#36305;&#39064;&#20102;&#36305;&#39064;&#20102;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#24635;&#20043;&#20808;&#29100;&#22812;&#20889;&#28857;&#31243;&#24207;&#65292;&#24178;&#28857;&#38646;&#27963;&#65292;&#36186;&#28857;&#38646;&#33457;&#38065;&#65374;&lt;/p&gt;
&lt;p&gt;&#20043;&#21069;&#25105;&#36935;&#21040;&#21035;&#20154;QQ&#19978;&#19968;&#25214;&#25105;&#23601;&#26159;&#30005;&#33041;&#22351;&#20102;&#21643;&#21150;&#36825;&#20123;&#38382;&#39064;&#30340;&#26102;&#20505;&#24635;&#26159;&#20250;&#25265;&#24616;&#19968;&#19979;&#65292;&#29616;&#22312;&#24930;&#24930;&#20064;&#24815;&#20102;&#65292;&#25110;&#35768;&#25105;&#20063;&#23601;&#36825;&#28857;&#29992;&#22788;&#20102;&#21543;&#65292;&#20043;&#21069;&#24635;&#26159;&#22066;&#31505;&#33258;&#24049;&#26159;&#20010;&#32473;&#21035;&#20154;&#20462;&#30005;&#33041;&#30340;Tool&#65292;&#29616;&#22312;&#30475;&#26469;&#65292;&#24403;Tool&#20063;&#19981;&#38169;&#22043;&#65292;&#24635;&#27604;Toy&#24378;&#12290;&lt;/p&gt;
&lt;p&gt;&#21478;&#22806;&#20877;&#35828;&#28857;&#36719;&#20214;&#30340;&#20107;&#24773;&#65292;fakeThunder&#30340;&#38382;&#39064;&#30340;&#30830;&#24456;&#22810;&#65292;&#25105;&#37325;&#26500;&#21040;&#19968;&#21322;&#32467;&#26524;&#22240;&#20026;&#29616;&#23454;&#21508;&#31181;&#24537;&#34987;&#25171;&#26029;&#20102;&#65292;&#29616;&#22312;&#24590;&#20040;&#20063;&#25509;&#19981;&#19978;&#36827;&#24230;&#20102;&#65292;&#21482;&#33021;&#20877;&#24930;&#24930;&#26356;&#26032;&#20043;&#21069;&#30340;&#29256;&#26412;&#65292;&#25277;&#31354;&#20877;&#37325;&#26500;&#21543;&#12290;MusicSeeker&#30340;Windows&#29256;&#26412;&#24050;&#32463;&#20572;&#27490;&#24320;&#21457;&#21644;&#32500;&#25252;&#20102;&#65292;Windows&#19978;&#30340;&#21516;&#31867;&#36719;&#20214;&#29305;&#21035;&#22810;&#65292;&#25105;&#20063;&#27809;&#26377;&#24517;&#35201;&#21435;&#32500;&#25252;&#23427;&#12290;DynamicLyrics&#31639;&#26159;&#25105;&#27604;&#36739;&#28385;&#24847;&#30340;&#36719;&#20214;&#65292;&#19968;&#23450;&#20250;&#32487;&#32493;&#23436;&#21892;&#65374;&lt;/p&gt;
&lt;p&gt;&#25104;&#37117;&#20013;&#21320;&#31455;&#28982;&#20986;&#26469;&#20102;&#22823;&#22826;&#38451;&#65292;&#28909;&#24471;&#35201;&#21629;&#65292;&#28982;&#21518;&#26202;&#19978;&#21448;&#31361;&#28982;&#38477;&#28201;&#21038;&#22823;&#39118;&#12290;&#36825;&#22855;&#33897;&#22825;&#27668;&#12290;&lt;/p&gt;
&lt;p&gt;&#31361;&#28982;&#21457;&#29616;&#35828;&#20102;&#22909;&#22810;&#27809;&#29992;&#30340;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#20877;&#21520;&#22024;&#19968;&#19979;UESTC&#28165;&#27700;&#27827;&#30340;&#39135;&#22530;&#65292;&#25152;&#26377;&#30340;&#35843;&#21619;&#26009;&#21644;&#27833;&#22522;&#26412;&#37117;&#19968;&#20010;&#21619;&#65292;&#38590;&#21507;&#27515;&#20102;&#65292;&#26412;&#26469;&#25105;&#23601;&#25042;&#65292;&#29616;&#22312;&#24324;&#24471;&#25105;&#26356;&#25042;&#24471;&#21435;&#21507;&#39277;&#20102;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-10-29-my-pathetic-life</guid><pubDate>Mon, 29 Oct 2012 22:41:00 GMT</pubDate></item><item><title>&#21769;&#8230;&#8230;&#36523;&#24515;&#30130;&#24811;&#21834;&#8230;&#8230;</title><link>http://blog.4321.la/article/2012-07-27-tucao</link><description>&lt;p&gt;&#22909;&#20037;&#27809;&#26377;&#36825;&#20040;&#26089;&#36215;&#24202;&#20102;&#65292;&#32769;&#26159;&#20064;&#24815;&#20940;&#26216;&#22810;&#30561;&#65292;&#21040;&#20013;&#21320;&#25165;&#36215;&#12290;&#26152;&#22825;&#26202;&#19978;&#20061;&#28857;&#23601;&#22256;&#24471;&#35201;&#27515;&#65292;&#30561;&#21040;1&#28857;&#31455;&#28982;&#34987;&#28909;&#37266;&#20102;&#65292;&#28982;&#21518;&#21448;&#21040;&#22235;&#28857;&#25165;&#30561;&#19979;&#65292;&#28982;&#21518;&#19968;&#20250;&#21448;&#30561;&#19981;&#30528;&#20102;&#12290;&#36215;&#26469;&#25226;fakeThunder&#30340;&#26032;&#29256;&#26412;&#21457;&#24067;&#65292;&#35299;&#20915;&#20102;&#20960;&#20010;&#38382;&#39064;&#65292;&#21507;&#28857;&#26089;&#39277;&#20877;&#21435;&#34917;&#35273;&#65374;&lt;/p&gt;
&lt;p&gt;&#25253;&#20102;&#20010;&#26085;&#35821;&#29677;&#65292;&#19968;&#19979;&#23376;&#26102;&#38388;&#21464;&#24471;&#19981;&#20805;&#35029;&#20102;&#65292;&#20889;&#20195;&#30721;&#28010;&#36153;&#19981;&#23569;&#26102;&#38388;&#65292;&#20063;&#27809;&#26377;&#26102;&#38388;&#22797;&#20064;&#26085;&#35821;&#35838;&#19978;&#23398;&#21040;&#30340;&#19996;&#35199;&#12290;&#27809;&#26377;&#22810;&#23569;&#39069;&#22806;&#30340;&#25910;&#20837;&#65292;&#19968;&#21488;&#30005;&#33041;&#30340;&#40736;&#26631;&#22351;&#25481;&#20102;&#65292;&#20063;&#26408;&#38065;&#20877;&#20080;&#19968;&#20010;&#20102;&#65374;&#22043;&#22043;&#65292;&#20945;&#21512;&#20945;&#21512;&#29992;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#20854;&#23454;&#36807;&#21435;&#24456;&#22810;&#25240;&#33150;&#30340;&#19996;&#35199;&#29616;&#22312;&#24819;&#24819;&#37117;&#27809;&#21861;&#24847;&#20041;&#65292;&#27604;&#22914;&#20043;&#21069;&#19968;&#30452;&#21916;&#27426;&#36891;PT&#65292;&#25910;&#34013;&#20809;&#65292;&#24324;&#20102;3TB&#30340;&#30828;&#30424;&#36824;&#26159;&#19981;&#22815;&#29992;&#12290;&#21518;&#26469;&#21457;&#29616;&#37027;&#20123;&#30005;&#24433;&#12289;&#21160;&#28459;&#65292;&#34013;&#20809;&#37117;&#27809;&#30475;&#36807;&#19968;&#36941;&#65292;&#25910;&#34255;&#30340;&#35805;&#26356;&#26159;&#35753;&#20154;&#31505;&#35805;&#65292;&#37117;&#26159;&#30423;&#29256;&#36164;&#28304;&#26377;&#21861;&#22909;&#25910;&#34255;&#30340;&#65311;&#19968;&#29983;&#27668;&#25226;RAID0&#25286;&#20102;&#65292;&#36807;&#21435;&#25910;&#34255;&#30340;&#36164;&#28304;&#65292;&#36807;&#21435;&#20889;&#30340;Windows&#19978;&#30340;&#20195;&#30721;&#20840;&#37096;&#25172;&#25481;&#21543;&#12290;&#29616;&#22312;&#31361;&#28982;&#21448;&#24819;&#28903;&#32819;&#26426;&#20102;&#65292;&#37027;&#27425;&#21548;&#20102;&#38899;&#22495;&#27979;&#35797;&#65292;&#32467;&#26524;&#31455;&#28982;20Hz~21500Hz&#37117;&#21487;&#20197;&#21548;&#21040;=&#12290;=&#65292;&#20294;&#26159;&#32819;&#26426;&#30340;&#20215;&#26684;&#21448;&#26159;&#35753;&#20154;&#26395;&#32780;&#21364;&#27493;&#8230;&#8230;&#31639;&#20102;&#8230;&#8230;&#31639;&#20102;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#26412;&#26469;&#20551;&#26399;&#24212;&#35813;&#24456;&#33298;&#26381;&#30340;&#65292;&#32467;&#26524;&#24863;&#35273;&#22909;&#24537;&#21834;&#65292;&#20854;&#23454;&#20180;&#32454;&#24819;&#24819;&#37117;&#26159;&#32473;&#33258;&#24049;&#25214;&#20107;&#65292;&#22914;&#26524;&#19981;&#21435;&#20889;&#36825;&#20960;&#27454;&#36719;&#20214;&#65292;&#22914;&#26524;&#19981;&#21435;&#25253;&#20160;&#20040;&#26085;&#35821;&#29677;&#65292;&#21482;&#26159;&#25214;&#20960;&#20010;&#21516;&#23398;&#20986;&#26469;&#21507;&#39039;&#39277;&#65292;&#25171;&#25171;&#29699;&#22810;&#33298;&#22374;&#65374;&#19981;&#36807;&#20889;&#20195;&#30721;&#36824;&#26377;&#36319;&#26085;&#35821;&#29677;&#37324;&#30340;&#21516;&#23398;&#19968;&#22359;&#21520;&#27133;&#20063;&#26159;&#24456;&#24555;&#20048;&#30340;&#12290;&lt;/p&gt;
&lt;p&gt;&#21941;&#65374;&#25277;&#26102;&#38388;&#22810;&#20986;&#21435;&#29609;&#29609;&#65374;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-07-27-tucao</guid><pubDate>Fri, 27 Jul 2012 07:31:00 GMT</pubDate></item><item><title>fakeThunder - OS X&#36805;&#38647;&#31163;&#32447;&#38750;&#23448;&#26041;&#23458;&#25143;&#31471;[Beta]</title><link>http://blog.4321.la/article/2012-07-24-fakethunder</link><description>&lt;p&gt;fakeThunder&#65292;&#20854;&#23454;&#25105;&#26412;&#26469;&#24819;&#21483;&#20182;fxxkThunder&#30340;&#65292;&#20294;&#26159;&#24819;&#21040;&#19968;&#20010;&#21483;fxxk&#30340;&#36719;&#20214;&#22312;&#22823;&#23478;&#30340;Dock&#19978;&#20063;&#23454;&#22312;&#26159;&#22826;&#20302;&#20439;&#20102;&#65292;&#23601;&#21483;fake&#22909;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#20043;&#25152;&#20197;&#23545;&#36805;&#38647;&#36825;&#20040;&#26080;&#22856;&#65292;&#19968;&#26469;&#26159;&#22240;&#20026;&#25105;&#24179;&#24120;&#30340;&#22823;&#37096;&#20998;&#19979;&#36733;&#37117;&#26159;&#29992;µTorrent&#65292;Windows&#19978;&#30340;&#36805;&#38647;&#29992;&#25143;&#32473;µTorrent&#19978;&#20256;&#36895;&#24230;&#37027;&#21483;&#19968;&#20010;&#21487;&#24604;&#65292;&#19968;&#22534;&#36805;&#38647;&#30340;&#19978;&#20256;&#36895;&#24230;&#36214;&#19981;&#19978;&#19968;&#20010;&#29992;µTorrent&#30340;&#26379;&#21451;&#30340;&#19978;&#20256;&#36895;&#24230;&#65307;&#20108;&#26469;&#26159;&#22240;&#20026;&#36805;&#38647;&#22312;11&#24180;&#21457;&#24067;&#30340;OS X&#19979;&#30340;&#23458;&#25143;&#31471;&#65292;&#25454;&#35828;&#26159;&#22242;&#38431;&#20869;&#37096;&#19968;&#20010;OS X&#29233;&#22909;&#32773;&#33258;&#24049;&#19994;&#20313;&#24320;&#21457;&#30340;&#65292;BUG&#19968;&#22534;&#65292;&#19981;&#25903;&#25345;&#36805;&#38647;&#31163;&#32447;&#65292;&#32780;&#19988;&#19968;&#24180;&#27809;&#26356;&#26032;&#20102;&#12290;&#23612;&#29595;&#23601;&#31639;&#26159;&#20010;&#20154;&#24320;&#21457;&#30340;&#36719;&#20214;&#20063;&#19981;&#33021;&#36825;&#20040;&#28195;&#21834;&#65281;&#20309;&#20917;&#20320;&#36824;&#26377;&#19968;&#22534;&#32654;&#24037;&#22969;&#23376;&#24110;&#20320;&#35774;&#35745;&#21602;&#65281;&#36824;&#32473;&#25918;&#22312;&#36805;&#38647;&#36719;&#20214;&#20013;&#24515;&#26174;&#30524;&#30340;&#20301;&#32622;&#65292;&#32431;&#31929;&#22353;OS X&#30340;&#29992;&#25143;&#21834;&#12290;&#27809;&#26377;&#35802;&#24847;&#23601;&#21035;&#20986;&#23458;&#25143;&#31471;&#65292;&#26082;&#28982;&#20197;&#20844;&#21496;&#30340;&#21517;&#20041;&#20986;&#20102;&#23601;&#22909;&#22909;&#30340;&#36845;&#20195;&#26356;&#26032;&#65292;&#23454;&#22312;&#19981;&#34892;&#20320;&#24320;&#28304;&#20063;&#25104;&#21834;&#65281;&lt;/p&gt;
&lt;p&gt;&#22909;&#20102;&#65292;&#24223;&#35805;&#35828;&#20102;&#36825;&#20040;&#22810;&#65292;&#36827;&#20837;&#27491;&#39064;&#12290;&#32463;&#36807;&#19968;&#27573;&#26102;&#38388;&#30340;&#24320;&#21457;&#65292;&#25630;&#23450;&#20102;&#19968;&#27454;&#36805;&#38647;&#31163;&#32447;&#23458;&#25143;&#31471;&#65292;&#30456;&#27604;&#26222;&#36890;&#30340;&#36805;&#38647;&#65292;&#36825;&#20010;&#21482;&#25903;&#25345;&#36805;&#38647;&#31163;&#32447;&#19979;&#36733;&#65292;&#19981;&#25903;&#25345;&#26222;&#36890;&#20219;&#21153;&#30340;&#19979;&#36733;&#65292;&#24744;&#21487;&#20197;&#23558;&#36719;&#20214;&#20316;&#20026;&#19968;&#20010;&#36741;&#21161;&#65292;&#19979;&#36733;&#19968;&#20123;&#22351;&#38142;&#12289;BT&#36719;&#20214;&#25302;&#19981;&#21160;&#30340;&#36164;&#28304;&#12290;&lt;/p&gt;
&lt;h4&gt;&#36719;&#20214;&#24050;&#23436;&#25104;&#30340;&#21151;&#33021;&#65306;&lt;/h4&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;p&gt;&#19982;&#36805;&#38647;&#20113;&#31471;&#31163;&#32447;&#21015;&#34920; http://lixian.xunlei.com &#20445;&#25345;&#21516;&#27493;&#65292;&#25903;&#25345;&#20174;&#23458;&#25143;&#31471;&#28155;&#21152;&#20219;&#21153;&lt;/p&gt;
&lt;p&gt;&lt;img alt="img" src="http://ww2.sinaimg.cn/large/a6131aedjw1dv75pzu9f8j.jpg" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#22810;&#20219;&#21153;&#21516;&#26102;&#19979;&#36733;&#65292;&#25903;&#25345;&#19979;&#36733;&#38431;&#21015;&lt;/p&gt;
&lt;p&gt;&lt;img alt="img" src="http://ww1.sinaimg.cn/large/a6131aedjw1dv75sui5jbj.jpg" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25903;&#25345;BT&#20219;&#21153;&#33258;&#21160;&#19979;&#36733;&#65292;&#20445;&#25345;&#21407;BT&#31181;&#23376;&#20013;&#30340;&#25991;&#20214;&#30446;&#24405;&#25490;&#21015;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="img" src="http://ww2.sinaimg.cn/large/a6131aedjw1dv75tmsxe5j.jpg" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#20351;&#29992;MPlayerX&#25773;&#25918;&#36805;&#38647;&#20113;&#28857;&#25773;  &lt;/p&gt;
&lt;p&gt;&lt;img alt="img" src="http://ww2.sinaimg.cn/large/a6131aedjw1dv7anjhyqvj.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TIP&lt;/strong&gt;:&#38656;&#35201;&#22312;MPlayerX&#35774;&#32622;&#20013;&lt;strong&gt;&#21462;&#28040;&lt;/strong&gt;&#20351;&#29992;ffmpeg&#22788;&#29702;&#27969;&#65281;&#21542;&#21017;&#26080;&#27861;&#25773;&#25918;&#35270;&#39057;&lt;/p&gt;
&lt;p&gt;MPlayerX&#35774;&#32622;&#31383;&#21475;&#65306;
&lt;img alt="img" src="http://ww2.sinaimg.cn/large/a6131aedjw1dv7axuffcoj.jpg" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h4&gt;&#34917;&#20805;&#35828;&#26126;&#65306;&lt;/h4&gt;
&lt;ol&gt;
&lt;li&gt;&#36719;&#20214;&#25903;&#25345;10.7&#21644;10.8&#65292;&#19981;&#25903;&#25345;10.6&#25805;&#20316;&#31995;&#32479;&#12290;&lt;/li&gt;
&lt;li&gt;&#36719;&#20214;&#19981;&#25552;&#20379;&#20219;&#20309;&#30772;&#35299;&#36805;&#38647;&#20250;&#21592;&#30340;&#21151;&#33021;&#65292;&#24744;&#24517;&#39035;&#20351;&#29992;&#33258;&#24049;&#30340;&#36805;&#38647;VIP&#36134;&#25143;&#30331;&#24405;&#12290;&lt;/li&gt;
&lt;li&gt;&#36805;&#38647;API&#37096;&#20998;&#20462;&#25913;&#33258;&#24320;&#28304;&#39033;&#30446;&lt;a href="http://loli.lu"&gt;loli.lu&lt;/a&gt; - &lt;a href="https://github.com/binux/lixian.xunlei"&gt;https://github.com/binux/lixian.xunlei&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&#19979;&#36733;&#26680;&#24515;&#37096;&#20998;&#20462;&#25913;&#33258;&#24320;&#28304;&#39033;&#30446;aria2 - &lt;a href="http://aria2.sourceforge.net/"&gt;http://aria2.sourceforge.net/&lt;/a&gt;&lt;/li&gt;
&lt;/ol&gt;
&lt;h4&gt;&#29305;&#27530;&#24863;&#35874;&lt;/h4&gt;
&lt;p&gt;&#24863;&#35874;Keefo(&lt;a href="http://lianxu.me"&gt;http://lianxu.me&lt;/a&gt;)&#21644;Binux(&lt;a href="http://binux.me/"&gt;http://binux.me/&lt;/a&gt;)&#22312;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#25216;&#26415;&#25903;&#25345;=&#12290;=&lt;/p&gt;
&lt;h4&gt;&#25424;&#36192;&lt;/h4&gt;
&lt;p&gt;fakeThunder&#26159;&#19968;&#27454;&#20813;&#36153;&#24320;&#28304;&#36719;&#20214;&#65292;&#36719;&#20214;&#24403;&#21069;&#22788;&#20110;Beta&#38454;&#27573;&#65292;&#20173;&#26377;&#24456;&#22823;&#30340;&#24320;&#21457;&#31354;&#38388;&#12290;&#22914;&#26524;&#24744;&#21916;&#27426;&#36825;&#27454;&#36719;&#20214;&#65292;&#28857;&#20987;&#36825;&#37324; &lt;a href="http://donate.4321.la"&gt;http://donate.4321.la&lt;/a&gt; &#25424;&#36192;&#20316;&#32773;&#20197;&#25903;&#25345;&#21518;&#32493;&#30340;&#24320;&#21457;&#21644;&#30456;&#20851;&#30340;&#32500;&#25252;&#36153;&#29992;&#65281;&lt;/p&gt;
&lt;h4&gt;&#28304;&#20195;&#30721;&#12289;&#20108;&#36827;&#21046;&#21253;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/h4&gt;
&lt;p&gt;&#35814;&#24773;&#35831;&#26597;&#30475;&#36719;&#20214;&#21457;&#24067;&#39029;&#38754;&#65306;&lt;a href="http://martianz.cn/fakethunder/"&gt;http://martianz.cn/fakethunder/&lt;/a&gt;&lt;/p&gt;
&lt;h4&gt;&#21453;&#39304;&lt;/h4&gt;
&lt;p&gt;&#26377;&#20219;&#20309;&#20351;&#29992;&#19978;&#30340;&#38382;&#39064;&#65292;&#35831;&#22312;&#24403;&#21069;&#25991;&#31456;&#19979;&#26041;&#30041;&#35328;&#22238;&#22797;&#12290;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;BUG&#12289;&#25216;&#26415;&#38382;&#39064;&#35831;&#21040;&#36825;&#37324;&#21453;&#39304;&#65306; &lt;a href="https://github.com/MartianZ/fakeThunder/issues"&gt;https://github.com/MartianZ/fakeThunder/issues&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-07-24-fakethunder</guid><pubDate>Tue, 24 Jul 2012 10:53:00 GMT</pubDate></item><item><title>4321.La&#39318;&#39029;&#26356;&#25913;&#22495;&#21517;&#21040;MartianZ.cn</title><link>http://blog.4321.la/article/2012-07-21-new-domain</link><description>&lt;p&gt;&#19981;&#20037;&#21069;&#20080;&#20102;&#20010;cn&#22495;&#21517;&#65292;&#32456;&#20110;&#35299;&#38500;&#20102;clientHold&#65292;&#21487;&#20197;&#35299;&#26512;&#20102;&#65292;&#32467;&#26524;&#21457;&#29616;&#20063;&#27809;&#21861;&#29992;&#20102;&#65292;&#21448;&#19981;&#22909;&#24847;&#24605;&#28010;&#36153;&#25481;&#65292;&#23601;&#25226;4321.La&#30340;&#39318;&#39029;&#36716;&#21040;&#20102;MartianZ.cn&lt;/p&gt;
&lt;p&gt;4321.La&#34429;&#28982;&#22909;&#35760;&#65292;&#20294;&#26159;&#27809;&#26377;&#20160;&#20040;&#24847;&#20041;&#65292;&#27605;&#31455;&#26159;&#25105;&#33258;&#24049;&#30340;&#20010;&#20154;&#32593;&#31449;&#65292;&#23601;&#36716;&#21040;&#20102;MartianZ.cn&#65292;&#35775;&#38382;4321.La&#20250;&#33258;&#21160;301&#36339;&#36716;&#36807;&#26469;&#12290;&lt;/p&gt;
&lt;p&gt;&#21518;&#26399;&#20250;&#36880;&#28176;&#32473;&#25105;&#24320;&#21457;&#30340;&#27599;&#19968;&#20010;&#24212;&#29992;&#20570;&#19968;&#20010;&#21333;&#29420;&#30340;Page&#65292;&#27604;&#22914;DynamicLyrics&#30340;&#23601;&#20250;&#26159;martianz.cn/dynamiclyrics&lt;/p&gt;
&lt;p&gt;&#33267;&#20110;&#21338;&#23458;&#22320;&#22336;&#65292;&#36824;&#26159;&#32487;&#32493;blog.4321.la =&#12290;=&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-07-21-new-domain</guid><pubDate>Sat, 21 Jul 2012 17:53:00 GMT</pubDate></item><item><title>&#26085;&#35821;&#20551;&#21517;&#22826;&#24833;&#20154;&#20102;&#8230;&#8230;</title><link>http://blog.4321.la/article/2012-07-21-hiragana</link><description>&lt;p&gt;&#21069;&#20123;&#26085;&#23376;&#25253;&#20102;&#20010;&#26085;&#35821;&#21021;&#32423;&#20837;&#38376;&#29677;&#65292;&#26152;&#22825;&#24320;&#22987;&#19978;&#35838;&#20102;&#65292;&#32467;&#26524;&#31532;&#19968;&#22825;&#23601;&#25945;&#20102;25&#20010;&#24179;&#20551;&#21517;&#21644;25&#20010;&#29255;&#20551;&#21517;&#65292;&#36824;&#26377;&#21313;&#20960;&#20010;&#21333;&#35789;&#65292;&#20170;&#22825;&#25226;&#20551;&#21517;&#37117;&#25945;&#23436;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#32972;&#36825;&#20010;&#23454;&#22312;&#26159;&#22826;&#30171;&#33510;&#20102;&#21834;&#65292;&#20809;&#32972;&#19979;&#26469;&#23601;&#22909;&#38590;&#20102;&#65292;&#24418;&#25104;&#26465;&#20214;&#21453;&#23556;&#23601;&#26356;&#36153;&#21170;&#20102;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#20889;&#20010;C&#20195;&#30721;&#26469;&#24110;&#24537;&#32972;&#24179;&#20551;&#21517;&#21543;&#65292;&#29255;&#20551;&#21517;&#21516;&#29702;&#65292;&#25913;&#19968;&#19979;&#37324;&#38754;&#30340;&#25968;&#32452;&#23601;&#21487;&#20197;&#20102;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;#include &amp;lt;stdio.h&amp;gt;
#include &amp;lt;stdlib.h&amp;gt;
#include &amp;lt;time.h&amp;gt;
#include &amp;lt;string.h&amp;gt;
#define random(x) (rand()%x)

int main(void)
{   
    srand((int)time(0));
    char h[51][4] = {"&#12354;","&#12356;","&#12358;","&#12360;","&#12362;","&#12363;","&#12365;","&#12367;","&#12369;","&#12371;","&#12373;","&#12375;","&#12377;","&#12379;","&#12381;","&#12383;","&#12385;","&#12388;","&#12390;","&#12392;","&#12394;","&#12395;","&#12396;","&#12397;","&#12398;","&#12399;","&#12402;","&#12405;","&#12408;","&#12411;","&#12414;","&#12415;","&#12416;","&#12417;","&#12418;","&#12420;","&#12356;","&#12422;","&#12360;","&#12424;","&#12425;","&#12426;","&#12427;","&#12428;","&#12429;","&#12431;","&#12356;","&#12358;","&#12360;","&#12362;","&#12435;"};
    char s[51][4] = {"a", "i", "u", "e", "o", "ka", "ki", "ku", "ke", "ko", "sa", "shi", "su", "se", "so", "ta", "chi", "tsu", "te", "to", "na", "ni", "nu", "ne", "no", "ha", "hi", "fu", "he", "ho", "ma", "mi", "mu", "me", "mo", "ya", "i", "yu", "e", "yo", "ra", "ri", "ru", "re", "ro", "wa", "i", "u", "e", "o", "n"};
    while (1)
    {
        int i = random(50);
        printf("%s\n", h[i]); 
        char ans[4];
        scanf("%s", ans);
        if (strcmp(ans, s[i]) == 0)
            printf("\033[40;32mCorrect!\033[0m\n\033[40;34mNext: \033[0m");
        else
            printf("\033[40;31mWrong!\033[0m \033[5m%s %s\033[0m \n\033[40;34mNext: \033[0m", h[i], s[i]);
    }
    return 0;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#20445;&#23384;&#20026;katakana.c&#29992;gcc&#32534;&#35793;&#23601;&#21487;&#20197;&#20102;&#65292;&#20195;&#30721;&#24456;&#31616;&#21333;&#23601;&#19981;&#22810;&#32599;&#21990;&#20102;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#32487;&#32493;&#32972;&#21435;&#8230;&#8230;&#22247;&#8230;&#8230;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-07-21-hiragana</guid><pubDate>Sat, 21 Jul 2012 00:38:00 GMT</pubDate></item><item><title>&#32456;&#20110;&#25670;&#33073;Octopress&#20102;&#8230;&#8230;</title><link>http://blog.4321.la/article/2012-07-03-see-you-octopress</link><description>&lt;p&gt;&#20174;WordPress&#25442;&#21040;Octopress&#65292;&#34429;&#28982;&#36731;&#24555;&#20102;&#19981;&#23569;&#65292;&#20294;&#26159;&#27599;&#27425;generate&#21644;deploy&#20063;&#22909;&#28902;&#65292;&#32780;&#19988;&#22909;&#22810;&#24819;&#25913;&#30340;&#19996;&#35199;&#19981;&#20250;&#25913;&#65292;&#36825;&#36135;&#29992;&#20102;ruby&#65292;&#35821;&#27861;&#20063;&#24530;&#22855;&#33897;&#20102;&#12290;&#32780;&#19988;&#26368;&#36817;&#25105;&#25163;&#36145;&#35013;&#20102;OS X 10.8&#65292;&#36825;&#36135;generate&#30340;&#26102;&#20505;&#27515;&#27963;&#20986;&#38169;&#65292;&#24590;&#20040;&#20063;&#35299;&#20915;&#19981;&#20102;&#65292;&#19968;&#24594;&#20043;&#19979;&#21024;&#38500;&#20043;&#65281;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#25105;&#19968;&#29983;&#27668;&#20889;&#20102;&#20010;&#23567;&#22411;&#30340;&#21338;&#23458;&#31995;&#32479;&#65292;&#19968;&#20849;&#23601;&#19968;&#20010;py&#25991;&#20214;&#65292;&#23454;&#22312;&#26159;&#31616;&#27905;&#30340;&#24456;&#65292;&#27809;&#26377;&#20998;&#31867;&#21151;&#33021;&#65292;&#27809;&#26377;&#26631;&#31614;&#21151;&#33021;&#65292;&#20026;&#33258;&#24049;&#37327;&#36523;&#23450;&#20570;&#65292;&#30495;&#26159;&#29245;&#24471;&#24456;&#21834;&#65374;&#65374; &#20195;&#30721;&#22312;&#65306;&lt;a href="https://github.com/MartianZ/MartianZ-BLOG"&gt;https://github.com/MartianZ/MartianZ-BLOG&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#21069;&#20123;&#26085;&#23376;&#24324;&#20102;&#33529;&#26524;&#30340;OS X&#24320;&#21457;&#32773;&#36134;&#21495;&#65292;&#28982;&#21518;&#25226;DynamicLyrics&#25240;&#33150;&#21322;&#22825;&#25172;&#21830;&#24215;&#65292;Sandbox&#20160;&#20040;&#30340;&#24694;&#24515;&#27515;&#20102;&#65292;&#26368;&#21518;&#36824;&#26159;&#34987;&#25298;&#32477;&#20102;&#65292;&#22240;&#20026;&#26377;&#27468;&#35789;&#25628;&#32034;&#21151;&#33021;&#65292;&#29256;&#26435;&#20160;&#20040;&#30340;&#8230;&#8230;&#36825;&#20040;&#20005;&#26684;&#24178;&#21861;&#65292;&#23601;&#19968;&#20010;&#27468;&#35789;&#37117;&#19981;&#35753;&#33258;&#21160;&#25628;&#32034;&#12290;&lt;/p&gt;
&lt;p&gt;&#22043;&#22043;&#65292;&#25277;&#31354;&#32487;&#32493;&#23436;&#21892;&#23436;&#21892;&#36825;&#20010;&#21338;&#23458;&#31995;&#32479;&#65292;&#24863;&#35273;&#36825;&#27425;&#30495;&#26159;&#28165;&#29245;&#21834;&#65374;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-07-03-see-you-octopress</guid><pubDate>Tue, 03 Jul 2012 17:14:00 GMT</pubDate></item><item><title>DynamicLyrics 2.1&#29256;&#26412;&#27491;&#24335;&#21457;&#24067;</title><link>http://blog.4321.la/article/2012-06-11-dynamiclyrics-2-dot-0-release</link><description>&lt;p&gt;&#32463;&#36807;&#26080;&#25968;&#27425;&#22312;Xcode&#19979;&#30340;&#35843;&#25945;&#65292;DynamicLyrics&#30340;&#23436;&#25104;&#24230;&#32456;&#20110;&#24046;&#19981;&#22810;&#20102;&#65292;&#20110;&#26159;&#25918;&#20986;&#26368;&#26032;&#30340;&#29256;&#26412;&#32473;&#22823;&#23478;&#20351;&#29992;&#12290;&#36825;&#20010;&#29256;&#26412;&#30456;&#23545;&#20110;&#26368;&#24320;&#22987;&#30340;1.0&#21487;&#35859;&#23436;&#20840;&#37325;&#26500;&#65292;&#28155;&#21152;&#20102;&#24456;&#22810;&#21151;&#33021;&#65292;&#20063;&#25552;&#39640;&#20102;&#31283;&#23450;&#24615;&#12290;&#21516;&#26102;&#20063;&#37096;&#32626;&#19978;&#32447;&#20102;&#33258;&#21160;&#26356;&#26032;&#31995;&#32479;&#65292;&#26041;&#20415;&#36935;&#21040;&#38382;&#39064;&#21450;&#26102;&#26356;&#26032;&#12290;&lt;/p&gt;
&lt;p&gt;&#22312;&#26032;&#29256;&#26412;&#30340;&#24320;&#21457;&#36807;&#31243;&#20013;&#65292;&#26377;&#20960;&#20301;&#26379;&#21451;&#32034;&#35201;&#20102;Alpha&#29256;&#26412;&#65292;&#36825;&#20123;&#29256;&#26412;&#22240;&#20026;&#35777;&#20070;&#38382;&#39064;&#19981;&#33021;&#22815;&#33258;&#21160;&#26356;&#26032;&#33719;&#24471;&#36825;&#27425;&#30340;&#26032;&#29256;&#26412;&#65292;&#25152;&#20197;&#40635;&#28902;&#36825;&#20123;&#26379;&#21451;&#37325;&#26032;&#25163;&#21160;&#19979;&#36733;&#19968;&#19979;&#65292;&#25265;&#27465;&#12290;&lt;/p&gt;
&lt;h2&gt;&#25130;&#22270;&#12289;&#21151;&#33021;&#39044;&#35272;&#65306;&lt;/h2&gt;
&lt;p&gt;&lt;img alt="Imgur" src="http://i.imgur.com/Shdpt.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="Imgur" src="http://i.imgur.com/NrWiS.jpg" /&gt;&lt;/p&gt;
&lt;h2&gt;&#20027;&#35201;&#21151;&#33021;&#65306;&lt;/h2&gt;
&lt;ol&gt;
&lt;li&gt;&#26700;&#38754;&#12289;&#26631;&#39064;&#26639;LRC&#27468;&#35789;&lt;/li&gt;
&lt;li&gt;&#27468;&#35789;&#33258;&#21160;&#25628;&#32034;&#12289;&#20889;&#20837;iTunes&#12289;&#23548;&#20986;&lt;/li&gt;
&lt;li&gt;&#19987;&#36753;&#23553;&#38754;&#25628;&#32034;&#12289;&#20889;&#20837;iTunes&#12289;&#23548;&#20986;&lt;/li&gt;
&lt;li&gt;&#38543;iTunes&#21551;&#21160;&#12289;&#36864;&#20986;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&#25903;&#25345;OS X Snow Leopard&#12289;Lion&#21644;Mountain Lion&#12290;&lt;/p&gt;
&lt;p&gt;&#26377;&#20219;&#20309;&#38382;&#39064;&#35831;&#22312;&#19979;&#38754;&#30041;&#35328;&#25552;&#20132;&#12290;&#35874;&#35874;&#21508;&#20301;&#25903;&#25345;&lt;/p&gt;
&lt;h2&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/h2&gt;
&lt;p&gt;&#22269;&#22806;&#26381;&#21153;&#22120;&#65306;&lt;a href="http://martianlaboratory.com/dynamiclyrics/DynamicLyricsBuild762.zip"&gt;http://martianlaboratory.com/dynamiclyrics/DynamicLyricsBuild762.zip&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#22269;&#20869;&#26381;&#21153;&#22120;&#65306;&lt;a href="http://dl.4321.la/DynamicLyricsBuild762.zip"&gt;http://dl.4321.la/DynamicLyricsBuild762.zip&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#26356;&#26032;&#26085;&#24535;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#30001;&#20110;762&#29256;&#26412;&#21551;&#29992;&#20102;Sandbox&#65292;&#25152;&#26377;&#20043;&#21069;&#30340;&#29256;&#26412;&#21319;&#32423;&#21040;762&#29256;&#26412;&#20250;&#20002;&#22833;&#35774;&#32622;&#25968;&#25454;&#21644;&#27468;&#35789;&#25968;&#25454;&#12290;&#35831;&#21508;&#20301;&#21319;&#32423;&#21069;&#24910;&#37325;&#12290;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;NEW 2.1 762 2011-07-01 Support OS X 10.6. &#25903;&#25345; OS X 10.6&#31995;&#32479;&#12290;&lt;/p&gt;
&lt;p&gt;NEW 2.1 762 2011-07-01 Sandbox Everything! &#27801;&#30418;&#22788;&#29702;DynamicLyrics&#21644;DynamicLyricsHelper.&lt;/p&gt;
&lt;p&gt;NEW 2.1 762 2011-07-01 Add "Hide lyrics when iTunes is paused" feature. &#28155;&#21152;iTunes&#26242;&#20572;&#26102;&#38544;&#34255;&#27468;&#35789;&#21151;&#33021;&#12290;&lt;/p&gt;
&lt;p&gt;NEW 2.1 762 2011-07-01 Add track switch notification feature. &#28155;&#21152;&#27468;&#26354;&#20999;&#25442;&#36890;&#30693;&#21151;&#33021;&#12290;&lt;/p&gt;
&lt;p&gt;NEW 2.1 762 2011-07-01 Add Lyrics delay adjustment function. &#28155;&#21152;&#27468;&#35789;&#24310;&#36831;&#35843;&#25972;&#21151;&#33021;&#12290;&lt;/p&gt;
&lt;p&gt;BUG 2.1 762 2011-07-01 Fixed memory leak bug. &#20462;&#22797;&#20960;&#22788;&#20869;&#23384;&#27844;&#28431;&#38382;&#39064;&#12290;&lt;/p&gt;
&lt;p&gt;NEW 2.1 226 2011-06-12 &#28155;&#21152;&#20013;&#25991;&#30028;&#38754;&#65292;&#30028;&#38754;&#20803;&#32032;&#24494;&#35843;&#12290;&lt;/p&gt;
&lt;p&gt;NEW 2.1 213 2011-06-11 Address an issue caused by OpenSSL. If the error "The update is improperly signed." occurs during upgrade process, please manually download the new update.&lt;/p&gt;
&lt;p&gt;NEW 2.1 203 2011-06-11 Added desktop lyrics fade-in and face-out effect&lt;/p&gt;
&lt;p&gt;BUG 2.1 199 2011-06-02 Address an issue that may cause lyrics frequently change&lt;/p&gt;
&lt;p&gt;BUG 2.1 198 2011-06-01 Address an issue that may prevent iTunes from quiting&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-06-11-dynamiclyrics-2-dot-0-release</guid><pubDate>Mon, 11 Jun 2012 13:50:00 GMT</pubDate></item><item><title>&#38386;&#24471;&#26080;&#32842;&#20080;&#20102;&#19968;&#22534;&#20070;&#8230;&#8230;</title><link>http://blog.4321.la/article/2012-06-10-buy-books-activity-first</link><description>&lt;p&gt;&#26368;&#36817;&#23454;&#22312;&#26159;&#26080;&#32842;&#20102;&#65292;&#22823;&#33760;&#33821;3&#20080;&#26469;&#29609;&#24471;&#36824;&#19981;&#29245;&#65292;&#34429;&#35828;&#33021;&#29609;&#65292;&#27491;&#22909;&#36214;&#19978;&#20160;&#20040;BUG&#26469;&#22238;&#22238;&#26723;&#65292;&#32780;&#19988;&#23448;&#26041;&#29616;&#22312;&#25105;&#37027;&#20010;&#35746;&#21333;&#29366;&#24577;&#36824;&#26159;&#38431;&#21015;&#20013;&#65292;&#19975;&#19968;&#20877;&#22240;&#20026;&#25903;&#20184;&#22320;&#22336;&#26159;&#34394;&#20551;&#30340;&#36864;&#27454;&#21024;&#21495;&#65292;&#23682;&#19981;&#26159;&#23601;&#30333;&#32451;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#23601;&#19978;Amazon&#19978;&#38754;&#20080;&#20102;&#19968;&#22534;&#20070;&#65292;&#20934;&#22791;&#25277;&#26102;&#38388;&#22909;&#22909;&#23398;&#23398;C&#35821;&#35328;&#65292;&#39034;&#24102;&#23398;&#23398;&#26085;&#35821;&#65292;&#28982;&#21518;&#20877;&#30475;&#30475;&#23567;&#35828;&#20043;&#31867;&#30340;&#65292;&#24635;&#20043;&#25402;&#26434;&#30340;&#12290;&lt;/p&gt;
&lt;p&gt;&#35745;&#31639;&#26426;&#31867;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#31639;&#27861;&#23548;&#35770;(&#21407;&#20070;&#31532;2&#29256;)&lt;/li&gt;
&lt;li&gt;C Primer Plus&amp;lt;&#31532;5&#29256;&amp;gt;&#20013;&#25991;&#29256;&lt;/li&gt;
&lt;li&gt;C&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;(&#31532;2&#29256;&#26032;&#29256;)&lt;/li&gt;
&lt;li&gt;UNIX&#29615;&#22659;&#39640;&#32423;&#32534;&#31243;(&#31532;2&#29256;)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#34507;&#30140;&#31867;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#26032;&#29256;&#20013;&#26085;&#20132;&#27969;&#26631;&#20934;&#26085;&#26412;&#35821;(&#21021;&#32423;&#19978;&#19979;)(CD+&#20070;)&lt;/li&gt;
&lt;li&gt;&#25105;&#19981;&#26159;&#25945;&#20320;&#35784;(&#20840;&#26412;&#29645;&#34255;)&lt;/li&gt;
&lt;li&gt;&#19968;&#20061;&#20843;&#22235;&lt;/li&gt;
&lt;li&gt;&#20027;&#27969;:&#35841;&#23558;&#25171;&#36194;&#20840;&#29699;&#25991;&#21270;&#25112;&#20105;&lt;/li&gt;
&lt;li&gt;&#36335;&#35199;&#27861;&#25928;&#24212;:&#22909;&#20154;&#26159;&#22914;&#20309;&#21464;&#25104;&#24694;&#39764;&#30340;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#22043;&#22043;&#65292;&#24635;&#20043;&#26377;&#30340;&#30475;&#20102;&lt;/p&gt;
&lt;p&gt;&#21478;&#22806;&#20122;&#39532;&#36874;&#36825;&#20010;&#24555;&#36882;&#65292;&#34429;&#35828;&#20813;&#36153;&#26159;&#19981;&#38169;&#65292;&#34429;&#35828;&#20070;&#19968;&#33324;&#37117;&#27604;&#36739;&#25745;&#25684;&#65292;&#32467;&#26524;&#20170;&#22825;&#25910;&#21040;&#20102;&#31639;&#27861;&#23548;&#35770;&#36825;&#20070;&#21457;&#29616;&#21518;&#38754;&#22351;&#20102;&#19968;&#37096;&#20998;&#65292;&#26126;&#26174;&#26159;&#26469;&#22238;&#30896;&#25758;&#24324;&#22351;&#30340;&#8230;&#8230;&#36825;&#29289;&#27969;&#30495;&#26159;&#24833;&#20154;&#21834;&#8230;&#8230;&#8230;&#8230;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-06-10-buy-books-activity-first</guid><pubDate>Sun, 10 Jun 2012 22:39:00 GMT</pubDate></item><item><title>Ubuntu Server&#19979;&#37197;&#32622;Apache Web&#26381;&#21153;&#22120;</title><link>http://blog.4321.la/article/2012-05-27-ubuntu-apache</link><description>&lt;p&gt;&#20854;&#23454;&#30456;&#20851;&#30340;&#25991;&#31456;&#24050;&#32463;&#24456;&#22810;&#20102;&#65292;&#20170;&#22825;&#37197;&#32622;&#19968;&#21488;VPS&#25343;&#26469;&#20570;&#36719;&#20214;&#30340;&#26356;&#26032;&#36890;&#30693;&#26381;&#21153;&#22120;&#20197;&#21450;&#19968;&#20123;Api&#65292;&#25152;&#20197;&#35760;&#24405;&#19968;&#19979;&#12290;&#20854;&#20013;&#19968;&#20123;&#27604;&#36739;&#38590;&#35760;&#24518;&#36164;&#26009;&#26469;&#33258;&#32593;&#19978;&#30340;&#20171;&#32461;&#12290;&#32454;&#33410;&#30340;&#37197;&#32622;&#65292;&#20363;&#22914;&#34394;&#25311;&#20027;&#26426;&#30340;&#21442;&#25968;&#19981;&#20877;&#35828;&#20102;&#65292;&#22240;&#20026;&#23448;&#26041;&#37117;&#26377;&#35814;&#32454;&#30340;&#25991;&#26723;&#65292;&#21482;&#35828;&#35828;&#25972;&#20307;&#30340;&#24605;&#36335;&#65292;&#22914;&#26524;&#26377;&#38169;&#35823;&#27426;&#36814;&#25293;&#30742;&#12290;&lt;/p&gt;
&lt;hr /&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;h2&gt;Apache&#20171;&#32461;&lt;/h2&gt;
&lt;p&gt;Apache&#22312;Web&#26381;&#21153;&#22120;&#19978;&#26377;&#30528;&#19981;&#23569;&#30340;&#20221;&#39069;&#65292;&#25105;&#20010;&#20154;&#35273;&#24471;&#25343;&#26469;&#36305;PHP&#20043;&#31867;&#30340;&#26381;&#21153;&#35201;&#27604;nginx&#31283;&#23450;&#30340;&#22810;&#65292;&#24403;&#28982;&#22914;&#26524;&#20570;&#21453;&#21521;&#20195;&#29702;&#30340;&#35805;&#36824;&#26159;&#39318;&#36873;nginx&#12290;&lt;/p&gt;
&lt;p&gt;Apache&#30340;httpd&#26381;&#21153;&#22120;&#30446;&#21069;&#26377;&#20004;&#20010;&#20998;&#25903;&#65292;Apache 1.3&#31995;&#21015;&#21644;2.x&#31995;&#21015;&#65292;&#21069;&#32773;&#24050;&#32463;&#34987;Ubuntu&#33258;7.1&#29256;&#26412;&#24320;&#22987;&#21076;&#38500;&#12290;&#22312;Ubuntu&#21644;Debian&#20013;&#65292;Apache&#30340;&#20027;&#35201;&#21151;&#33021;&#27169;&#22359;&#65288;Multi-Processing Module&#65292;MPM&#65292;&#22810;&#36947;&#22788;&#29702;&#27169;&#22359;&#65289;&#34987;&#20998;&#25104;&#20102;&#19981;&#21516;&#30340;&#36719;&#20214;&#21253;&#65292;&#20998;&#21035;&#26159;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;apache2-mpm-event&#8212;&#8212;&#20107;&#20214;&#39537;&#21160;&lt;/li&gt;
&lt;li&gt;apache2-mpm-perchild&#8212;&#8212;&#36807;&#28193;&#36719;&#20214;&#21253;&#65292;&#20381;&#36182;worker&lt;/li&gt;
&lt;li&gt;apache2-mpm-prefork&#8212;&#8212;&#20256;&#32479;MPM&#65292;&#20860;&#23481;1.3&#65292;&#26080;&#22810;&#32447;&#31243;&lt;/li&gt;
&lt;li&gt;apache2-mpm-worker&#8212;&#8212;&#22810;&#32447;&#31243;&#12289;&#22810;&#36827;&#31243;&#28151;&#21512;&#27169;&#22411;&#30340;&#39640;&#36895;MPM&lt;/li&gt;
&lt;li&gt;apache2-mpm-itk&#8212;&#8212;&#22522;&#20110;prefork&#23454;&#29616;&#30340;&#22810;&#29992;&#25143;MPM&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;Apache MPM&#36873;&#25321;&lt;/h2&gt;
&lt;p&gt;Ubuntu&#25552;&#20379;Apache 2&#30340;&#19977;&#20010;&#36719;&#20214;&#21253;&#20998;&#21035;&#26159;event&#12289;prefork&#12289;worker&#12290;&#35201;&#24819;&#35753;Apache&#30340;&#24615;&#33021;&#26368;&#20339;&#65292;&#31532;&#19968;&#27493;&#35201;&#20570;&#30340;&#23601;&#26159;&#36873;&#25321;&#21512;&#36866;&#30340;MPM&#12290;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;event&#65306;&#36825;&#20010;MPM&#36866;&#29992;&#20110;&#38656;&#35201;&#26377;&#22823;&#37327;&#25345;&#32493;&#36830;&#25509;&#30340;(KeepAlive)&#30340;&#24773;&#20917;&#65292;KeepAlive&#30340;&#22909;&#22788;&#30456;&#20449;&#22823;&#23478;&#37117;&#30693;&#36947;&#65292;&#21487;&#20197;&#22312;&#21516;&#19968;&#20010;TCP&#36830;&#25509;&#20013;&#21709;&#24212;&#22810;&#27425;&#35831;&#27714;&#65292;&#36825;&#31181;&#35831;&#27714;&#26041;&#24335;&#21487;&#20197;&#20351;&#19968;&#20010;&#21253;&#21547;&#24456;&#22810;&#20803;&#32032;&#65288;&#22270;&#29255;&#65292;CSS&#65292;etc&#65289;&#30340;HTML&#32593;&#39029;&#21152;&#36895;&#19968;&#21322;&#20197;&#19978;&#12290;&#22312;&#37197;&#32622;&#25991;&#20214;&#20013;&#35774;&#32622;KeepAlive&#20026;On&#65292;&#23601;&#21487;&#20197;&#24320;&#21551;KeepAlive&#12290;&lt;/li&gt;
&lt;li&gt;perfork&#65306;&#23454;&#29616;&#20102;&#19968;&#20010;&#38750;&#32447;&#31243;&#30340;MPM&#65292;&#20860;&#23481;1.3&#65292;&#34429;&#28982;&#36895;&#24230;&#19981;&#26159;&#24456;&#24555;&#65292;&#20294;&#26159;&#38750;&#24120;&#31283;&#23450;&#65292;&#33021;&#22815;&#38548;&#31163;&#27599;&#19968;&#20010;&#35831;&#27714;&#12290;perfork&#39038;&#21517;&#24605;&#20041;&#65292;&#23601;&#26159;&#20027;&#36827;&#31243;&#20808;&#27966;&#29983;&#20986;&#19968;&#22534;&#23376;&#36827;&#31243;&#65292;&#36825;&#26679;&#26032;&#30340;&#35831;&#27714;&#26469;&#20102;&#20197;&#21518;&#19981;&#38656;&#35201;&#31561;&#24453;&#26381;&#21153;&#22120;&#20135;&#29983;&#23376;&#36827;&#31243;&#25152;&#33457;&#30340;&#26102;&#38388;&#12290;&#20351;&#29992;perfork&#26368;&#37325;&#35201;&#30340;&#26159;&#35774;&#32622;MacClients&#30340;&#20540;&#65292;&#35201;&#36275;&#22815;&#22823;&#20197;&#21457;&#25381;&#24456;&#22909;&#30340;&#24615;&#33021;&#65292;&#20294;&#26159;&#19981;&#33021;&#22826;&#39640;&#38450;&#27490;&#20869;&#23384;&#29190;&#25481;&#12290;&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;worker&#65306;Apache 2&#30340;&#26032;MPM&#12290;&#22810;&#36827;&#31243;+&#22810;&#32447;&#31243;&#65292;&#36164;&#28304;&#21344;&#29992;&#23567;&#30340;&#21516;&#26102;&#20063;&#27604;perfork&#35201;&#39640;&#25928;&#30340;&#22810;&#65292;&#26159;&#26410;&#26469;Apache 2&#30340;&#21457;&#23637;&#36235;&#21183;&#21543;&#12290;&#35813;MPM&#37325;&#35201;&#30340;&#26159;&#20004;&#20010;&#36873;&#39033;&#65306;MaxClients&#21644;ThreadsPerChild&#12290;ThreadsPerChild&#29992;&#26469;&#27599;&#20010;&#23376;&#36827;&#31243;&#20801;&#35768;&#24314;&#31435;&#30340;&#32447;&#31243;&#25968;&#65292;MaxClients&#29992;&#26469;&#25511;&#21046;&#20801;&#35768;&#24314;&#31435;&#30340;&#24635;&#32447;&#31243;&#25968;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#32508;&#19978;&#25152;&#36848;&#65292;&#22914;&#26524;&#38656;&#35201;&#26356;&#22909;&#30340;&#20280;&#32553;&#24615;&#65292;&#36873;&#25321;worker&#25110;event&#65292;&#22914;&#26524;&#38656;&#35201;&#26356;&#22909;&#30340;&#31283;&#23450;&#24615;&#21644;&#20860;&#23481;&#24615;&#65292;&#36873;&#25321;perfork&#12290;&#22914;&#26524;&#26080;&#27861;&#35780;&#20272;&#33258;&#24049;&#30340;&#38656;&#35201;&#65292;&#19981;&#22952;&#30452;&#25509;&#36873;&#25321;worker&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;&#23433;&#35013;&#21644;&#37197;&#32622;Apache 2&lt;/h2&gt;
&lt;p&gt;&#36825;&#37324;&#20197;worker&#20026;&#20363;&#65292;worker&#20063;&#26159;Apache 2&#25512;&#33616;&#30340;MPM&#65292;&#22312;Ubuntu&#20013;&#65292;&#20351;&#29992;&#19979;&#38754;&#30340;&#21629;&#20196;&#23433;&#35013;&#36719;&#20214;&#21253;&#65292;&#20107;&#23454;&#19978;&#23433;&#35013;&#30340;&#23601;&#26159;apache2-mpm-worker&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ sudo apt-get install apache2
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;Apache&#30340;&#36719;&#20214;&#21253;&#26159;&#30001;Ubuntu&#23448;&#26041;&#26680;&#24515;&#24320;&#21457;&#32452;&#32500;&#25252;&#30340;&#12290;&#20182;&#20204;&#22312;&#32534;&#35793;&#30340;&#26102;&#20505;&#21482;&#32534;&#35793;&#20102;&#24456;&#23569;&#30340;&#27169;&#22359;&#12290;&#22914;&#26524;&#38656;&#35201;&#20854;&#20182;&#27169;&#22359;&#21017;&#38656;&#35201;&#25163;&#21160;&#28155;&#21152;&#12290;&#40664;&#35748;&#32534;&#35793;&#36827;&#21435;&#30340;&#27169;&#22359;&#26377;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ apache2 -l
Compiled in modules:
core.c
mod_log_config.c
mod_logio.c
worker.c
http_core.c
mod_so.c
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#19979;&#38754;&#35828;&#19968;&#19979;Apache 2&#30340;&#37197;&#32622;&#25991;&#20214;&#35828;&#26126;&#65288;Ubuntu ONLY&#65289;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;/etc/apache2
apache2.conf &#8212;&#8212; &#20840;&#23616;&#37197;&#32622;&#25991;&#20214;
conf.d/ &#8212;&#8212; &#19968;&#33324;&#24615;&#37197;&#32622;
envvars &#8212;&#8212; &#29615;&#22659;&#21464;&#37327;
httpd.conf &#8212;&#8212; &#29992;&#25143;&#37197;&#32622;&#25991;&#20214;
mods-available/ &#8212;&#8212; &#24050;&#32463;&#23433;&#35013;&#30340;&#21487;&#29992;&#27169;&#22359;
mods-enabled/ &#8212;&#8212; &#24050;&#32463;&#21551;&#29992;&#30340;&#27169;&#22359;
&#65288;&#20320;&#21487;&#20197;&#20351;&#29992;a2enmod&#21644;a2dismod&#21629;&#20196;&#26469;&#26597;&#30475;&#21487;&#29992;&#21644;&#24050;&#32463;&#21551;&#29992;&#30340;&#27169;&#22359;&#65289;
ports.conf &#8212;&#8212; httpd&#26381;&#21153;&#30340;&#31471;&#21475;
sites-available &#8212;&#8212; &#21487;&#29992;&#30340;&#34394;&#25311;&#20027;&#26426;
sites-enabled &#8212;&#8212; &#24050;&#32463;&#21551;&#29992;&#30340;&#34394;&#25311;&#20027;&#26426;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;Apache&#32593;&#39029;&#25991;&#20214;&#23384;&#25918;&#20301;&#32622;&#65306;&lt;/p&gt;
&lt;p&gt;&#40664;&#35748;Apache&#25226;&#32593;&#31449;&#23384;&#25918;&#22312;/var/www&#30446;&#24405;&#19979;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;DocumentRoot&#26356;&#25913;&#36825;&#19968;&#35774;&#32622;&#65292;&#23545;&#20110;&#20010;&#20154;&#32780;&#35328;&#25105;&#35273;&#24471;&#36824;&#26159;&#19981;&#35201;&#20462;&#25913;&#65292;&#28982;&#21518;&#20351;&#29992;&#31867;&#20284;&#19979;&#21015;&#30340;&#32467;&#26500;&#23433;&#25490;&#20250;&#33719;&#24471;&#27604;&#36739;&#22909;&#30340;&#25928;&#26524;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;/var/www/www.4321.la
/var/www/blog.4321.la
/var/www/martianlaboratory.com
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#26679;&#23384;&#25918;&#30340;&#22909;&#22788;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#65292;&#24403;&#28982;&#22914;&#26524;&#20320;&#35201;&#24320;&#34394;&#25311;&#20027;&#26426;&#65292;&#23384;&#25918;&#22312;/home&#19979;&#38754;&#26159;&#26356;&#22909;&#30340;&#36873;&#25321;&#65292;&#22240;&#20026;&#29992;&#25143;&#38656;&#35201;&#30331;&#38470;&#21040;&#33258;&#24049;&#30340;&#30446;&#24405;&#36827;&#34892;&#31649;&#29702;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;Apache &#34394;&#25311;&#20027;&#26426;&lt;/h2&gt;
&lt;p&gt;&#23433;&#35013;Apache&#20197;&#21518;&#65292;&#35775;&#38382;IP&#22320;&#22336;&#22914;&#26524;&#20986;&#29616;&lt;strong&gt;It Works!&lt;/strong&gt;&#36825;&#26679;&#30340;&#23383;&#26679;&#35828;&#26126;Apache&#24050;&#32463;&#22312;&#25552;&#20379;&#26381;&#21153;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#19979;&#38754;&#26469;&#35828;&#26126;&#22914;&#20309;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#34394;&#25311;&#20027;&#26426;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;
&lt;p&gt;&#20808;&#23558;&#40664;&#35748;&#30340;&#34394;&#25311;&#20027;&#26426;&#22797;&#21046;&#19968;&#20221;&#65292;&#22312;&#27492;&#22522;&#30784;&#19978;&#20462;&#25913;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ cp /etc/apache2/sites-available/default /etc/apache2/sites-available/martianlaboratory.com
vim /etc/apache2/sites-available/martianlaboratory.com
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25171;&#24320;&#30340;vim&#32534;&#36753;&#20013;&#65292;&#23558;DocumentRoot&#25913;&#20026;DocumentRoot /var/www/martianlaboratory.com/&#65292;Directory&#21516;&#26102;&#20063;&#35201;&#20462;&#25913;&#12290;&lt;strong&gt;&#28155;&#21152;ServerName martianlaboratory.com&lt;/strong&gt;&#65292;&#32465;&#23450;&#21040;&#22495;&#21517;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;&#22914;&#26524;&#26377;&#24456;&#22810;&#34394;&#25311;&#20027;&#26426;&#65292;&#24314;&#35758;&#20462;&#25913;ErrorLog&#21644;CustomLog&#30340;&#36335;&#24452;&#12290;&lt;/li&gt;
&lt;li&gt;&#20445;&#23384;&#37197;&#32622;&#25991;&#20214;&#12290;&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#21019;&#24314; /var/www/martianlaboratory.com &#30446;&#24405;&#65292;&#28982;&#21518;&#37325;&#21551;&#19968;&#19979;Apache&#21363;&#21487;&#30475;&#21040;&#26032;&#30340;&#34394;&#25311;&#20027;&#26426;&#29983;&#25928;&#20102;&#12290;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;sudo mkdir /var/www/martianlaboratory.com
cd /var/www/martianlaboratory.com
echo "&amp;lt;h1&amp;gt;Hello&amp;lt;/h1&amp;gt;" | sudo tee index.html
sudo a2ensite martianlaboratory.com
sudo /etc/init.d/apache2 restart
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#36825;&#26679;&#19968;&#20010;Apache&#30340;&#34394;&#25311;&#20027;&#26426;&#23601;&#37197;&#32622;&#23436;&#25104;&#20102;&#65292;&#34394;&#25311;&#20027;&#26426;&#30340;&#37197;&#32622;&#21442;&#25968;&#36824;&#26377;&#24456;&#22810;&#23601;&#19981;&#36184;&#36848;&#20102;&#65292;&#32593;&#19978;&#36824;&#26377;&#23448;&#26041;&#26377;&#24456;&#22810;&#21442;&#25968;&#30340;&#35814;&#32454;&#35299;&#37322;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;Apache HTTPS&#23454;&#29616;&lt;/h2&gt;
&lt;p&gt;&#24453;&#32493;&#8230;&#8230;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;&#20248;&#21270;Apache&#24615;&#33021;&lt;/h2&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;p&gt;&#20851;&#38381;DNS&#26597;&#35810;&lt;/p&gt;
&lt;p&gt;&#40664;&#35748;&#30340;HostnameLookups&#22312;&#40664;&#35748;&#24773;&#20917;&#19979;&#24050;&#32463;&#34987;&#35774;&#32622;&#20026;off&#65292;&#35831;&#20445;&#25345;&#35813;&#35774;&#32622;&#12290;&#22914;&#26524;&#24320;&#21551;&#36825;&#20010;&#35774;&#32622;&#65292;&#27599;&#27425;&#23458;&#25143;&#35831;&#27714;&#30340;&#26102;&#20505;&#37117;&#20250;&#33457;&#26102;&#38388;&#21435;&#33719;&#21462;&#23458;&#25143;&#30340;&#22495;&#21517;&#12290;&#40664;&#35748;&#35760;&#24405;IP&#22320;&#22336;&#20854;&#23454;&#24050;&#32463;&#36275;&#22815;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#20248;&#21270;MaxClients
    &#23545;&#20110;MacClients&#30340;&#35774;&#32622;&#26159;&#21644;MPM&#30456;&#20851;&#30340;&#65292;&#22312;/etc/apache2/e2.conf&#25991;&#20214;&#20013;&#12290;&#20197;work&#20026;&#20363;&#65292;&#40664;&#35748;&#30340;&#37197;&#32622;&#20026;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;IfModule mpm_worker_module&amp;gt;
StartServers          2
MinSpareThreads      25
MaxSpareThreads      75 
ThreadLimit          64
ThreadsPerChild      25
MaxClients          150
MaxRequestsPerChild   0
&amp;lt;/IfModule&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#22914;&#26524;&#20320;&#30340;Apache 2&#30340;&#38169;&#35823;&#26085;&#24535;&#25991;&#20214;&#20013;&#20986;&#29616;&#20197;&#19979;&#25552;&#31034;&#65292;&#23601;&#24212;&#35813;&#22686;&#22823;MaxClients&#20102;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;[error] server reached MaxClients settings, consider raising the Max Clients setting.
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#20248;&#21270;KeepAlive&lt;/p&gt;
&lt;p&gt;KeepAlive&#30340;&#22909;&#22788;&#26159;&#22914;&#26524;&#23458;&#25143;&#31471;&#21457;&#20986;&#22810;&#20010;&#35831;&#27714;&#65292;&#26381;&#21153;&#22120;&#19981;&#24517;&#27599;&#27425;&#37117;&#33457;&#26102;&#38388;&#21435;&#21019;&#24314;&#36830;&#25509;&#12290;&#22351;&#22788;&#20063;&#26174;&#32780;&#26131;&#35265;&#65292;&#23601;&#26159;&#36825;&#27573;&#26102;&#38388;&#20869;&#65292;&#21363;&#20351;&#23458;&#25143;&#31471;&#19981;&#20877;&#21457;&#20986;&#35831;&#27714;&#65292;&#36825;&#20010;&#36830;&#25509;&#20063;&#36824;&#26159;&#34987;&#21344;&#30528;&#65292;&#26159;&#19968;&#31181;&#36164;&#28304;&#30340;&#28010;&#36153;&#12290;&lt;/p&gt;
&lt;p&gt;&#40664;&#35748;&#24773;&#20917;&#19979;KeepAlive&#26159;On&#30340;&#65292;KeepAliveTimeout&#26159;15&#31186;&#12290;&#22914;&#26524;&#26381;&#21153;&#22120;&#30340;&#35831;&#27714;&#36739;&#22810;&#12289;&#20869;&#23384;&#36739;&#23567;&#65292;&#21487;&#20197;&#36890;&#36807;&#31105;&#29992;&#12289;&#23558;KeepAliveTimeout&#25913;&#23567;&#30340;&#26041;&#27861;&#20248;&#21270;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#21551;&#29992;&#21387;&#32553;&lt;/p&gt;
&lt;p&gt;&#22312;IIS&#21644;Apache 1.3&#37324;&#38754;&#65292;gzip&#27169;&#22359;&#20960;&#20046;&#26159;&#24517;&#22791;&#12290;&#22312;Apache 2&#37324;&#38754;&#65292;&#21462;&#32780;&#20195;&#20043;&#30340;&#26159;deflate&#27169;&#22359;&#65292;&#21387;&#32553;&#27604;&#24456;&#39640;&#65292;&#21487;&#20197;&#26497;&#22823;&#30340;&#33410;&#32422;&#24102;&#23485;&#65292;&#24403;&#28982;&#21387;&#32553;&#26159;&#38656;&#35201;&#33457;&#36153;CPU&#26102;&#38388;&#30340;&#12290;&lt;/p&gt;
&lt;p&gt;&#35201;&#21551;&#29992;&#35813;&#27169;&#22359;&#65292;&#36816;&#34892;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;    sudo a2enmod deflate
    sudo /etc/init.d/apache2 force-reload
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#20010;&#27169;&#22359;&#30340;&#37197;&#32622;&#25991;&#20214;&#22312;&#65306;/etc/apache2/modes-enabled/deflate.conf&#65292;&#22914;&#26524;&#38656;&#35201;&#21487;&#20197;&#36827;&#34892;&#37197;&#32622;&#65292;&#40664;&#35748;&#30340;&#37197;&#32622;&#24050;&#32463;&#36739;&#20026;&#21512;&#29702;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#20351;&#29992;&#32531;&#23384;&lt;/p&gt;
&lt;p&gt;Apache 2&#30340;&#32531;&#23384;&#27169;&#22359;&#26377;&#20004;&#20010;&#65292;&#22522;&#20110;&#30828;&#30424;&#30340;disk_cache&#21644;&#22522;&#20110;&#20869;&#23384;&#30340;mem_cache&#12290;&#36825;&#37324;&#19981;&#20877;&#36184;&#36848;&#65292;&#27605;&#31455;&#32531;&#23384;&#20174;&#26381;&#21153;&#22120;&#23618;&#38754;&#21644;&#20174;&#32593;&#31449;&#23618;&#38754;&#30340;&#20248;&#21270;&#26041;&#27861;&#37117;&#26377;&#24456;&#22810;&#65292;&#38656;&#35201;&#26681;&#25454;&#33258;&#24049;&#30340;&#38656;&#35201;&#36827;&#34892;&#35843;&#25972;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#31105;&#29992;&#26085;&#24535;&lt;/p&gt;
&lt;p&gt;&#20889;&#26085;&#24535;&#26159;&#24456;&#28040;&#32791;&#36164;&#28304;&#30340;&#65292;&#22914;&#26524;&#20320;&#30340;&#32593;&#31449;&#19981;&#38656;&#35201;&#26085;&#24535;&#35760;&#24405;&#21487;&#20197;&#20851;&#38381;&#65292;&#25110;&#32773;&#37319;&#29992;&#25277;&#26679;&#35760;&#24405;&#30340;&#26041;&#24335;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;Apache &#23433;&#20840;&#35774;&#32622;&lt;/h2&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;p&gt;&#25991;&#20214;&#26435;&#38480;&lt;/p&gt;
&lt;p&gt;&#26377;&#26102;&#20505;&#20256;&#19968;&#20010;cgi&#25991;&#20214;&#65292;&#20256;&#21040;&#26381;&#21153;&#22120;&#19978;&#65292;&#21457;&#29616;Permission Denied&#65292;&#28982;&#21518;&#26524;&#26029;&#23601;chmod 777&#65292;&#34429;&#28982;&#33021;&#22815;&#35299;&#20915;&#38382;&#39064;&#65292;&#20294;&#26159;&#36825;&#26159;&#38750;&#24120;&#19981;&#23433;&#20840;&#30340;&#20570;&#27861;&#12290;&lt;/p&gt;
&lt;p&gt;&#27491;&#30830;&#30340;&#26435;&#38480;&#24212;&#35813;&#26159;755&#65288;&#25152;&#26377;&#20154;&#21487;&#25191;&#34892;&#65292;&#25991;&#20214;&#25317;&#26377;&#32773;&#21487;&#20197;&#20889;&#20837;&#65289;&lt;/p&gt;
&lt;p&gt;&#19968;&#33324;&#26469;&#35828;&#65292;.htaccess&#24212;&#35813;&#26159;644&#65292;.htpasswd&#24212;&#35813;&#26159;640&#65292;&#19968;&#20123;&#19981;&#24819;&#21035;&#20154;&#30475;&#21040;&#30340;&#25991;&#20214;&#65292;&#27604;&#22914;config&#25991;&#20214;&#65292;&#21487;&#20197;&#32473;400&#12290;&#22914;&#26524;&#26576;&#20123;&#25991;&#20214;&#38656;&#35201;&#20889;&#20837;&#26435;&#38480;&#30340;&#35805;&#65292;&#21487;&#20197;&#20808;&#35774;&#32622;766&#65292;&#20889;&#23436;&#21518;&#25913;&#22238;755&#65292;&#38500;&#38750;&#29305;&#21035;&#38656;&#35201;&#19981;&#35201;&#29992;777&#26435;&#38480;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#23494;&#30721;&#35748;&#35777;&lt;/p&gt;
&lt;p&gt;&#24453;&#32493;&#8230;&#8230;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#19981;&#35201;&#29992;root&#36816;&#34892;Apache&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ ps auxf | grep apache
root      1753  0.0  0.1   6160   724 pts/0    S+   22:10   0:00          \_ grep --color=auto apache
root      1594  0.0  0.6  75700  3316 ?        Ss   21:47   0:00 /usr/sbin/apache2 -k start
www-data  1695  0.0  0.3  75700  1964 ?        S    22:00   0:00  \_ /usr/sbin/apache2 -k start
www-data  1696  0.0  0.5 299132  2600 ?        Sl   22:00   0:00  \_ /usr/sbin/apache2 -k start
www-data  1697  0.0  0.5 299132  2604 ?        Sl   22:00   0:00  \_ /usr/sbin/apache2 -k start
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#19978;&#38754;&#21487;&#20197;&#30475;&#20986;&#26159;www-data&#36825;&#20010;&#29992;&#25143;&#36816;&#34892;&#30340;Apache&#65292;&#36825;&#20010;&#29992;&#25143;&#26159;&#23433;&#35013;&#30340;&#26102;&#20505;&#40664;&#35748;&#21019;&#24314;&#30340;&#65292;&#36825;&#26679;&#26159;&#23433;&#20840;&#30340;&#12290;&#22914;&#26524;&#21457;&#29616;Apache&#22312;root&#19979;&#36816;&#34892;&#65292;&#20272;&#35745;&#8230;&#8230;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#23433;&#20840;&#26356;&#26032;&lt;/p&gt;
&lt;p&gt;&#33719;&#21462;&#23433;&#20840;&#26356;&#26032;&#65292;&#30331;&#38470;&#26381;&#21153;&#22120;&#25191;&#34892;&#19979;&#21015;&#21629;&#20196;&#21363;&#21487;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;sudo apt-get update &amp;amp;&amp;amp; sudo apt-get upgrade
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#22914;&#26524;&#38656;&#35201;&#65292;&#21487;&#20197;&#35746;&#38405;Ubuntu&#30340;&#23433;&#20840;&#37038;&#20214;&#21015;&#34920;&#12290;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;h2&gt;Apache&#26085;&#24535;&#20998;&#26512;&lt;/h2&gt;
&lt;pre&gt;&lt;code&gt;&#24453;&#32493;&#8230;&#8230;
&lt;/code&gt;&lt;/pre&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;hr /&gt;
&lt;p&gt;&#21999;&#65292;&#20808;&#20889;&#36825;&#20040;&#22810;&#65292;&#20197;&#21518;&#25277;&#31354;&#25226;&#20960;&#20010;&#38382;&#39064;&#20877;&#34917;&#19978;&#65292;&#37197;&#32622;PHP&#12289;MySQL&#30340;&#31508;&#35760;&#21518;&#32493;&#25972;&#29702;&#25972;&#29702;&#20877;&#34917;&#19978;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-05-27-ubuntu-apache</guid><pubDate>Sun, 27 May 2012 08:52:00 GMT</pubDate></item><item><title>&#20351;&#29992;Sparkle&#20026;OS X App&#28155;&#21152;&#33258;&#21160;&#26356;&#26032;&#21151;&#33021;</title><link>http://blog.4321.la/article/2012-05-26-use-sparkle-to-set-up-check-update-system</link><description>&lt;p&gt;&#22914;&#26524;&#20320;&#32454;&#24515;&#30340;&#35805;&#65292;&#20250;&#21457;&#29616;OS X&#19979;&#38754;&#30340;&#24456;&#22810;&#24212;&#29992;&#30340;&#33258;&#21160;&#26356;&#26032;&#26426;&#21046;&#37117;&#38750;&#24120;&#30456;&#20284;&#65292;&#27809;&#38169;&#65292;&#20182;&#20204;&#37117;&#29992;&#30340;&#26159;&lt;strong&gt;Sparkle&lt;/strong&gt;&#36825;&#20010;framework&#12290;&#65288;App Store&#37324;&#38754;&#30340;&#24212;&#29992;&#38500;&#22806;&#65292;&#22240;&#20026;&#33529;&#26524;&#31105;&#27490;&#20351;&#29992;&#31532;&#19977;&#26041;&#26356;&#26032;&#31995;&#32479;&#65289;&lt;/p&gt;
&lt;p&gt;&#21516;&#31867;&#30340;framwork&#36824;&#26377;Google&#30340;&lt;a href="http://code.google.com/p/update-engine/"&gt;Update Engine&lt;/a&gt;&#65292;&#30456;&#27604;&#36739;&#35201;&#24378;&#22823;&#19968;&#20123;&#65292;&#19981;&#36807;&#23545;&#20110;&#19968;&#33324;&#30340;&#24212;&#29992;&#26469;&#35828;Sparkle&#23601;&#36275;&#22815;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="Sparkle" src="http://sparkle.andymatuschak.org/Screenshot.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&#22914;&#20309;&#20026;&#25105;&#30340;&#31243;&#24207;&#28155;&#21152;&#33258;&#21160;&#26356;&#26032;&#31995;&#32479;&#65311;&lt;/p&gt;
&lt;h3&gt;&#22522;&#26412;&#35774;&#23450;&lt;/h3&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;p&gt;&lt;strong&gt;&#22312;&#20320;&#30340;&#39033;&#30446;&#20013;&#28155;&#21152; Sparkle framwork&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#19979;&#36733;Sparkle &lt;a href="http://sparkle.andymatuschak.org/"&gt;http://sparkle.andymatuschak.org/&lt;/a&gt;&#65292;&#35299;&#21387;&lt;/li&gt;
&lt;li&gt;&#23558; &lt;strong&gt;Sparkle.framework&lt;/strong&gt; &#25302;&#25341;&#21040;&#39033;&#30446;&#30340;Framework folder&#20013;&#65292;&#21516;&#26102;&#30830;&#23450;&#21246;&#36873;Xcode&#25552;&#31034;&#26694;&#20013;&#30340;&#8220;Copy items into the destination group&#8217;s folder&#8221;&lt;/li&gt;
&lt;li&gt;&#22312;Project Navigator&#20013;&#21333;&#20987;&#20320;&#30340;&#39033;&#30446;&#65292;&#36873;&#25321;&#20320;&#30340;Target&#65292;&#20999;&#25442;&#21040;Build Phases&#36873;&#39033;&#21345;&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#21333;&#20987;&#21491;&#19979;&#35282;&#30340;Add Build Phase&#65292;&#36873;&#25321;Copy Files&lt;/p&gt;
&lt;p&gt;&lt;img alt="Imgur" src="http://i.imgur.com/ji1h0.png" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#22312;Destination&#20013;&#36873;&#25321;Frameworks&#65292;&#28982;&#21518;&#25226;Sparkle.framwork&#25302;&#25341;&#36827;&#21435; 
    &lt;img alt="Imgur" src="http://i.imgur.com/dcQBu.png" /&gt;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&lt;strong&gt;&#35774;&#32622; Sparkle Updater Object&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#25171;&#24320;&#20320;&#30340;MainMenu.nib&lt;/li&gt;
&lt;li&gt;&#36873;&#25321; View &#8594; Utilities &#8594; Object Library&#65292;&#25214;&#21040;Object&#65292;&#21452;&#20987;&#28155;&#21152;&lt;/li&gt;
&lt;li&gt;&#21333;&#20987;&#21018;&#21018;&#28155;&#21152;&#30340;Object&lt;/li&gt;
&lt;li&gt;&#22312;Custom Class&#37324;&#38754;&#36755;&#20837;SUUpdater&lt;/li&gt;
&lt;li&gt;&#22914;&#26524;&#38656;&#35201;&#65292;&#20320;&#20063;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;Menu Item&#65292;&#28982;&#21518;&#25226;&#23427;&#30340;taeget&#35774;&#32622;&#21040;SUUpdater&#23454;&#20363;&#30340;checkForUpdates:&#26041;&#27861;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&lt;strong&gt;&#25968;&#23383;&#31614;&#21517;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&#20026;&#20102;&#30830;&#20445;&#26356;&#26032;&#26159;&#26469;&#33258;&#24320;&#21457;&#32773;&#30340;&#26381;&#21153;&#22120;&#24182;&#32463;&#36807;&#24320;&#21457;&#32773;&#30340;&#25480;&#26435;&#65292;&#19981;&#34987;&#31532;&#19977;&#26041;&#31713;&#25913;&#65292;Sparkle&#28155;&#21152;&#20102;&#25968;&#23383;&#31614;&#21517;&#26426;&#21046;&#12290;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#25171;&#24320;&#32456;&#31471;&#65292;cd&#21040;Sparkle&#30446;&#24405;&#30340;Extras/Signing\ Tools&#25991;&#20214;&#22841;&#19979;&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;ruby generate_keys.rb
    &#31245;&#31561;&#29255;&#21051;&#23601;&#21487;&#20197;&#30475;&#21040;&#22914;&#19979;&#25552;&#31034;&#65306;
    &lt;img alt="Imgur" src="http://i.imgur.com/7eJuV.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36825;&#26102;&#30446;&#24405;&#20013;&#23601;&#20250;&#20986;&#29616;dsa_pub.pem&#21644;dsa_priv.pem&#20004;&#20010;&#25991;&#20214;&#65292;&#20445;&#23384;&#22909;dsa_priv.pem&#36825;&#20010;&#20284;&#26377;&#30340;&#23494;&#38053;&#12290;
    * &#23558;Public Key (dsa_pub.pem) &#28155;&#21152;&#21040;&#39033;&#30446;&#30340;&#36164;&#28304;&#25991;&#20214;&#22841;&#20013;
    * &#22312;&#39033;&#30446;&#30340;Info.plist&#20013;&#28155;&#21152;&#19968;&#20010;SUPublicDSAKeyFile Key&#65292;&#28982;&#21518;&#23558;&#23427;&#30340;&#20540;&#35774;&#32622;&#20026;Public Key&#30340;&#25991;&#20214;&#21517;&#31216;&#65288;&#40664;&#35748;dsa_pub.pem&#65289;&lt;/p&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&lt;strong&gt;&#35774;&#32622;&#26356;&#26032;&#36890;&#30693;&#26381;&#21153;&#12289;&#21457;&#24067;&#26032;&#26356;&#26032;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#36890;&#30693;&#37319;&#29992;&#19968;&#20010;RSS Feed&#65292;&#20855;&#20307;&#26684;&#24335;&#21450;&#21457;&#24067;&#26356;&#26032;&#30340;&#26041;&#27861;&#21442;&#35265;&#65306;&lt;a href="https://github.com/andymatuschak/Sparkle/wiki/publishing-an-update"&gt;https://github.com/andymatuschak/Sparkle/wiki/publishing-an-update&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&#22312;&#39033;&#30446;&#30340;Info.plist&#20013;&#28155;&#21152;&#19968;&#20010;SUFeedURL Key&#65292;&#28982;&#21518;&#25226;&#23427;&#30340;&#20540;&#35774;&#32622;&#25104;RSS&#30340;URL&#12290;&lt;/li&gt;
&lt;li&gt;&#30830;&#20445;&#22312;Info.plist&#37324;&#38754;&#26377;&#19968;&#20010;&#21512;&#36866;&#30340;CFBundleVersion&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&lt;strong&gt;&#22914;&#26524;&#38656;&#35201;&#65292;&#27979;&#35797;&#25972;&#20010;&#31995;&#32479;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#30830;&#20445;&#35201;&#26032;&#31243;&#24207;&#30340;CFBundleVersion&#35201;&#27604;&#26087;&#29256;&#26412;&#30340;CFBundleVersion&#20540;&#22823;&lt;/li&gt;
&lt;li&gt;&#31243;&#24207;&#20250;&#22312;&#31532;&#20108;&#27425;&#36816;&#34892;&#30340;&#26102;&#20505;&#25552;&#31034;&#26159;&#21542;&#33258;&#21160;&#26816;&#26597;&#26356;&#26032;&#65292;&#19981;&#22312;&#31532;&#19968;&#27425;&#21551;&#21160;&#30340;&#26102;&#20505;&#23601;&#25552;&#31034;&#26159;&#32473;&#29992;&#25143;&#20026;&#20102;&#30041;&#19979;&#19968;&#20010;&#22909;&#21360;&#35937;&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#25972;&#20010;&#36807;&#31243;&#23601;&#23436;&#25104;&#20102;&#65292;&#21518;&#32493;&#21457;&#24067;&#26356;&#26032;&#21487;&#20197;&#21442;&#29031;&#31532;&#22235;&#27493;&#20013;&#30340;&#24341;&#29992;&#30340;URL&#20013;&#30340;&#35828;&#26126;&#36827;&#34892;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-05-26-use-sparkle-to-set-up-check-update-system</guid><pubDate>Sat, 26 May 2012 21:01:00 GMT</pubDate></item><item><title>&#24320;&#28304;&#30340;DynamicLyrics 2.0&#27426;&#36814;&#24744;&#30340;&#21442;&#19982;</title><link>http://blog.4321.la/article/2012-05-26-dynamiclyrics-2-dot-0</link><description>&lt;p&gt;&#22909;&#20037;&#27809;&#26356;&#26032;&#21338;&#23458;&#20102;&#8230;&#8230;&#23454;&#22312;&#26159;&#27809;&#26377;&#22810;&#23569;&#38386;&#20313;&#30340;&#26102;&#38388;&#65292;&#22823;&#23478;&#20851;&#20110;&#36719;&#20214;&#30340;&#35780;&#35770;&#25105;&#37117;&#30475;&#21040;&#20102;&#65292;&#27809;&#26377;&#22238;&#22797;&#22823;&#23478;&#23454;&#22312;&#26159;&#25265;&#27465;&#12290;&lt;/p&gt;
&lt;p&gt;&#20808;&#35828;&#28857;&#39064;&#22806;&#35805;&#65292;Windows&#29256;&#26412;&#30340;MusicSeeker&#23558;&#20572;&#27490;&#26356;&#26032;&#65292;&#26087;&#29256;&#26412;&#20063;&#19981;&#20877;&#24320;&#25918;&#20351;&#29992;&#65292;&#25105;&#30446;&#21069;&#30340;&#24320;&#21457;&#24179;&#21488;&#20026;OS X&#65292;&#26242;&#26102;&#21482;&#25552;&#20379;OS X&#36719;&#20214;&#30340;&#26356;&#26032;&#12290;&lt;/p&gt;
&lt;p&gt;&#35328;&#24402;&#27491;&#20256;&#65292;DynamicLyrics 2.0&#26159;DynamicLyrics&#30340;&#19968;&#20010;&#20027;&#29256;&#26412;&#26356;&#26032;&#65292;&#36825;&#27425;&#30340;&#26356;&#26032;&#24102;&#26469;&#20102;&#20197;&#19979;&#29305;&#24615;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#26631;&#39064;&#26639;&#27468;&#35789;&lt;/li&gt;
&lt;li&gt;&#26700;&#38754;&#27468;&#35789;&lt;/li&gt;
&lt;li&gt;&#19987;&#36753;&#23553;&#38754;&#25628;&#32034;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&#32454;&#33410;&#26041;&#38754;&#20063;&#26377;&#25152;&#25913;&#36827;&#65306;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&#28155;&#21152;&#38543;&#30528;iTunes&#21551;&#21160;&#21644;&#36864;&#20986;&#30340;&#21151;&#33021;&lt;/li&gt;
&lt;li&gt;&#28155;&#21152;&#20889;&#20837;&#27468;&#35789;&#30340;&#21151;&#33021;&lt;/li&gt;
&lt;li&gt;&#20248;&#21270;&#25972;&#20010;&#36719;&#20214;&#30340;&#36923;&#36753;&lt;/li&gt;
&lt;li&gt;&#23548;&#20986;&#27468;&#35789;&#12289;&#19987;&#36753;&#23553;&#38754;&#30340;&#21151;&#33021;&lt;/li&gt;
&lt;/ul&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#21516;&#26102;&#65292;DynamicLyrics&#26159;&#19968;&#27454;&#24320;&#28304;&#30340;&#36719;&#20214;&#65288;&lt;a href="https://github.com/MartianZ/DynamicLyrics"&gt;https://github.com/MartianZ/DynamicLyrics&lt;/a&gt;&#65289;&#65292;&#24744;&#21487;&#20197;&#38543;&#26102;fork&#65292;&#28982;&#21518;&#20462;&#25913;&#33719;&#24471;&#24744;&#33258;&#24049;&#38656;&#35201;&#30340;&#29305;&#24615;&#12290;&lt;/p&gt;
&lt;p&gt;&#30446;&#21069;&#36719;&#20214;&#36824;&#27809;&#26377;&#27491;&#24335;&#29256;&#26412;&#25552;&#20379;&#19979;&#36733;&#65292;&#21508;&#20301;&#21487;&#20197;&#32852;&#31995;&#25105;&#65288;E-Mail/GTalk: fzyadmin[AT]gmail.com&#65289;&#33719;&#24471;Alpha&#29256;&#26412;&#65292;&#25110;&#32773;clone&#39033;&#30446;&#20351;&#29992;Xcode&#32534;&#35793;&#12290;&lt;/p&gt;
&lt;p&gt;&#25130;&#22270;&#39044;&#35272;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="Imgur" src="http://i.imgur.com/QupHK.png" /&gt;
&lt;img alt="Imgur" src="http://i.imgur.com/QwRQG.jpg" /&gt;
&lt;img alt="Imgur" src="http://i.imgur.com/gv9FK.png" /&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-05-26-dynamiclyrics-2-dot-0</guid><pubDate>Sat, 26 May 2012 18:20:00 GMT</pubDate></item><item><title>&#20351;&#29992;SAE&#21644;Automator&#22312;Mac OS X&#19978;&#21019;&#24314;&#25130;&#22270;&#24182;&#33258;&#21160;&#19978;&#20256;&#30340;&#23567;&#24212;&#29992;</title><link>http://blog.4321.la/article/2012-02-12-use-sae-to-setup-uploading-system</link><description>&lt;p&gt;&#20808;&#35828;&#28857;&#39064;&#22806;&#35805;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#22823;&#23478;&#37117;&#30693;&#36947;&#26377;&#19968;&#20010;&#24456;&#22909;&#29992;&#30340;IM&#65292;&#21483;&#33150;&#35759;QQ&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#27809;&#38169;&#65292;&#36825;&#19996;&#35199;&#30830;&#23454;&#26159;&#22909;&#29992;&#65292;&#33267;&#23569;&#22312;Windows&#21644;Mac OS X&#19979;&#24456;&#22909;&#29992;&#65292;&#22312;&#21508;&#20010;&#20027;&#27969;&#25163;&#26426;&#24179;&#21488;&#19978;&#20063;&#19981;&#38169;&#65292;&#21807;&#29420;&#22312;Linux&#19979;&#27604;&#36739;&#21487;&#24754;&#65292;&#23448;&#26041;&#30340;&#35299;&#20915;&#26041;&#26696;&#23601;&#26159;&#35753;&#25105;&#20204;&#29992;&#37027;&#20010;&#20026;&#20102;&#25216;&#26415;&#32780;&#25216;&#26415;&#12289;&#20026;&#20102;&#24179;&#21488;&#32780;&#24179;&#21488;&#30340;&#33219;&#32959;&#30340;WebQQ&#65292;&#24403;&#28982;&#20063;&#26377;&#31532;&#19977;&#26041;&#30340;&#19968;&#20123;&#24320;&#28304;&#39033;&#30446;&#65292;&#26469;&#20998;&#26512;QQ&#30340;&#21327;&#35758;&#23454;&#29616;&#23458;&#25143;&#31471;&#65292;&#20294;&#26159;&#24635;&#24402;&#33150;&#35759;QQ&#30340;&#21327;&#35758;&#26159;&#23553;&#38381;&#30340;&#65292;&#23454;&#38469;&#25928;&#26524;&#20063;&#38590;&#23613;&#22914;&#20154;&#24847;&#12290;&lt;/p&gt;
&lt;p&gt;&#36319;&#22969;&#23376;&#20204;&#32842;&#22825;&#29992;QQ&#36275;&#30691;&#65292;&#25105;Mac&#20826;&#34920;&#31034;&#24456;&#33298;&#22374;&#65292;&#20294;&#26159;&#36319;&#21508;&#20301;Linuxer&#25216;&#26415;&#23429;&#32842;&#22825;&#23601;&#34507;&#30140;&#20102;&#65292;&#21482;&#33021;&#29992;&#20854;&#20182;&#30340;IM&#65292;&#27604;&#22914;Google Talk&#25110;&#32773;Skype&#12290;&lt;/p&gt;
&lt;p&gt;&#36825;&#20123;IM&#34429;&#28982;&#26377;&#22312;Linux&#19979;&#25552;&#20379;&#23458;&#25143;&#31471;&#65292;&#20294;&#26159;&#23454;&#22312;&#26159;&#35753;&#20154;&#37057;&#38391;&#30340;&#35201;&#27515;&#65292;&#26368;&#24971;&#20154;&#30340;&#23601;&#26159;&#19981;&#33021;&#38543;&#26102;&#21457;&#36865;&#22270;&#29255;&#12290;&#20043;&#21069;&#25105;&#26159;&#36890;&#36807;Cloud&#12289;YunIO&#36825;&#20123;&#24212;&#29992;&#35299;&#20915;&#65292;&#20294;&#26159;&#36824;&#26159;&#35273;&#24471;&#19981;&#22815;&#33298;&#26381;&#65292;&#32780;&#19988;Cloud&#30340;&#26381;&#21153;&#22120;&#36824;&#34987;&#22681;&#20102;&#65292;&#21035;&#20154;&#30475;&#22270;&#29255;&#20063;&#19981;&#26041;&#20415;&#12290;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#65292;&#25105;&#23601;&#25970;&#20102;&#20960;&#34892;&#20195;&#30721;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#37319;&#29992;Sina App Engine&#25645;&#24314;&#26381;&#21153;&#31471;&#65292;&#26412;&#22320;&#37319;&#29992;Automator&#65292;&#22914;&#26524;&#20320;&#26159;Linux&#31995;&#32479;&#65292;&#20063;&#21487;&#20197;&#20889;&#19968;&#20010;&#24456;&#23567;&#30340;bash&#33050;&#26412;&#35299;&#20915;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&#20174;Sina App Engine&#19978;&#26032;&#24314;&#19968;&#20010;&#39033;&#30446;&#65292;&#28982;&#21518;&#20174;&#39033;&#30446;&#30340;&#31649;&#29702;&#37324;&#38754;&#21551;&#29992;Storage&#26381;&#21153;&#65292;&#26032;&#24314;&#19968;&#20010;domain&#65292;&#25105;&#36825;&#37324;&#32473;domain&#21629;&#21517;&#21483;h&#65292;&#28982;&#21518;&#20851;&#38381;domain&#30340;&#38450;&#30423;&#38142;&#12290;&#20855;&#20307;&#25805;&#20316;&#19981;&#20877;&#36184;&#36848;&#12290;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65306;&#23558;&#19979;&#38754;&#30340;php&#20195;&#30721;&#37096;&#32626;&#19978;&#21435;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;    &amp;lt;?php

    function extend($file_name) 
    { 
        $extend = pathinfo($file_name); 
        $extend = strtolower($extend["extension"]); 
        return $extend; 
    }

    $target_path = SAE_TMP_PATH;
    $basename = basename( $_FILES['file']['name']);
    $domain = 'h';
    $uuid = md5(uniqid(rand(), true));
    $target_path = $target_path.$uuid;

    if(move_uploaded_file($_FILES['file']['tmp_name'], $target_path)) {
    } else{
        echo "There was an error uploading the file, please try again!\n";
    }

    $s = new SaeStorage();

    echo $s-&amp;gt;upload($domain, $uuid.".".extend($basename),$target_path)."\n";

    //echo $url;

    ?&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;php&#20195;&#30721;&#24456;&#31616;&#21333;&#65292;&#23601;&#26159;&#25509;&#21463;post&#35831;&#27714;&#28982;&#21518;&#25226;&#25991;&#20214;&#20445;&#23384;&#21040;Storage&#37324;&#38754;&#65292;&#20043;&#21518;&#36755;&#20986;&#25991;&#20214;&#30340;&#35775;&#38382;&#22320;&#22336;&lt;/p&gt;
&lt;p&gt;&#31532;&#19977;&#27493;&#65306;&#20174;&#32456;&#31471;&#37324;&#38754;&#27979;&#35797;&lt;/p&gt;
&lt;p&gt;&#20351;&#29992;curl&#21629;&#20196;&#25105;&#20204;&#26469;&#19978;&#20256;&#19968;&#20010;&#22270;&#29255;&#35797;&#35797;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;    curl http://&#39033;&#30446;&#22320;&#22336;.sinaapp.com/php.php -F file="@1.jpg"
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#20854;&#20013;1.jpg&#26159;&#24403;&#21069;&#30446;&#24405;&#19979;&#38754;&#30340;&#19968;&#24352;&#22270;&#29255;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#27809;&#26377;&#38169;&#35823;&#30340;&#35805;&#23601;&#21487;&#20197;&#30475;&#21040;&#32456;&#31471;&#37324;&#38754;&#36755;&#20986;&#20102;&#19978;&#20256;&#21518;&#30340;&#25991;&#20214;&#22320;&#22336;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="img" src="http://i.imgur.com/8Nx42.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#22235;&#27493;&#65306;&#24314;&#31435;&#26032;&#30340;Automator&#24212;&#29992;&#31243;&#24207;&#39033;&#30446;&#65292;&#22914;&#22270;&#25152;&#31034;&#65306;&lt;/p&gt;
&lt;p&gt;&#20854;&#20013;&#20004;&#20010;Growl Notification&#20998;&#21035;&#25552;&#31034;&#24320;&#22987;&#19978;&#20256;&#21644;&#19978;&#20256;&#32467;&#26463;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="automator" src="http://i.imgur.com/mDGbI.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#20043;&#21518;&#23558;Automator&#39033;&#30446;&#20445;&#23384;&#21363;&#21487;&#65292;&#25918;&#21040;Dock&#19978;&#65292;&#20197;&#21518;&#21487;&#20197;&#38543;&#26102;&#36816;&#34892;&#25130;&#22270;&#28982;&#21518;&#33258;&#21160;&#19978;&#20256;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-02-12-use-sae-to-setup-uploading-system</guid><pubDate>Sun, 12 Feb 2012 17:25:00 GMT</pubDate></item><item><title>MatriTunes &#33258;&#21160;&#25972;&#29702;&#22635;&#20805;iTunes&#27468;&#26354;&#19987;&#36753;&#22270;&#29255;&#12289;&#27468;&#35789;&#36741;&#21161;&#24037;&#20855;</title><link>http://blog.4321.la/article/2012-02-02-matritunes</link><description>&lt;p&gt;&#20170;&#22825;&#26089;&#19978;&#26377;&#19968;&#20301;&#26379;&#21451;&#32473;&#25105;&#21457;&#35780;&#35770;&#65292;&#26195;&#20043;&#20197;&#29702;&#21160;&#20043;&#20197;&#24773;&#65292;&#35828;MXiTunes&#36825;&#27454;&#36719;&#20214;&#19981;&#33021;&#29992;&#20102;&#20160;&#20040;&#20160;&#20040;&#20160;&#20040;&#65292;&#25105;&#30340;MusicSorter&#19981;&#22909;&#29992;&#20160;&#20040;&#20160;&#20040;&#65288;&#25105;&#25215;&#35748;&#37027;&#26159;&#20010;&#36133;&#31508;&#20043;&#20316;&#65292;&#25105;&#25237;&#20837;&#20102;&#22823;&#37327;&#31934;&#21147;&#22312;&#30028;&#38754;&#35774;&#35745;&#19978;&#65292;&#23548;&#33268;&#36719;&#20214;&#30340;&#21151;&#33021;&#27424;&#32570;&#22826;&#22810;&#65289;&#12290;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#25105;&#23601;&#21435;&#30475;&#20102;&#19968;&#19979;MXiTunes&#26159;&#20160;&#20040;&#19996;&#35199;&#65292;&#21407;&#26469;&#26159;&#19968;&#27454;Windows&#19979;&#30340;&#25972;&#29702;iTunes&#21015;&#34920;&#30340;&#36719;&#20214;&#65292;&#24456;&#19981;&#38169;&#30340;&#26679;&#23376;&#12290;&#19981;&#36807;&#21407;&#20316;&#32773;&#30340;&#23448;&#26041;&#32593;&#31449;&#25171;&#19981;&#24320;&#65292;&#32463;&#36807;&#26816;&#26597;&#26159;&#22240;&#20026;cn&#22495;&#21517;&#34987;&#26242;&#20572;&#35299;&#26512;&#30340;&#32536;&#25925;&#65292;&#32780;&#19988;&#22312;&#25105;&#30340;&#33521;&#25991;&#29256;Windows 7 64Bit&#19978;&#20063;&#27515;&#27963;&#26080;&#27861;&#25171;&#24320;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#25105;&#23601;&#21448;&#21435;&#25970;&#20195;&#30721;&#20102;&#65292;&#19977;&#20010;&#23567;&#26102;&#25630;&#23450;&#20102;&#36825;&#27454;&#36719;&#20214;&#8212;&#8212;MatriTunes&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&lt;img alt="MatriTunes" src="http://i.imgur.com/KjbTV.png" /&gt;&lt;/p&gt;
&lt;h3&gt;&#36719;&#20214;&#20171;&#32461;&#12289;&#20351;&#29992;&#35828;&#26126;&#65306;&lt;/h3&gt;
&lt;ol&gt;
&lt;li&gt;
&lt;p&gt;&#22240;&#20026;&#26102;&#38388;&#32039;&#24352;&#65292;&#37319;&#29992;.Net Framework 2.0&#24320;&#21457;&#65288;Windows 7&#33258;&#24102;&#65289;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25903;&#25345;&#33258;&#21160;&#27468;&#26354;&#25628;&#32034;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25903;&#25345;&#25209;&#37327;&#33719;&#21462;&#27468;&#35789;&#12289;&#19987;&#36753;&#22270;&#29255;&#65292;&#25903;&#25345;&#25163;&#21160;&#35774;&#32622;&#19987;&#36753;&#22270;&#29255;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25209;&#37327;&#25628;&#32034;&#25928;&#26524;&#19982;&#24744;&#24403;&#21069;&#30340;MetaData&#20851;&#31995;&#24456;&#22823;&#65292;&#22914;&#26524;&#25209;&#37327;&#25628;&#32034;&#25928;&#26524;&#19981;&#20339;&#25512;&#33616;&#24744;&#19968;&#20010;&#19968;&#20010;&#24930;&#24930;&#26469;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#36719;&#20214;&#24320;&#21457;&#20179;&#20419;&#65292;&#26377;&#20219;&#20309;&#38382;&#39064;&#35831;&#32473;&#25105;&#21457;Mail&#25110;&#32773;&#20174;&#36825;&#20010;post&#19979;&#38754;&#30041;&#35328;&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#25105;&#23454;&#22312;&#26159;&#25042;&#24471;&#24320;&#22810;&#32447;&#31243;&#20102;&#65292;&#25152;&#20197;&#25209;&#37327;&#19979;&#36733;&#30340;&#26102;&#20505;&#23613;&#37327;&#19968;&#27425;&#19981;&#35201;&#36873;&#25321;&#22826;&#22810;&#27468;&#26354;&#65292;&#21516;&#26102;&#36719;&#20214;&#24037;&#20316;&#26102;&#19981;&#35201;&#20081;&#21435;&#25139;&#23427;=&#12290;=&lt;/p&gt;
&lt;/li&gt;
&lt;li&gt;
&lt;p&gt;&#23613;&#37327;&#25226;DNS&#25913;&#25104;&#26412;&#22320;&#30340;DNS&#65292;&#19981;&#28982;&#35910;&#29923;&#19979;&#36733;&#19987;&#36753;&#22270;&#29255;&#36895;&#24230;&#20250;&#24456;&#24930;&lt;/p&gt;
&lt;/li&gt;
&lt;/ol&gt;
&lt;h3&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/h3&gt;
&lt;p&gt;&lt;a href="http://martianlaboratory.com/matritunes/MatriTunes.zip"&gt;http://martianlaboratory.com/matritunes/MatriTunes.zip&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-02-02-matritunes</guid><pubDate>Thu, 02 Feb 2012 15:08:00 GMT</pubDate></item><item><title>&#20351;&#29992;AppleScript&#26469;&#33258;&#21160;&#33719;&#21462;&#22635;&#20805;iTunes&#27468;&#26354;&#27468;&#35789;</title><link>http://blog.4321.la/article/2012-01-27-use-applescript-to-set-itunes-lyrics</link><description>&lt;p&gt;Martian&#30495;&#30340;&#26159;&#25042;&#27515;&#20102;&#8943;&#8943;Martian&#26082;&#19981;&#24819;&#24320;&#25628;&#32034;&#24341;&#25806;&#25628;&#27468;&#35789;&#65292;&#20063;&#19981;&#24819;&#24320;&#37027;&#20869;&#23384;&#21507;&#36135;Xcode&#26469;&#24110;&#24537;&#8943;&#8943;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#25105;&#23601;&#29992;PHP&#21644;AppleScript&#20889;&#20102;&#19968;&#20010;&#23567;&#33050;&#26412;&#26469;&#23454;&#29616;&#33258;&#21160;&#33719;&#21462;iTunes&#30340;&#27468;&#26354;&#27468;&#35789;&#65374;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#33050;&#26412;&#28304;&#20195;&#30721;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;--AppleScript By Martian
--Ver 1.1
--http://blog.4321.la
--https://plus.google.com/100204491389909955903/
--http://twitter.com/martian_zhu
--http://about.me/martian_z

property myProgram : "4321.La"
property baseURL : "http://lyrics.sinaapp.com/"

--&#22240;&#20026;&#25105;&#23454;&#22312;&#26159;&#19981;&#24819;&#25805;&#24515;AppleScript&#30340;&#35821;&#27861;&#65292;&#25152;&#20197;&#19968;&#37096;&#20998;&#20195;&#30721;&#37319;&#29992;PHP&#32534;&#20889;
--&#20026;&#20102;&#33719;&#24471;&#26368;&#22909;&#30340;&#25972;&#29702;&#25928;&#26524;&#65292;PHP&#33050;&#26412;&#25346;&#22312;SAE&#19978;&#38754;&#65292;&#22823;&#38470;&#29992;&#25143;&#30340;&#35775;&#38382;&#36895;&#24230;&#24212;&#35813;&#38750;&#24120;&#19981;&#38169;
--&#20294;&#26159;SAE&#30340;&#20215;&#26684;&#26159;&#25353;&#29031;&#35831;&#27714;&#27425;&#25968;&#35745;&#36153;&#65292;&#23454;&#22312;&#26159;&#19981;&#20415;&#23452;&#65292;&#22914;&#26524;&#24744;&#33021;&#33258;&#24049;&#26550;&#35774;PHP&#26381;&#21153;&#22120;&#24182;&#19988;&#25552;&#20379;&#20998;&#27969;&#26381;&#21153;&#65292;&#25105;&#20250;&#38750;&#24120;&#24863;&#28608;&#65281;
--PHP&#28304;&#20195;&#30721;&#21487;&#20197;&#35265;&#25105;&#30340;&#21338;&#23458;&#24086;&#23376;&#65292;&#37324;&#38754;&#26377;&#35828;&#26126;

--&#20351;&#29992;&#35828;&#26126;&#65306;
--1&#12289;&#25171;&#24320;iTunes&#65292;&#36873;&#25321;&#35201;&#28155;&#21152;&#27468;&#35789;&#30340;&#27468;&#26354;&#65292;&#21487;&#20197;&#25209;&#37327;&#36873;&#25321;
--2&#12289;&#28857;&#20987;&#33050;&#26412;&#19978;&#30340;&#8220;&#36816;&#34892;&#8221;&#21363;&#21487;&#65292;&#25972;&#29702;&#32467;&#26463;&#26102;iTunes&#20250;&#26377;&#25552;&#31034;
--3&#12289;&#34429;&#28982;&#33050;&#26412;&#25903;&#25345;&#25209;&#37327;&#25972;&#29702;&#65292;&#20294;&#26159;&#31243;&#24207;&#33258;&#21160;&#21270;&#25972;&#29702;&#27704;&#36828;&#19981;&#21487;&#33021;&#37027;&#20040;&#26234;&#33021;&#65292;&#19981;&#33021;&#20445;&#35777;&#27468;&#26354;&#27468;&#35789;&#20840;&#37096;&#27491;&#30830;&#65292;&#21487;&#33021;&#38656;&#35201;&#24744;&#21518;&#26399;&#20877;&#27425;&#21152;&#24037;
--4&#12289;&#22914;&#26524;&#24744;&#30340;&#27468;&#26354;&#20013;&#21547;&#26377;&#32321;&#20307;&#27721;&#23383;&#65292;&#31243;&#24207;&#26080;&#27861;&#33258;&#21160;&#25628;&#32034;&#27468;&#35789;&#65292;&#36825;&#20250;&#22312;&#21518;&#32493;&#29256;&#26412;&#20013;&#20462;&#27491;

tell application "iTunes"
    if selection is not {} then
        set k to count (item of selection)
    else
        return
    end if
set i to 1
repeat
    set theTrack to (item i of selection)
    set this_artist to (get artist of theTrack)
    set this_title to (get name of theTrack)

    set requestData to "title=" &amp;amp; this_title &amp;amp; "&amp;amp;artist=" &amp;amp; this_artist
    set songLyrics to do shell script "curl -d '" &amp;amp; requestData &amp;amp; "' " &amp;amp; baseURL
    if length of songLyrics &amp;gt; 1 then
        set lyrics of theTrack to songLyrics
    end if
    set i to i + 1
    if i &amp;gt; k then exit repeat
end repeat
display dialog return &amp;amp; "&#25972;&#29702;&#32467;&#26463;&#65281;" buttons {"&#30830;&#23450;"} default button 1 with icon 1 giving up after 15 with title myProgram
end tell
&lt;/code&gt;&lt;/pre&gt;
&lt;h3&gt;&#20351;&#29992;&#35828;&#26126;&#65306;&lt;/h3&gt;
&lt;p&gt;1&#12289;&#25171;&#24320; &#24212;&#29992;&#31243;&#24207; &#65293; &#23454;&#29992;&#24037;&#20855; &#65293; AppleScript&#32534;&#36753;&#22120;.app&lt;/p&gt;
&lt;p&gt;2&#12289;&#23558;&#19978;&#36848;&#20195;&#30721;&#31896;&#36148;&#36827;&#21435;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3&#12289;&#28982;&#21518;&#21435;&#30475;&#33050;&#26412;&#37324;&#38754;&#30340;&#35828;&#26126;&#36827;&#19968;&#27493;&#25805;&#20316;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&#38468;&#24405;&#65306;PHP&#26381;&#21153;&#31471;&#28304;&#20195;&#30721;&#65288;&#21482;&#22312;&#33258;&#24049;&#25645;&#24314;&#26381;&#21153;&#31471;&#38656;&#35201;&#65289;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;?

function SingleDecToHex($dec)  { 
$tmp=""; 
$dec=$dec%16; 
if($dec&amp;lt;10) return $tmp.$dec; 
$arr=array("A","B","C","D","E","F"); 
return $tmp.$arr[$dec-10]; 
} 
function SetToHexString($str)  { 
if(!$str) return false; 
$tmp=""; 
for($i=0;$i&amp;lt;strlen($str);$i++) 
{ 
    $ord=ord($str[$i]); 
    $tmp.=SingleDecToHex(($ord-$ord%16)/16); 
    $tmp.=SingleDecToHex($ord%16); 
} 
return $tmp; 
} 
function qianqian_code($str) { 
$s=strtolower($str); 
    $keys = array(" ","'","(",")","[","]",",",".","'","\""," ", "`", "~", "!", "@", "#", "$", "%", "^", "&amp;amp;", "*", "(", ")", "-", "_", "=", "+", ",", "&amp;lt;", ".", "&amp;gt;", "/", "?", ";", ":", "\"", "[", "{", "]", "}", "\\", "|", "&#8364;","&#12288;", "&#12290;", "&#65292;", "&#12289;", "&#65307;", "&#65306;", "&#65311;", "&#65281;", "&#8230;", "&#8212;", "·","&#713;", "¨", "&#8216;", "&#8217;", "&#8220;", "&#8221;", "&#12293;", "&#65374;", "&#8214;", "&#8758;", "&#65282;", "&#65287;","&#65344;", "&#65372;", "&#12291;", "&#12308;", "&#12309;", "&#12296;", "&#12297;", "&#12298;", "&#12299;", "&#12300;", "&#12301;", "&#12302;", "&#12303;", "&#65294;", "&#12310;", "&#12311;", "&#12304;", "&#12305;", "&#65288;", "&#65289;", "&#65339;", "&#65341;","&#65371;", "&#65373;", "&#8776;", "&#8801;", "&#8800;", "&#65309;", "&#8804;", "&#8805;", "&#65308;", "&#65310;", "&#8814;", "&#8815;", "&#8759;", "±","&#65291;", "&#65293;", "×", "÷", "&#65295;", "&#8747;", "&#8750;", "&#8733;", "&#8734;", "&#8743;", "&#8744;", "&#8721;", "&#8719;", "&#8746;","&#8745;", "&#8712;", "&#8757;", "&#8756;", "&#8869;", "&#8741;", "&#8736;", "&#8978;", "&#8857;", "&#8780;", "&#8765;", "&#8730;", "§", "&#8470;","&#9734;", "&#9733;", "&#9675;", "&#9679;", "&#9678;", "&#9671;", "&#9670;", "&#9633;", "&#8451;", "&#8240;", "&#9632;", "&#9651;", "&#9650;", "&#8251;", "&#8594;","&#8592;", "&#8593;", "&#8595;", "&#12307;", "¤", "°", "&#65283;", "&#65286;", "&#65312;", "&#65340;", "&#65087;", "&#65343;", "&#65507;", "&#8213;","&#9794;", "&#9792;", "&#8544;", "&#8545;", "&#8546;", "&#8547;", "&#8548;", "&#8549;", "&#8550;", "&#8551;", "&#8552;", "&#8553;", "&#8554;","&#8555;", "&#9352;", "&#9353;", "&#9354;", "&#9355;", "&#9356;", "&#9357;", "&#9358;", "&#9359;", "&#9360;", "&#9361;", "&#9362;", "&#9363;","&#9364;", "&#9365;", "&#9366;", "&#9367;", "&#9368;", "&#9369;", "&#9370;", "&#9371;", "&#12832;", "&#12833;", "&#12834;", "&#12835;", "&#12836;","&#12837;", "&#12838;", "&#12839;", "&#12840;", "&#12841;", "&#9312;", "&#9313;", "&#9314;", "&#9315;", "&#9316;", "&#9317;", "&#9318;", "&#9319;", "&#9320;", "&#9321;","&#9332;", "&#9333;", "&#9334;", "&#9335;", "&#9336;", "&#9337;", "&#9338;", "&#9339;", "&#9340;", "&#9341;", "&#9342;", "&#9343;", "&#9344;","&#9345;", "&#9346;", "&#9347;", "&#9348;", "&#9349;", "&#9350;", "&#9351;", "&#9484;", "&#9485;", "&#9486;", "&#9487;", "&#9488;", "&#9489;", "&#9490;","&#9491;", "&#9472;", "&#9476;", "&#9480;", "&#9492;", "&#9493;", "&#9494;", "&#9495;", "&#9496;", "&#9497;", "&#9498;", "&#9499;", "&#9473;", "&#9477;", "&#9481;","&#9500;", "&#9501;", "&#9502;", "&#9503;", "&#9504;", "&#9505;", "&#9506;", "&#9507;", "&#9474;", "&#9478;", "&#9482;", "&#9508;", "&#9509;", "&#9510;", "&#9511;", "&#9512;","&#9513;", "&#9514;", "&#9515;", "&#9475;", "&#9479;", "&#9483;", "&#9516;", "&#9517;", "&#9518;", "&#9519;", "&#9520;", "&#9521;", "&#9522;", "&#9523;", "&#9524;", "&#9525;","&#9526;", "&#9527;", "&#9528;", "&#9529;", "&#9530;", "&#9531;", "&#9532;", "&#9533;", "&#9534;", "&#9535;", "&#9536;", "&#9537;", "&#9538;", "&#9539;", "&#9540;", "&#9541;","&#9542;", "&#9543;", "&#9544;", "&#9545;", "&#9546;", "&#9547;");
foreach ($keys as $key)
    {
        $s=str_replace($key,"",$s); 
    }
return SetToHexString(iconv('UTF-8','UTF-16LE',$s));
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;} &lt;/p&gt;
&lt;pre&gt;&lt;code&gt;function conv($num) { 
$tp = bcmod($num,4294967296);

if(bccomp($num,0)&amp;gt;=0 &amp;amp;&amp;amp; bccomp($tp,2147483648)&amp;gt;0) 
$tp=bcadd($tp,-4294967296); 
if(bccomp($num,0)&amp;lt;0 &amp;amp;&amp;amp; bccomp($tp,2147483648)&amp;lt;0) 
$tp=bcadd($tp,4294967296);

return $tp; 
} 
function CodeFunc($Id,$artist,$title) { 
$Id=(int)$Id; 
$utf8Str=SetToHexString($artist.$title); 
$length=strlen($utf8Str)/2; 
for($i=0;$i&amp;lt;=$length-1;$i++) 
    eval('$song['.$i.'] = 0x'.substr($utf8Str,$i*2,2).';'); 
$tmp2=0; 
$tmp3=0; 
$tmp1 = ($Id &amp;amp; 0x0000FF00) &amp;gt;&amp;gt; 8; //&#21491;&#31227;8&#20301;&#21518;&#20026;0x0000015F

if ( ($Id &amp;amp; 0x00FF0000) == 0 ) { 
    $tmp3 = 0x000000FF &amp;amp; ~$tmp1; //CL 0x000000E7 
}else { 
    $tmp3 = 0x000000FF &amp;amp; (($Id &amp;amp; 0x00FF0000) &amp;gt;&amp;gt; 16); //&#21491;&#31227;16&#20301;&#21518;&#20026;0x00000001 
} 
$tmp3 = $tmp3 | ((0x000000FF &amp;amp; $Id) &amp;lt;&amp;lt; 8); //tmp3 0x00001801 
$tmp3 = $tmp3 &amp;lt;&amp;lt; 8; //tmp3 0x00180100 
$tmp3 = $tmp3 | (0x000000FF &amp;amp; $tmp1); //tmp3 0x0018015F 
$tmp3 = $tmp3 &amp;lt;&amp;lt; 8; //tmp3 0x18015F00 
if ( ($Id &amp;amp; 0xFF000000) == 0 ) { 
    $tmp3 = $tmp3 | (0x000000FF &amp;amp; (~$Id)); //tmp3 0x18015FE7 
} else { 
    $tmp3 = $tmp3 | (0x000000FF &amp;amp; ($Id &amp;gt;&amp;gt; 24)); //&#21491;&#31227;24&#20301;&#21518;&#20026;0x00000000 
} 
$i=$length-1; 
while($i &amp;gt;= 0){ 
    $char = $song[$i]; 
    if($char &amp;gt;= 0x80) $char = $char - 0x100; 
    $tmp1 = ($char + $tmp2) &amp;amp; 0x00000000FFFFFFFF; 
    $tmp2 = ($tmp2 &amp;lt;&amp;lt; ($i%2 + 4)) &amp;amp; 0x00000000FFFFFFFF; 
    $tmp2 = ($tmp1 + $tmp2) &amp;amp; 0x00000000FFFFFFFF; 
    $i -= 1; 
} 
$i=0; 
$tmp1=0; 
while($i&amp;lt;=$length-1){ 
    $char = $song[$i]; 
    if($char &amp;gt;= 128) $char = $char - 256; 
    $tmp7 = ($char + $tmp1) &amp;amp; 0x00000000FFFFFFFF; 
    $tmp1 = ($tmp1 &amp;lt;&amp;lt; ($i%2 + 3)) &amp;amp; 0x00000000FFFFFFFF; 
    $tmp1 = ($tmp1 + $tmp7) &amp;amp; 0x00000000FFFFFFFF; 
    $i += 1; 
} 
$t = conv($tmp2 ^ $tmp3); 
$t = conv(($t+($tmp1 | $Id))); 
$t = conv(bcmul($t , ($tmp1 | $tmp3))); 
$t = conv(bcmul($t , ($tmp2 ^ $Id)));

if(bccomp($t , 2147483648)&amp;gt;0) 
$t = bcadd($t , -4294967296); 
return $t;
} 
header("Content-Type:text/html;charset=UTF-8");
    $artist = $_POST["artist"];
    $title = $_POST["title"];

$doc = new DOMDocument(); 
$doc-&amp;gt;load("http://lrccnc.ttplayer.com/dll/lyricsvr.dll?sh?Artist=".qianqian_code($artist)."&amp;amp;Title=".qianqian_code($title)."&amp;amp;Flags=0");

$lrcNode = $doc-&amp;gt;getElementsByTagName("lrc"); 
$code = 0;
foreach($lrcNode as $lrc) 
{

    $artist=$lrc-&amp;gt;getAttribute("artist"); 
    $title=$lrc-&amp;gt;getAttribute("title"); 
        if ( ($code == 0)  || strpos($title,"&#20013;") || strpos($artist,"&#20013;") )
            {
                $id=$lrc-&amp;gt;getAttribute("id"); 
        $code=CodeFunc($id,$artist,$title);

            }

}

if ($code != 0) {
        $lrcstr=file_get_contents("http://lrccnc.ttplayer.com/dll/lyricsvr.dll?dl?Id=".$id."&amp;amp;Code=".$code); 
        $lrcstr=preg_replace("/\[(.+?)\]/","",$lrcstr); //&#26367;&#25442;&#25481;&#26102;&#38388;&#26631;&#31614;
        $lrcstr=preg_replace("/((.*)QQ:(.*))/","",$lrcstr); // &#26367;&#25442;&#32852;&#31995;QQ&#20160;&#20040;&#30340;&#24191;&#21578;
            $lrcstr=preg_replace("/((.*)QQ&#65306;(.*))/","",$lrcstr);
        echo trim($lrcstr); 
    }

?&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;h3&gt;&#26412;&#25991;&#20316;&#32773;&#65306;Martian http://blog.4321.la &#36716;&#36733;&#35831;&#27880;&#26126;&lt;/h3&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-27-use-applescript-to-set-itunes-lyrics</guid><pubDate>Fri, 27 Jan 2012 19:31:00 GMT</pubDate></item><item><title>&#22312;Mac OS X&#19978;&#26550;&#35774;&#23646;&#20110;&#20320;&#30340;Octopress</title><link>http://blog.4321.la/article/2012-01-25-set-up-octopress</link><description>&lt;p&gt;&#32456;&#20110;&#65292;&#32791;&#26102;N&#22825;&#65292;&#25226;&#25105;&#30340;&#21338;&#23458;&#20174;WordPress&#36716;&#21040;&#20102;Octopress&#65292;&#24182;&#19988;&#24456;&#26080;&#32827;&#30340;&#25176;&#31649;&#21040;GitHub&#19978;&#38754;&#65292;&#20813;&#36153;&#39640;&#36895;&#65374;&lt;/p&gt;
&lt;p&gt;&#36825;&#31687;&#25991;&#31456;&#25945;&#22823;&#23478;&#31616;&#21333;&#30340;Octopress&#30340;&#23433;&#35013;&#19982;&#20351;&#29992;&#12290;&lt;/p&gt;
&lt;p&gt;&#65288;&#22914;&#26524;&#20320;&#29992;&#30340;Windows&#65292;&#20320;&#21487;&#33021;&#20250;&#30896;&#21040;&#19968;&#22534;&#38647;&#8943;&#8943;&#24378;&#28872;&#25512;&#33616;Linux&#25110;&#32773;Mac OS X&#65289;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;h2&gt;1.&#23433;&#35013;&lt;/h2&gt;
&lt;p&gt;Octopress&#30340;&#23433;&#35013;&#19981;&#21516;&#20110;WordPress&#65292;WordPress&#26159;&#23433;&#35013;&#21040;&#26381;&#21153;&#22120;&#19978;&#38754;&#30340;&#65292;Octopress&#26159;&#23433;&#35013;&#22312;&#20320;&#26412;&#22320;&#30340;&#65288;&#22914;&#26524;&#36873;&#25321;Deploy&#21040;GitHub&#19978;&#65289;&#12290;&#39318;&#20808;&#38656;&#35201;&#20934;&#22791;&#30340;&#26159;Ruby&#29615;&#22659;&#65306;&#65288;&#19979;&#38754;&#25945;&#31243;&#22343;&#22312;Mac OS X Lion 10.7.2&#27979;&#35797;&#36890;&#36807;&#65289;&lt;/p&gt;
&lt;p&gt;1&#12289; &#21442;&#32771;&#36825;&#31687;&#25991;&#31456;&#65292;&#23433;&#35013;GCC&#65306;&lt;a href="http://www.memoryz.info/install-gcc-on-mac.html"&gt;http://www.memoryz.info/install-gcc-on-mac.html&lt;/a&gt; &#22914;&#26524;&#20320;&#24050;&#32463;&#23433;&#35013;&#20102;Xcode&#65292;&#21017;&#26080;&#38656;&#37325;&#36127;&#23433;&#35013;GCC&lt;/p&gt;
&lt;p&gt;2&#12289; &#23433;&#35013;&lt;a href="http://mxcl.github.com/homebrew/"&gt;Homebrew&lt;/a&gt;&#65288;&#25110;&#32773;&#20320;&#21487;&#20197;&#21442;&#32771;&#65306;&lt;a href="https://github.com/mxcl/homebrew/wiki/installation"&gt;https://github.com/mxcl/homebrew/wiki/installation&lt;/a&gt;&#65289;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ /usr/bin/ruby -e "$(curl -fsSL https://raw.github.com/gist/323731)"
$ brew update
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&#12289; &#23433;&#35013;Git&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ brew install git
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;4&#12289; &#23433;&#35013;&lt;a href="http://beginrescueend.com/"&gt;RVM&lt;/a&gt;&#65288;&#25110;&#32773;&#21442;&#32771;&#65306;&lt;a href="http://beginrescueend.com/rvm/install/"&gt;http://beginrescueend.com/rvm/install/&lt;/a&gt;&#65289;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ bash -s stable &amp;lt; &amp;lt;(curl -s https://raw.github.com/wayneeseguin/rvm/master/binscripts/rvm-installer)
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;5&#12289; &#23433;&#35013;Ruby 1.9.2&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ rvm install 1.9.2
$ rvm 1.9.2 --default
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;6&#12289; &#23433;&#35013;Pow&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ curl get.pow.cx | sh
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;7&#12289; &#20808;cd&#21040;&#19968;&#20010;&#22909;&#30340;&#30446;&#24405;&#65292;&#27604;&#22914;Desktop&#65292;&#28982;&#21518;&#19979;&#36733;Octopress&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ git clone git://github.com/imathis/octopress.git octopress
$ cd octopress
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;8&#12289; &#23433;&#35013;&#19968;&#20123;&#19996;&#35199;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ gem install bundler
$ rbenv rehash
$ bundle install
$ rake install
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#23601;&#23433;&#35013;&#22909;&#20102;Octopress&#20102;&#65292;&#36755;&#20837;&lt;strong&gt;rake preview&lt;/strong&gt;&#65292;&#20174;localhost:4000&#21487;&#20197;&#39044;&#35272;&#32467;&#26524;&lt;/p&gt;
&lt;h2&gt;2.&#21457;&#24067;&lt;/h2&gt;
&lt;p&gt;1&#12289; &#22312;GitHub&#21517;&#20026; &#8220;http://&#20320;&#30340;GitHub&#29992;&#25143;&#21517;.github.com&#8221; &#30340;repository&#12290;&lt;/p&gt;
&lt;p&gt;2&#12289; &#22312;Octopress&#30446;&#24405;&#37324;&#38754;&#35774;&#23450;&#36164;&#26009;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ rake setup_github_pages
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&#12289; &#29983;&#25104;HTML&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ rake generate
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;4&#12289; &#21457;&#24067;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ rake deploy
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#26679;&#31561;&#24453;&#20960;&#20998;&#38047;&#65292;&#23601;&#21487;&#20197;&#36890;&#36807; http://&#20320;&#30340;GitHub&#29992;&#25143;&#21517;.github.com &#26597;&#30475;&#20320;&#30340;&#20840;&#26032;&#30340;Octopress BLOG&#65281;&lt;/p&gt;
&lt;h2&gt;3.&#32465;&#23450;&#22495;&#21517;&lt;/h2&gt;
&lt;pre&gt;&lt;code&gt;$ echo '&#20320;&#35201;&#32465;&#23450;&#30340;&#22495;&#21517;' &amp;gt;&amp;gt; source/CNAME
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#28982;&#21518;&#65292;&#23558;&#20320;&#35201;&#32465;&#23450;&#30340;&#22495;&#21517;CNAME&#21040; http://&#20320;&#30340;GitHub&#29992;&#25143;&#21517;.github.com&#65292;&#22914;&#26524;&#26159;@&#32426;&#24405;&#65292;&#38656;&#35201;&#21152;&#20837;207.97.227.245&#12290;&lt;/p&gt;
&lt;h2&gt;4.&#21457;&#24067;&#25991;&#31456;&lt;/h2&gt;
&lt;pre&gt;&lt;code&gt;$ rake new_post['title']
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36816;&#34892;&#19978;&#38754;&#30340;&#21629;&#20196;&#65292;Octopress&#20250;&#22312;source/_posts&#29983;&#25104;&#19968;&#20010;markdown&#65288;&#25512;&#33616;&#38405;&#35835;&#65306;&lt;a href="http://markdown.tw/"&gt;http://markdown.tw/&lt;/a&gt;&#65289;&#25991;&#20214;&lt;/p&gt;
&lt;p&gt;&#26356;&#22810;&#30340;&#22914;&#20309;&#32534;&#36753;&#25991;&#26723;&#65292;&#35831;&#21442;&#38405;&#65306;&lt;a href="http://octopress.org/docs/"&gt;http://octopress.org/docs/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#22312;Mac&#19979;&#65292;Markdown&#32534;&#36753;&#22120;&#25512;&#33616;&#19968;&#27454;&#22269;&#20135;&#30340;&#23567;&#36719;&#20214;&#65306;Mou &lt;a href="http://mouapp.com/"&gt;http://mouapp.com/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#24403;&#20320;&#25226;Markdown&#25991;&#26723;&#32534;&#36753;&#22909;&#20197;&#21518;&#20877;&#36816;&#34892;rake generate&#21644;rake deploy&#21457;&#24067;&#21040;GitHub&#19978;&#38754;&lt;/p&gt;
&lt;h2&gt;5.&#24635;&#32467;&lt;/h2&gt;
&lt;p&gt;&#24456;&#22810;&#30340;&#25216;&#24039;&#65292;&#27604;&#22914;&#20462;&#25913;&#27169;&#26495;&#65292;Octopress&#23448;&#26041;&#19978;&#26377;&#35814;&#32454;&#30340;&#35828;&#26126;&#65292;&#20110;&#26159;&#25105;&#19981;&#20877;&#36184;&#36848;&#12290;&#32463;&#36807;&#20960;&#22825;&#20351;&#29992;&#65292;&#36825;&#19996;&#35199;&#30830;&#23454;&#26159;Geek&#21521;&#65292;&#21253;&#25324;&#20462;&#25913;&#27169;&#26495;&#12289;&#23548;&#20837;&#35780;&#35770;&#31561;&#31561;&#24050;&#32463;&#35753;&#25105;&#26080;&#22856;&#20102;N&#27425;&#8943;&#8943;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#20320;&#23545;PHP&#65291;MYSQL&#30340;WordPress&#30340;&#33219;&#32959;&#21644;&#37027;&#38590;&#29992;&#21518;&#21488;&#32534;&#36753;&#22120;&#19981;&#33021;&#24525;&#21463;&#65292;&#19981;&#22952;&#23581;&#35797;&#19968;&#19979;Octopress&#12290;&#21516;&#26102;&#65292;&#25176;&#31649;&#21040;GitHub&#19978;&#38754;&#20063;&#26080;&#38656;&#20877;&#25903;&#20986;&#39640;&#26114;&#30340;&#31354;&#38388;&#36153;&#29992;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-25-set-up-octopress</guid><pubDate>Wed, 25 Jan 2012 16:09:00 GMT</pubDate></item><item><title>MacBook Pro &#65291; Mac OS X Lion SSD&#20248;&#21270;&#24635;&#32467;&#65339;&#22522;&#20110;&#38209;&#20809;M4&#65341;</title><link>http://blog.4321.la/article/2012-01-25-macbook-pro-ssd-optimize</link><description>&lt;p&gt;&#25105;&#22312;&#20080;&#26469;&#36825;&#21488;MacBook Pro&#36824;&#26159;11&#24180;&#30340;&#20107;&#24773;&#65292;&#20080;&#26469;&#20197;&#21518;&#25105;&#23601;&#24863;&#35273;&#34987;&#22353;&#24471;&#24456;&#24443;&#24213;&#8212;&#8212;&#26174;&#21345;&#24615;&#33021;&#28195;&#21040;&#38598;&#26174;&#31243;&#24230;&#12289;&#24320;&#26426;&#36895;&#24230;&#22826;&#24930;&#12289;&#21457;&#28909;&#12289;Flash&#22826;&#28195;&#30475;Bilibili&#22826;&#19981;&#29245;&#8943;&#8943;&lt;/p&gt;
&lt;p&gt;Lion&#20986;&#26469;&#20197;&#21518;&#19978;&#36848;&#38382;&#39064;&#26356;&#21152;&#26126;&#26174;&#65292;&#29978;&#33267;&#36830;Chrome&#37117;&#19981;&#22909;&#29992;&#20102;&#12290;&#20110;&#26159;&#21482;&#33021;&#22312;&#20877;&#27425;&#25487;&#33136;&#21253;&#21319;&#26426;&#30828;&#20214;&#20102;&#65292;&#20808;&#25226;&#20869;&#23384;4G&#21319;&#32423;&#21040;8G&#65292;&#32467;&#26524;&#21457;&#29616;&#20960;&#20046;&#27809;&#26377;&#25913;&#21892;&#65292;&#23588;&#20854;&#26159;Xcode&#65292;&#36229;&#32423;&#21507;&#20869;&#23384;&#65292;&#20110;&#26159;&#19968;&#29408;&#24515;&#65292;&#25105;&#23601;&#20080;&#20102;&#20010;&#38209;&#20809;M4&#30340;SSD&#12290;&lt;/p&gt;
&lt;p&gt;&#25105;&#20080;&#30340;SSD&#21482;&#26377;64GB&#65292;&#22240;&#20026;&#36825;&#19996;&#35199;&#30340;&#21333;&#20301;&#20648;&#23384;&#25104;&#26412;&#23454;&#22312;&#26159;&#22826;&#39640;&#20102;&#12290;SSD&#23545;&#25105;&#26469;&#35828;&#26159;&#20010;&#26032;&#40092;&#29289;&#65292;&#20080;&#26469;&#20197;&#21518;&#21548; &lt;a href="https://plus.google.com/106587986552086492432/posts"&gt;+Shadowmourne G&lt;/a&gt; &#24573;&#24736;&#19968;&#38453;&#23376;&#65292;&#25165;&#30693;&#36947;&#36825;&#19996;&#35199;&#36824;&#24471;&#20248;&#21270;&#65292;&#20110;&#26159;&#35895;&#27468;&#20102;&#21322;&#22825;&#65292;&#21152;&#19978;&#20063;&#29992;&#20102;&#19968;&#27573;&#26102;&#38388;&#20102;&#65292;&#24635;&#32467;&#19968;&#19979;&#65292;&#26041;&#20415;&#20197;&#21518;&#33258;&#24049;&#29992;&#36824;&#26377;&#20854;&#20182;&#26379;&#21451;&#21442;&#32771;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;h2&gt;&#24615;&#33021;&#20248;&#21270;&#65306;&lt;/h2&gt;
&lt;p&gt;1&#12289; &#20851;&#38381;&#32039;&#24613;&#36816;&#21160;&#20256;&#24863;&#22120;&#65306;&lt;/p&gt;
&lt;p&gt;&#36825;&#20010;&#19996;&#35199;&#23601;&#26159;&#22312;&#30636;&#38388;&#31227;&#21160;&#30340;&#26102;&#20505;&#32473;HDD&#19968;&#20010;&#20449;&#21495;&#65292;&#35753;&#20182;&#20572;&#27490;&#35835;&#20889;&#25343;&#24320;&#30913;&#22836;&#12290;&#23545;&#20110;SSD&#26159;&#23436;&#20840;&#27809;&#24517;&#35201;&#30340;&#65292;&#21487;&#20197;&#36890;&#36807;&#19979;&#38754;&#30340;&#21629;&#20196;&#23436;&#20840;&#20851;&#38381;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ sudo pmset -a sms 0
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&#38656;&#35201;&#29305;&#21035;&#35828;&#26126;&#30340;&#26159;&#65292;&#25105;&#25226;SSD&#26356;&#25442;&#19978;&#20197;&#21518;&#65292;&#25226;&#20809;&#39537;&#25286;&#19979;&#26469;&#65292;&#25226;&#21407;&#26469;&#30340;HDD&#25918;&#21040;&#20102;&#20809;&#39537;&#19978;&#65292;&#32463;&#36807;&#26597;&#35810;&#36164;&#26009;&#65292;MBP&#30340;&#20809;&#39537;&#20301;&#26159;&#27809;&#26377;&#32039;&#24613;&#36816;&#21160;&#20256;&#24863;&#22120;&#30340;&#12290;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;2&#12289; &lt;strong&gt;Trim&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Trim&#36825;&#19996;&#35199;&#65292;&#24456;&#22353;&#29241;&#12290;&#32593;&#19978;&#20960;&#20046;&#25152;&#26377;&#20154;&#37117;&#35828;&#35201;&#24320;&#21551;Trim&#65292;&#20026;&#20102;&#20943;&#23569;&#24615;&#33021;&#34928;&#20943;&#21644;&#24310;&#38271;SSD&#30340;&#23551;&#21629;&#12290;&#25105;&#24403;&#26102;&#30475;&#20102;&#25105;&#26379;&#21451;&#30340;MacBook Air&#65292;SSD&#30340;Trim&#26159;&#40664;&#35748;&#24320;&#21551;&#30340;&#65292;&#20294;&#26159;&#25105;&#25442;&#19978;M4&#20197;&#21518;&#65292;Lion&#19979;&#24182;&#27809;&#26377;&#33258;&#21160;&#24320;&#21551;&#12290;&lt;/p&gt;
&lt;p&gt;&#22312;&#20960;&#20010;&#35770;&#22363;&#19978;&#25628;&#32034;&#20102;&#19968;&#19979;&#65292;&#26377;&#19968;&#20010;&#36719;&#20214;&#21483;Tri Enabler&#21487;&#20197;&#24378;&#21046;&#24320;&#21551;&#65292;&#21518;&#26469;&#21457;&#29616;&lt;a href="http://hardforum.com/showthread.php?p=1037771689"&gt;M4&#36824;&#26377;&#22403;&#22334;&#22238;&#25910;&#26426;&#21046;&lt;/a&gt;&#65292;&#20110;&#26159;&#25105;&#21448;&#32416;&#32467;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#25105;&#25214;&#21040;&#20102;&#36825;&#31687;&#25991;&#31456;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://digitaldj.net/2011/07/21/trim-enabler-for-lion/"&gt;http://digitaldj.net/2011/07/21/trim-enabler-for-lion/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#36825;&#31687;&#25991;&#31456;&#20013;&#25552;&#21040;&#65306;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;DO NOT USE TRIM ENABLER (VERSION 1.1 OR 1.2) TO ENABLE TRIM ON LION.&#65288;&#21487;&#20197;&#36890;&#36807;&#32456;&#31471;&#24320;&#21551;&#65289;&lt;/p&gt;
&lt;p&gt;There has also been some confusion about garbage collection and TRIM. TRIM is ALWAYS preferred over Garbage Collection and will likely yield better results. If you have garbage collection, you don&#8217;t necessarily need TRIM, but it&#8217;ll probably offer better performance and there&#8217;s always a chance there&#8217;ll be a degradation of speed over time. Therefore, when using Garbage Collection, you may have to take the drive out and do a secure erase so that everything is re-marked as free space.&lt;/p&gt;
&lt;p&gt;Running garbage collection and TRIM at the same time is NOT a problem. They&#8217;re designed to work together. You can look at it like so: TRIM is called by your OS each time space is freed up. Garbage Collection is run by the drive&#8217;s firmware when idle and determines which parts of the drive can be cleaned up and rearranged. TRIM is obviously more efficient and obviously the drive&#8217;s firmware is aware of the TRIM commands and accounts for this.&lt;/p&gt;
&lt;p&gt;While it&#8217;s true that using TRIM and garbage collection at the same time is essentially using two mechanisms to do the same thing, the firmware on your SSD drive is designed to handle these things. All SSD manufacturers, GC or not, recommend the use of TRIM.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&#20316;&#32773;&#22312;&#25991;&#20013;&#35828;&#26126;&#20102;&#20851;&#20110;&#22403;&#22334;&#22238;&#25910;&#21644;Trim&#30340;&#20851;&#31995;&#65292;&lt;strong&gt;&#25152;&#20197;&#20320;&#30340;SSD&#19981;&#31649;&#26377;&#27809;&#26377;GC&lt;/strong&gt;&#65292;&#37117;&#25512;&#33616;&#24320;&#21551;Trim&#12290;&#32508;&#19978;&#65292;&#25105;&#20204;&#25152;&#20570;&#30340;&#23601;&#26159;&#24320;&#21551;Trim&#65292;&#20294;&#26159;&lt;strong&gt;&#19981;&#35201;&#36890;&#36807;&#37027;&#20010;TRIM ENABLER&#36719;&#20214;&lt;/strong&gt;&#12290;&#26041;&#27861;&#20173;&#28982;&#21487;&#20197;&#21442;&#29031;&#37027;&#31687;&#25991;&#31456;&#25152;&#35828;&#30340;&#22312;&#21629;&#20196;&#34892;&#37324;&#38754;&#24320;&#21551;&#65292;&#36825;&#37324;&#19981;&#20877;&#36184;&#36848;&#12290;&lt;/p&gt;
&lt;p&gt;3&#12289;&#29992;noatime&#26041;&#24335;&#25346;&#36733;SSD&#31995;&#32479;&#30424;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&#29992; noatime &#26041;&#24335;&#25346;&#36733;&#31995;&#32479;&#30424;&#65292;&#36825;&#26679;&#21487;&#20197;&#20943;&#23569;&#19981;&#24517;&#35201;&#30340; I/O &#27425;&#25968;&#65292;&#34429;&#28982; SSD &#20570;&#36825;&#20123;&#25805;&#20316;&#38750;&#24120;&#24555;&#36895;&#65292;&#20294;&#32771;&#34385;&#21040;&#26368;&#21518;&#35775;&#38382;&#26102;&#38388;&#36825;&#20010;&#23646;&#24615;&#20854;&#23454;&#24456;&#23569;&#29992;&#21040;&#65292;&#22823;&#23478;&#20851;&#24515;&#30340;&#19968;&#33324;&#37117;&#26159;&#26368;&#21518;&#20462;&#25913;&#26102;&#38388;&#21644;&#21019;&#24314;&#26102;&#38388;&#65292;&#25152;&#20197;&#23436;&#20840;&#21487;&#20197;&#20851;&#38381;&#36825;&#20010;&#23646;&#24615;&#65292;&#36825;&#22312; Unix/Linux &#19979;&#26159;&#38750;&#24120;&#24120;&#35265;&#30340;&#25991;&#20214;&#31995;&#32479;&#20248;&#21270;&#36873;&#39033;&#12290;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&#22312;&lt;strong&gt;/Library/LaunchDaemons&lt;/strong&gt;&#37324;&#38754;&#21019;&#24314;&#19968;&#20010;&lt;strong&gt;noatime.plist&lt;/strong&gt;&#65292;&#20869;&#23481;&#20026;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;?xml version="1.0" encoding="UTF-8"?&amp;gt;
&amp;lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
"http://www.apple.com/DTDs/PropertyList-1.0.dtd"&amp;gt;
&amp;lt;plist version="1.0"&amp;gt;
&amp;lt;dict&amp;gt;
    &amp;lt;key&amp;gt;Label&amp;lt;/key&amp;gt;
    &amp;lt;string&amp;gt;noatime&amp;lt;/string&amp;gt;
    &amp;lt;key&amp;gt;ProgramArguments&amp;lt;/key&amp;gt;
    &amp;lt;array&amp;gt;
        &amp;lt;string&amp;gt;mount&amp;lt;/string&amp;gt;
        &amp;lt;string&amp;gt;-vuwo&amp;lt;/string&amp;gt;
        &amp;lt;string&amp;gt;noatime&amp;lt;/string&amp;gt;
        &amp;lt;string&amp;gt;/&amp;lt;/string&amp;gt;
    &amp;lt;/array&amp;gt;
    &amp;lt;key&amp;gt;RunAtLoad&amp;lt;/key&amp;gt;
    &amp;lt;true/&amp;gt;
&amp;lt;/dict&amp;gt;
&amp;lt;/plist&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#28982;&#21518;&#20462;&#25913;&#26435;&#38480;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ sudo chown root:wheel /Library/LaunchDaemons/noatime.plist
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#37325;&#21551;&#65292;&#26597;&#30475;&#26159;&#21542;&#29983;&#25928;&#65292;&#21487;&#20197;&#36755;&#20837;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;mount | grep " / "
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#22914;&#26524;&#30475;&#21040;&#36820;&#22238;&#19979;&#38754;&#30340;&#20449;&#24687;&#65292;&#35828;&#26126;OK&#65288;&#27880;&#24847;&#26377;noatime&#65289;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;/dev/disk0s2 on / (hfs, local, journaled, noatime)
&lt;/code&gt;&lt;/pre&gt;
&lt;h2&gt;&#27048;&#24178;&#31354;&#38388;&#65306;&lt;/h2&gt;
&lt;p&gt;1&#12289;&#20851;&#38381;&#20241;&#30496;&#65306;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&#40664;&#35748;&#30340;&#22312; MB/MBP &#19978;, &#31995;&#32479;&#20250;&#22312;&#30913;&#30424;&#19978;&#32500;&#25252;&#19968;&#20010;&#21644;&#20869;&#23384;&#31561;&#22823;&#30340; sleepimage &#25991;&#20214;, &#24403;&#30005;&#37327;&#32791;&#23613;&#26102;&#23558;&#20869;&#23384;&#20013;&#25152;&#26377;&#25968;&#25454;&#20889;&#20837;&#30913;&#30424;, &#31995;&#32479;&#36827;&#20837;&#28145;&#24230;&#20241;&#30496;&#29366;&#24577;, &#19979;&#27425;&#21796;&#37266;&#26102;&#20877;&#20174;&#30913;&#30424;&#25991;&#20214;&#24674;&#22797;&#29366;&#24577;. SSD &#23544;&#22303;&#23544;&#37329;, &#20445;&#30041;&#19968;&#20010; 8GB &#22823;&#23567;&#21448;&#24456;&#23569;&#34987;&#29992;&#21040;&#30340;&#25991;&#20214;&#26159;&#24456;&#22882;&#20360;&#30340;&#34892;&#20026;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre&gt;&lt;code&gt;$ sudo pmset -a hibernatemode 0
$ sudo rm /var/vm/sleepimage*
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;2&#12289;&#20851;&#38381;Time Machine&#26412;&#22320;&#22791;&#20221;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;$ sudo tmutil disablelocal
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&#12289;&#28165;&#29702;&#22403;&#22334;&#65306;&lt;/p&gt;
&lt;p&gt;&#25512;&#33616;&#19979;&#36733;&lt;a href="http://macpaw.com/"&gt;CleanMyMac&lt;/a&gt;&#25110;&#32773;&lt;a href="http://itunes.apple.com/cn/app/disk-diet/id445512770?l=en&amp;amp;mt=12"&gt;Disk Diet&lt;/a&gt;&#36825;&#20004;&#22359;&#36719;&#20214;&#36827;&#34892;&#28165;&#29702;&#12290;&lt;/p&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#25105;&#20204;&#23601;&#25630;&#23450;&#20102;&#22823;&#37096;&#20998;&#30340;&#20248;&#21270;&#12290;&#26377;&#20219;&#20309;&#38382;&#39064;&#35831;&#22312;&#19979;&#38754;&#35810;&#38382;&#65292;&#25110;&#32773;Google&#19968;&#19979;&#12290;(&amp;gt;_&amp;lt;)&lt;/p&gt;
&lt;p&gt;&#21442;&#32771;&#25991;&#31456;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://hi.baidu.com/omys/blog/item/67fc8a0e3a7d84fd37d1220b.html"&gt;&#20998;&#20139;&#19979; SSD for Macbook Pro &#30340;&#20248;&#21270;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://davidx.me/2011/09/24/optimize-ssd-on-mac/"&gt;Mac&#19979;&#20248;&#21270;SSD&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://digitaldj.net/2011/07/21/trim-enabler-for-lion/"&gt;TRIM Enabler for Lion&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://blog.jjgod.org/2010/04/17/macosx-ssd-tweaks/"&gt;Mac OS X &#19979;&#19982; SSD &#30456;&#20851;&#30340;&#20248;&#21270;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://yuzhuohui.info/blog/2011/12/19/macbook-pro-ssd-optimize/"&gt;Macbook Pro SSD &#20248;&#21270;&#23567;&#32467;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://hardforum.com/showthread.php?p=1037771689"&gt;M4 Garbage Collection?&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-25-macbook-pro-ssd-optimize</guid><pubDate>Wed, 25 Jan 2012 18:25:00 GMT</pubDate></item><item><title>&#25424;&#36192; 4321.La - Support future development of 4321.La</title><link>http://blog.4321.la/article/2012-01-24-donate</link><description>&lt;p&gt;&#38750;&#24120;&#39640;&#20852;&#30475;&#21040;&#25105;&#21046;&#20316;&#30340;&#36719;&#20214;&#33021;&#22815;&#24110;&#21161;&#21040;&#24744;&#65281;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#24744;&#21916;&#27426;&#25105;&#30340;&#20316;&#21697;&#65292;&#21487;&#20197;&#25424;&#36192;4321.La&#20197;&#25903;&#25345;&#25105;&#20204;&#21518;&#32493;&#30340;&#24320;&#21457;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;h1&gt;&#25424;&#36192;&#26041;&#24335;&#65306;&lt;/h1&gt;
&lt;h2&gt;1.&lt;a href="https://me.alipay.com/martian"&gt;Donate via Alipay&lt;/a&gt;&lt;/h2&gt;
&lt;h2&gt;2.&lt;a href="https://www.paypal.com/cgi-bin/webscr?cmd=_xclick&amp;amp;business=fzyadmin%40gmail%2ecom&amp;amp;item_name=Support%20future%20development%20of%204321.La%20apps"&gt;Donate via PayPal&lt;/a&gt;&lt;/h2&gt;
&lt;h2&gt;3.&lt;a href="http://www.amazon.cn/registry/wishlist/1JUEM4PZIL82C"&gt;Donate via Amazon.cn&lt;/a&gt;&lt;/h2&gt;
&lt;h2&gt;4.&lt;a href="http://translate.google.com/translate?hl=en&amp;amp;sl=zh-CN&amp;amp;tl=en&amp;amp;u=http%3A%2F%2Fwww.amazon.cn%2Fregistry%2Fwishlist%2F1JUEM4PZIL82C"&gt;Donate via Amazon.cn (Google Translate)&lt;/a&gt;&lt;/h2&gt;
&lt;h4&gt;(My PayPal account is certified in China, you may not be able to donate. You can choose to purchase a suitable gift which I really need, if you think this is accaptable, by taking a glance at my Amazon Wish List, thank you! )&lt;/h4&gt;
&lt;h3&gt;Thanks for being awesome!&lt;/h3&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-24-donate</guid><pubDate>Tue, 24 Jan 2012 22:55:00 GMT</pubDate></item><item><title>Hello Octopress</title><link>http://blog.4321.la/article/2012-01-22-hello-octopress</link><description>&lt;p&gt;&lt;img alt="Octopress" src="http://i.imgur.com/x1UiS.png" /&gt;&lt;/p&gt;
&lt;h1&gt;Hello Octopress!&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;&lt;a href="http://octopress.org/"&gt;Octopress&lt;/a&gt;&lt;/strong&gt;, &#26159;&#19968;&#20010;&#21508;&#31181;&#26032;&#25216;&#26415;&#32467;&#21512;&#36215;&#26469;&#30340;&#21338;&#23458;&#31995;&#32479;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://4321.La"&gt;4321.La&lt;/a&gt;&#25152;&#22312;&#30340;&#26381;&#21153;&#22120;&#26426;&#25151;&#26368;&#36817;&#32447;&#36335;&#19968;&#30452;&#25277;&#39118;&#65292;&#23588;&#20854;&#26159;&#25105;&#33258;&#24049;&#35775;&#38382;&#36215;&#26469;&#24517;&#39035;&#25346;VPN&#65292;&#19981;&#28982;&#36895;&#24230;&#38590;&#20197;&#24525;&#21463;&#65292;&#32780;&#19988;&#26381;&#21153;&#22120;&#19978;512MB&#20869;&#23384;&#36817;&#19968;&#21322;&#34987;&#25105;&#21407;&#26469;&#37027;&#20010;&lt;a href="http://wordpress.org/"&gt;WordPress&lt;/a&gt;&#21338;&#23458;&#32473;&#21344;&#29992;&#20102;&#65292;&#21508;&#31181;&#19981;&#29245;&#12290;
&lt;!-- more --&gt;
&#20110;&#26159;&#23601;&#20307;&#39564;&#20102;&#19968;&#19979;Octopress&#65288;&#31456;&#40060;&#21457;&#24067;&#31995;&#32479;&#65309;&#12290;&#65309;&#65289;&#65292;&#36825;&#20010;&#19996;&#35199;&#36319;WordPress&#36825;&#26679;&#30340;&#20256;&#32479;&#21338;&#23458;&#26377;&#30528;&#26174;&#33879;&#19981;&#21516;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WordPress&#65306;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;PHP + MYSQL&#65292;&#36866;&#21512;&#20027;&#27969;&#30340;LAMP&#12289;LNMP&#31561;&#29615;&#22659;&#36816;&#34892;&#12290;&lt;/li&gt;
&lt;li&gt;HTML&#20889;&#20316;&#65292;&#21516;&#26102;&#25317;&#26377;&#25152;&#35265;&#21363;&#25152;&#24471;&#32534;&#36753;&#22120;&lt;/li&gt;
&lt;li&gt;&#25554;&#20214;&#12289;&#39118;&#26684;&#23433;&#35013;&#31616;&#26131;&#19988;&#36739;&#20026;&#20016;&#23500;&lt;/li&gt;
&lt;li&gt;&#35780;&#35770;&#31995;&#32479;&#20026;&#27599;&#20010;&#21338;&#23458;&#29420;&#31435;&lt;/li&gt;
&lt;li&gt;&#21482;&#38656;&#35201;apt-get/yum&#20960;&#19979;&#65292;&#37197;&#32622;&#22909;&#26381;&#21153;&#22120;&#65292;&#21363;&#21487;&#36816;&#34892;&#12290;&lt;/li&gt;
&lt;li&gt;&#24179;&#27665;&#21521;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&lt;strong&gt;Octopress&#65306;&lt;/strong&gt;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Ruby&#22312;&#26412;&#22320;&#36816;&#34892;&#65292;&#29983;&#25104;&#32431;HTML&#20877;Deploy&#21040;&#26381;&#21153;&#22120;&#12290;&lt;/li&gt;
&lt;li&gt;MarkDown&#35821;&#27861;&#20889;&#20316;&lt;/li&gt;
&lt;li&gt;&#25554;&#20214;&#36739;&#23569;&#65292;&#32780;&#19988;&#19981;&#20250;Ruby&#20063;&#26408;&#27861;&#24320;&#21457;&#65309;&#12290;&#65309;&#65292;&#32593;&#31449;&#39118;&#26684;&#24102;&#19968;&#22871;HTML5&#65292;&#33258;&#24049;&#20462;&#25913;&#30456;&#24403;&#30456;&#24403;&#36153;&#21170;&#12290;&#65288;&#33267;&#23569;&#23545;&#25105;&#36825;&#20010;&#21069;&#31471;&#25216;&#26415;&#33756;&#40479;&#26469;&#35828;&#26159;&#36825;&#26679;&#65289;&lt;/li&gt;
&lt;li&gt;&#35780;&#35770;&#31995;&#32479;&#37319;&#29992;Disqus&#65292;&#35299;&#20915;HTML&#30340;&#23616;&#38480;&#24615;&lt;/li&gt;
&lt;li&gt;&#20320;&#38656;&#35201;&#26377;&#19968;&#23450;&#30340;Linux/Ruby/HTML(5)/Javascript/CSS&#30693;&#35782;&lt;/li&gt;
&lt;li&gt;Geek&#21521;(at least now)&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&#30001;&#20110;&#31456;&#40060;&#26412;&#36523;&#20063;&#26159;&#20010;&#24456;&#22909;&#29609;&#30340;&#21160;&#29289;&#12290;&#31456;&#40060;Press&#20063;&#23601;&#26356;&#32784;&#29609;&#20102;&#8943;&#8943;&#36825;&#22871;&#31995;&#32479;&#24635;&#24402;&#26469;&#35828;&#65292;&#22914;&#26524;&#20320;&#33021;&#25226;&#20182;&#29609;&#36879;&#20102;&#65292;&#33021;&#23398;&#21040;Ruby&#30693;&#35782;&#65292;&#23398;&#20064;Markdown&#35821;&#27861;&#65288;&#39034;&#24102;&#21487;&#20197;&#30475;&#30475;TeX&#65289;&#65292;&#23454;&#25112;HTML/CSS/JavaScript&#8943;&#8943;&lt;/p&gt;
&lt;p&gt;&#33267;&#20110;Octopress&#30340;&#20351;&#29992;&#26041;&#27861;&#65292;&#20934;&#22791;&#26368;&#36817;&#21457;&#24067;&#20986;&#26469;&#19968;&#22871;&#25945;&#31243;&#65292;&#21253;&#21547;&#22522;&#26412;&#30340;&#37197;&#32622;&#12290;&#22043;&#65292;&#26149;&#33410;&#20960;&#22825;&#20809;&#20174;&#36825;&#37324;&#25240;&#33150;&#36825;&#31456;&#40060;&#20102;&#65292;&#31561;&#20004;&#22825;&#20877;&#35828;&#21543;&#65374;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-22-hello-octopress</guid><pubDate>Sun, 22 Jan 2012 14:23:00 GMT</pubDate></item><item><title>[&#24320;&#28304;&#35745;&#21010;]DynamicLyrics</title><link>http://blog.4321.la/article/2012-01-01-opensource-dynamiclyrics</link><description>&lt;p&gt;Github&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/6708539/DynamicLyrics"&gt;https://github.com/6708539/DynamicLyrics&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#22240;&#20026;&#29616;&#22312;&#24320;&#21457;&#26102;&#38388;&#24456;&#23569;&#65292;&#20934;&#22791;&#25226;&#39033;&#30446;&#36880;&#19968;&#24320;&#28304;&#65292;&#35753;&#26356;&#22810;&#30340;&#26379;&#21451;&#21442;&#19982;&#36827;&#26469;&#24320;&#21457;&#65281;
&lt;!-- more --&gt;
&#26377;&#20219;&#20309;&#38382;&#39064;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;E-Mail&#25105;&#65306;fzyadmin&#22312;gmail.com&lt;/p&gt;
&lt;p&gt;2&#12289;Google Plus&#37324;&#38754;&#65291;&#25105;&#65306;&lt;a href="https://plus.google.com/100204491389909955903/posts"&gt;https://plus.google.com/100204491389909955903/posts&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2012-01-01-opensource-dynamiclyrics</guid><pubDate>Sun, 01 Jan 2012 00:10:00 GMT</pubDate></item><item><title>&#20351;&#29992;aria2c&#65291;loli.lu&#23454;&#29616;&#39640;&#36895;&#20813;&#36153;&#36805;&#38647;&#31163;&#32447;&#19979;&#36733;</title><link>http://blog.4321.la/article/2011-12-10-lolilu-aria2c</link><description>&lt;p&gt;&#20247;&#25152;&#21608;&#30693;&#65292;Windows&#19979;&#26377;&#19968;&#27454;&#32463;&#20856;&#30340;&#19979;&#36733;&#36719;&#20214;&#65292;&#21483;&#36805;&#38647;&#65292;&#19979;&#36733;&#36895;&#24230;&#19968;&#30452;&#26159;&#38750;&#24120;&#29702;&#24819;&#30340;&lt;/p&gt;
&lt;p&gt;&#20294;&#26159;&#36825;&#27454;&#36719;&#20214;&#27809;&#26377;Linux&#29256;&#26412;&#65292;Mac&#29256;&#26412;&#20063;&#38750;&#24120;&#30340;&#28866;&#24182;&#19988;&#27809;&#26377;&#31163;&#32447;&#19979;&#36733;&#21151;&#33021;&lt;/p&gt;
&lt;p&gt;&#36825;&#31687;&#25945;&#31243;&#26088;&#22312;&#24110;&#21161;&#22823;&#23478;&#21160;&#25163;&#25171;&#36896;&#19968;&#20010;&#26041;&#20415;&#30340;&#39640;&#36895;&#19979;&#36733;&#24179;&#21488;&#65292;&#19979;&#36733;&#24037;&#20855;&#37319;&#29992;aria2c&#65292;&#20013;&#36716;&#32593;&#31449;&#37319;&#29992;loli.lu&#65288;&#36805;&#38647;&#31163;&#32447;&#20998;&#20139;&#65289;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#25945;&#31243;&#22312;Mac OS X Lion 10.7.2&#19979;&#32534;&#20889;&#65292;Linux&#29992;&#25143;&#25805;&#20316;&#26041;&#27861;&#22823;&#21516;&#23567;&#24322;&#65292;Windows&#29992;&#25143;&#35831;&#33258;&#20027;&#30740;&#31350;&#12290;&lt;/p&gt;
&lt;p&gt;&#21069;&#26399;&#20934;&#22791;&#65306;&#19979;&#36733;&#24182;&#32534;&#35793;aria2c&#65288;&#21482;&#38656;&#36827;&#34892;&#19968;&#27425;&#21363;&#21051;&#65292;&#20197;&#21518;&#21487;&#20197;&#30452;&#25509;&#35843;&#29992;&#65374;&#65289;&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&#30331;&#24405; &lt;a href="http://aria2.sourceforge.net/"&gt;http://aria2.sourceforge.net/&lt;/a&gt; &#19979;&#36733;aria2c&lt;/p&gt;
&lt;p&gt;&#25110;&#32773;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#36825;&#20010;&#22320;&#22336;&#30452;&#25509;&#19979;&#36733;&#65288;&#25512;&#33616;&#36824;&#26159;&#21435;sourceforge&#19979;&#36733;&#26368;&#26032;&#29256;&#26412;&#65289;&#65306;&lt;a href="http://superb-sea2.dl.sourceforge.net/project/aria2/stable/aria2-1.13.0/aria2-1.13.0.tar.gz"&gt;http://superb-sea2.dl.sourceforge.net/project/aria2/stable/aria2-1.13.0/aria2-1.13.0.tar.gz&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/2t8HQ.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/tNAcz.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65306;&#35299;&#21387;&#19979;&#36733;&#30340;&#25991;&#20214;&#65292;&#25918;&#21040;&#19968;&#20010;&#20320;&#35760;&#20303;&#30340;&#20301;&#32622;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/4nd8d.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#19977;&#27493;&#65306;&#32534;&#35793;aria2c&lt;/p&gt;
&lt;p&gt;&#36827;&#20837;&#24212;&#29992;&#31243;&#24207; &#65293; &#23454;&#29992;&#24037;&#20855; &#65293; &#32456;&#31471;&lt;/p&gt;
&lt;p&gt;&#36755;&#20837;&#21629;&#20196;&#65306; cd &#25991;&#20214;&#22841;&#20301;&#32622;&#65288;&#21491;&#38190; &#65293; &#26597;&#30475;&#31616;&#20171;&#21487;&#20197;&#30475;&#21040;&#65289;/&#25991;&#20214;&#22841;&#21517;&lt;/p&gt;
&lt;p&gt;&#27604;&#22914;&#25353;&#29031;&#31532;&#20108;&#27493;&#25152;&#31034;&#65292;&#25105;&#30340;&#25991;&#20214;&#22841;&#25918;&#22312;/Users/Martian/Documents&#65292;&#25991;&#20214;&#22841;&#21517;&#26159;aria2-1.13.0&#65292;&#23601;&#36755;&#20837; cd /Users/Martian/Documents/aria2-1.13.0&#65292;&#28982;&#21518;&#25353;&#19979;&#22238;&#36710;&#38190;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/2q6Go.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#22235;&#27493;&#65306;&#36755;&#20837;&#21629;&#20196;&#8220;./configure; make; make install&#8221;&#65288;&#19981;&#21547;&#24341;&#21495;&#65289;&#65292;&#28982;&#21518;&#22238;&#36710;&#65292;&#23601;&#20250;&#33258;&#21160;&#37197;&#32622;&#12289;&#32534;&#35793;&#12289;&#23433;&#35013;aria2c&lt;/p&gt;
&lt;p&gt;&#22791;&#27880;&#65306;&#32534;&#35793;aria2c&#38656;&#35201;&#23433;&#35013;g++&#65292;&#22914;&#26524;&#24744;&#24050;&#32463;&#23433;&#35013;&#20102;xcode&#22871;&#35013;&#21017;&#24050;&#32463;&#33258;&#21160;&#23433;&#35013;&#65292;&#21542;&#21017;&#35831;&#26597;&#38405;&#30456;&#20851;&#25945;&#31243;&#20808;&#23433;&#35013;g++&#65292;&#36825;&#37324;&#19981;&#20877;&#36184;&#36848;&lt;/p&gt;
&lt;p&gt;&#25110;&#32773;&#21442;&#38405;&#36825;&#31687;&#25945;&#31243;&#65292;&#29420;&#31435;&#23433;&#35013;gcc&#65306;&lt;a href="http://www.memoryz.info/install-gcc-on-mac.html"&gt;http://www.memoryz.info/install-gcc-on-mac.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/i9AeI.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/QoJM7.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/WcDKq.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#25105;&#20204;&#23601;&#32534;&#35793;&#23433;&#35013;&#22909;&#20102;&#19968;&#27454;&#22810;&#32447;&#31243;&#12289;&#36731;&#37327;&#32423;&#30340;&#19979;&#36733;&#24037;&#20855;&#65306;aria2c&lt;/p&gt;
&lt;p&gt;&#19979;&#38754;&#24320;&#22987;&#20351;&#29992;loli.lu&#23454;&#29616;&#36805;&#38647;&#31163;&#32447;&#19979;&#36733;&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&#30331;&#24405;http://loli.lu &#65292;&#36873;&#25321;&#19968;&#20010;&#24744;&#35201;&#19979;&#36733;&#30340;&#36164;&#28304;&#65292;&#21333;&#20987;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/4fM96.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65306;&#22312;&#24377;&#20986;&#30340;&#24748;&#28014;&#26694;&#20013;&#65292;&#36873;&#25321;&#25209;&#37327;&#19979;&#36733; &#65293; aria2c&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/5TiAE.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#19977;&#27493;&#65306;&#22312;&#20986;&#26469;&#30340;&#25991;&#26412;&#26694;&#20013;&#65292;&#25353;Command+C&#22797;&#21046;&#19979;&#36733;&#22320;&#22336;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/gGRwy.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#22235;&#27493;&#65306;&#21551;&#21160;&#32456;&#31471;&#65292;cd&#21040;&#19968;&#20010;&#20320;&#35201;&#19979;&#36733;&#20445;&#23384;&#30340;&#30446;&#24405;&#65292;&#27604;&#22914;&#19979;&#36733;&#21040;&#26700;&#38754;&#65292;&#36755;&#20837; cd ~/Desktop&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#65292;&#25226;&#21018;&#25165;&#30340;&#19979;&#36733;&#22320;&#22336;&#31896;&#36148;&#36827;&#21435;&#65288;Command+V&#65289;&#65292;&#25353;&#22238;&#36710;&#38190;&#24320;&#22987;&#19979;&#36733;&lt;/p&gt;
&lt;p&gt;&#20986;&#29616;&#22914;&#19979;&#22270;&#25152;&#31034;&#30340;&#20869;&#23481;&#20195;&#34920;&#24050;&#32463;&#24320;&#22987;&#19979;&#36733;&#20102;&#65281;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/tqnCz.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#22791;&#27880;&#65306;aria2c&#25903;&#25345;&#26029;&#28857;&#32493;&#20256;&#65292;&#19979;&#27425;&#19979;&#36733;&#30340;&#35805;cd&#21040;&#19979;&#36733;&#20445;&#23384;&#30446;&#24405;&#65292;&#28982;&#21518;&#37325;&#26032;&#36816;&#34892;&#20043;&#21069;&#30340;&#19979;&#36733;&#21629;&#20196;&#21363;&#21487;&lt;/p&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#25105;&#20204;&#23601;&#23454;&#29616;&#20102;&#36890;&#36807;&#36805;&#38647;&#31163;&#32447;&#26381;&#21153;&#22120;&#39640;&#36895;&#19979;&#36733;&#25991;&#20214;&#12290;&#24403;&#28982;Loli.lu&#19981;&#20165;&#21487;&#20197;&#35753;&#29992;&#25143;&#19979;&#36733;&#19982;&#20998;&#20139;&#20854;&#20182;&#29992;&#25143;&#19978;&#20256;&#22909;&#30340;&#36164;&#28304;&#65292;&#21516;&#26679;&#21487;&#20197;&#21457;&#24067;&#36164;&#28304;&lt;/p&gt;
&lt;p&gt;&#27604;&#22914;&#65292;&#25105;&#20174;&#26497;&#24433;&#30340;BT&#31449;&#25214;&#21040;&#20102;&#19968;&#20010;&#21160;&#28459;&#30340;&#31181;&#23376;&#28982;&#21518;&#24819;&#35201;&#19979;&#36733;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/uvcYc.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#25105;&#35201;&#20570;&#30340;&#23601;&#26159;&#25226;&#31181;&#23376;&#30340;&#22320;&#22336;&#22797;&#21046;&#19979;&#26469;&#65292;&#27604;&#22914; http://bt.ktxp.com/down/1323442938/065d7936de1b6cd5351688b8841bef62835562ab.torrent&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#25171;&#24320;http://loli.lu&#65292;&#36873;&#25321;&#21491;&#19978;&#35282;&#30340;&#30331;&#24405;&#65292;&#36755;&#20837;&#29992;&#25143;&#21517;&#23494;&#30721;&#30331;&#24405;&lt;/p&gt;
&lt;p&gt;&#65288;Loli.lu&#37319;&#29992;Google Open ID&#31995;&#32479;&#65292;&#19982;Gmail&#21516;&#27493;&#30331;&#24405;&#65292;&#26080;&#38656;&#37325;&#22797;&#27880;&#20876;&#65292;&#24744;&#30340;&#36164;&#26009;&#20250;&#34987;&#20445;&#23494;&#65289;&lt;/p&gt;
&lt;p&gt;&#30331;&#24405;&#21518;&#65292;&#24744;&#21487;&#20197;&#36873;&#25321;&#21491;&#19978;&#35282;&#30340;&#21457;&#24067;&#36164;&#28304;&#65288;&#25512;&#33616;&#65289;&#65292;&#25110;&#32773;&#36873;&#25321;&#8220;&#25105;&#35201;&#30452;&#25509;&#33719;&#24471;&#36164;&#28304;&#19979;&#36733;&#22320;&#22336;&#8221;&#65288;&#38656;&#35201;&#20219;&#21153;&#21363;&#26102;&#34987;&#36805;&#38647;&#31186;&#26432;&#25165;&#21487;&#20197;&#65292;&#25512;&#33616;&#36873;&#25321;&#21457;&#24067;&#36164;&#28304;&#65289;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/cAuz6.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/mD0pa.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31245;&#31561;&#29255;&#21051;&#65292;&#20219;&#21153;&#25552;&#20132;&#25104;&#21151;&#21518;&#65292;&#20250;&#33258;&#21160;&#36339;&#21040;&#19979;&#36733;&#22320;&#22336;&#65292;&#28982;&#21518;&#25353;&#29031;&#25945;&#31243;&#21069;&#38754;&#25152;&#21465;&#36848;&#30340;&#26041;&#27861;&#19979;&#36733;&#21363;&#21487;&#65281;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/mD0pa.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25945;&#31243;&#21040;&#27492;&#32467;&#26463;&#65292;&#22914;&#26524;&#22823;&#23478;&#26377;&#20219;&#20309;&#38382;&#39064;&#65292;&#27426;&#36814;&#21040;Google Plus&#37324;+Martian Z&#65288;&#21338;&#23458;&#30041;&#35328;&#30001;&#20110;&#36817;&#26399;&#27604;&#36739;&#32321;&#24537;&#65292;&#26242;&#26102;&#19981;&#33021;&#22238;&#22797;&#65292;&#25265;&#27465;&#65289;&lt;/p&gt;
&lt;p&gt;Loli.lu&#30446;&#21069;&#26159;&#19968;&#20010;&#21457;&#23637;&#20013;&#30340;&#39033;&#30446;&#65292;&#25105;&#20204;&#22238;&#22312;&#21518;&#26399;&#22686;&#21152;&#23545;Mac&#12289;Linux&#31995;&#32479;&#30340;&#19987;&#38376;&#20248;&#21270;&#65288;&#35692;&#22914;&#23458;&#25143;&#31471;&#28155;&#21152;&#36164;&#28304;&#65289;&#65292;&#21516;&#26102;&#20063;&#20250;&#22686;&#21152;&#29992;&#25143;RSS&#35746;&#38405;&#21151;&#33021;&#65292;&#25512;&#36865;&#35746;&#38405;&#19979;&#36733;&#22320;&#22336;&#31561;&#65292;&#24076;&#26395;&#24744;&#33021;&#25903;&#25345;&#24182;&#20851;&#27880;&#25105;&#20204;&#30340;&#21457;&#23637;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-12-10-lolilu-aria2c</guid><pubDate>Sat, 10 Dec 2011 23:57:00 GMT</pubDate></item><item><title>&#12304;Project-LOLI&#12305;Loli.lu &#20813;&#36153;&#36805;&#38647;&#31163;&#32447;&#19979;&#36733;&#20998;&#20139;&#35745;&#21010;</title><link>http://blog.4321.la/article/2011-12-08-project-lolilu</link><description>&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/WBRYk.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://Loli.lu"&gt;http://Loli.lu&lt;/a&gt;&#26159;&#30001; &#36275;&#20806;&#21449;&#34411; &#21644; Martian &#20849;&#21516;&#24320;&#21457;&#30340;&#20813;&#36153;&#30340;&#12289;&#38750;&#21830;&#19994;&#30340;&#12289;&#26377;&#29233;&#30340;&#36805;&#38647;&#31163;&#32447;&#19979;&#36733;&#20998;&#20139;&#31995;&#32479;&#12290;&#65288;&#20854;&#23454;&#20027;&#35201;&#26159;&#36275;&#20806;&#21449;&#34411;&#22312;&#24320;&#21457;&#65292;&#25105;&#34920;&#31034;&#23436;&#20840;&#19981;&#20250;Python&#65289;&lt;/p&gt;
&lt;p&gt;&#26088;&#22312;&#25552;&#20379;&#19968;&#20010;&#23436;&#21892;&#65288;&#20197;&#21518;&#20250;&#23454;&#29616;&#65374;&#65289;&#12289;&#31616;&#27905;&#12289;&#39640;&#36895;&#30340;&#19979;&#36733;&#20998;&#20139;&#24179;&#21488;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#32593;&#31449;&#29305;&#24615;&#22914;&#19979;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#37319;&#29992;Google OpenID&#29992;&#25143;&#31995;&#32479;&#65292;GMail&#24080;&#25143;&#30452;&#25509;&#30331;&#38470;&#65292;&#26080;&#38656;&#37325;&#22797;&#27880;&#20876;&lt;/p&gt;
&lt;p&gt;2&#12289;&#32593;&#31449;&#25903;&#25345;&#24050;&#19978;&#20256;&#30340;&#36164;&#28304;&#22320;&#22336;&#20998;&#20139;&#21151;&#33021;&#19982;&#26631;&#31614;&#21151;&#33021;&#65292;&#24744;&#21487;&#20197;&#21363;&#21051;&#25628;&#32034;&#20854;&#20182;&#29992;&#25143;&#24050;&#32463;&#20998;&#20139;&#30340;&#36164;&#28304;&#65292;&#25110;&#32773;&#19978;&#20256;&#26032;&#30340;&#36164;&#28304;&#20877;&#21457;&#24067;&#22312;&#21508;&#22823;&#35770;&#22363;&#32593;&#31449;&#20013;&#36827;&#34892;&#20998;&#20139;&#12290;&lt;/p&gt;
&lt;p&gt;3&#12289;&#25903;&#25345;Chrome&#12289;Safari&#12289;FireFox&#27983;&#35272;&#22120;&#19979;&#36733;&#65292;&#36895;&#24230;&#19982;&#36805;&#38647;VIP&#31163;&#32447;&#36895;&#24230;&#30456;&#21516;&#65288;&#26242;&#19981;&#25903;&#25345;Opera&#65292;&#27704;&#36828;&#19981;&#20250;&#25903;&#25345;IE&#19982;&#38750;Chromium&#26680;&#24515;&#30340;&#20854;&#20182;&#22269;&#20135;&#27983;&#35272;&#22120;&#65289;&#65292;&#25903;&#25345;aria2c&#12289;wget&#25209;&#37327;&#19979;&#36733;&#65288;designed for Linux/Mac users&#65289;&lt;/p&gt;
&lt;p&gt;4&#12289;&#30331;&#24405;&#21518;&#65292;&#24744;&#21487;&#20197;&#30452;&#25509;&#28155;&#21152;&#19979;&#36733;&#20219;&#21153;&#24182;&#33719;&#21462;&#31163;&#32447;&#19979;&#36733;&#22320;&#22336;&#65292;&#20840;&#37096;&#36807;&#31243;&#23436;&#20840;&#20813;&#36153;&#65292;&#24182;&#19988;&#21487;&#20197;&#20139;&#21463;&#36805;&#38647;VIP&#29992;&#25143;&#30340;&#19979;&#36733;&#36895;&#24230;&#65292;&#38750;&#24120;&#36866;&#21512;&#20919;&#38376;&#36164;&#28304;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/GYJDR.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#34917;&#20805;&#35828;&#26126;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#36164;&#28304;&#22343;&#20026;&#32593;&#21451;&#19978;&#20256;&#65292;&#30001;&#36805;&#38647;&#31163;&#32447;&#26381;&#21153;&#22120;&#25552;&#20379;&#19979;&#36733;&#36164;&#28304;&lt;/p&gt;
&lt;p&gt;2&#12289;&#32593;&#31449;&#19981;&#25903;&#25345;IE&#27983;&#35272;&#22120;&#65292;&#22914;&#26524;&#24744;&#26159;Windows&#29992;&#25143;&#65292;&#24314;&#35758;&#24744;&#26356;&#25442;&#27983;&#35272;&#22120;&#65288;&#25512;&#33616;Chrome&#65289;&lt;/p&gt;
&lt;p&gt;3&#12289;Chrome&#12289;Safari&#12289;Firefox&#29992;&#25143;&#36890;&#36807;&#27983;&#35272;&#22120;&#19979;&#36733;&#38656;&#35201;&#23433;&#35013;&#28216;&#29492;&#33050;&#26412;&#65292;&#35814;&#24773;&#35831;&#35775;&#38382;Loli.lu&#21442;&#35265;&#24038;&#26639;&#65288;lolilu&#24050;&#26356;&#26032;&#65292;&#26080;&#38656;&#33050;&#26412;&#65281;&#65289;&lt;/p&gt;
&lt;p&gt;4&#12289;aria2c&#26159;&#19968;&#27454;&#36731;&#37327;&#32423;&#30340;&#22810;&#32447;&#31243;&#22810;&#21327;&#35758;&#19979;&#36733;&#24037;&#20855;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#20174;&#36825;&#37324;&#19979;&#36733;&#24182;&#36827;&#34892;&#32534;&#35793;&#23433;&#35013;&#65306;&lt;a href="http://aria2.sourceforge.net/"&gt;http://aria2.sourceforge.net/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;5&#12289;Project-LOLI&#30446;&#21069;&#36824;&#26159;&#19968;&#20010;&#21457;&#23637;&#20013;&#30340;&#39033;&#30446;&#65292;&#32593;&#31449;&#36824;&#22312;&#23436;&#21892;&#20043;&#20013;&#65292;&#22914;&#26524;Loli.lu&#19981;&#33021;&#28385;&#36275;&#20320;&#20204;&#30340;&#38656;&#35201;&#65292;&#22914;&#26524;&#24744;&#26377;&#20219;&#20309;&#30340;&#24314;&#35758;&#25110;&#38382;&#39064;&#35831;&#21450;&#26102;&#32852;&#31995;&#25105;&#20204;&lt;/p&gt;
&lt;p&gt;+Martian Z &#65306;&lt;a href="https://plus.google.com/100204491389909955903/posts"&gt;https://plus.google.com/100204491389909955903/posts&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;+&#36275;&#20806;&#21449;&#34411;&#65306;&lt;a href="https://plus.google.com/109559563687025213768/"&gt;https://plus.google.com/109559563687025213768/&lt;/a&gt;posts&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-12-08-project-lolilu</guid><pubDate>Thu, 08 Dec 2011 00:06:00 GMT</pubDate></item><item><title>MusicSeekerX &#8211; &#25628;&#32034;&#19982;&#19979;&#36733;&#38899;&#20048;</title><link>http://blog.4321.la/article/2011-08-28-musicseekerx</link><description>&lt;p&gt;&#22909;&#21543;&#65292;&#20889;&#27468;&#35789;&#36719;&#20214;&#20889;&#24471;&#26377;&#20123;&#21520;&#34880;&#65292;&#25105;&#23601;&#39034;&#24102;&#23436;&#21892;&#19968;&#19979;&#20043;&#21069;&#30340;&#36719;&#20214;&#8212;&#8212;&#32473;MusicSeeker&#24320;&#21457;&#20102;Mac&#29256;&#26412;&#65292;&#25289;&#30528;Madimo&#19968;&#22359;&#24320;&#21457;&#20102;&#19968;&#19979;&#65292;&#20004;&#22825;&#30340;&#26102;&#38388;&#23601;&#23436;&#24037;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;MusicSeekerX&#26159;&#19968;&#27454;&#20223;MusicSeeker&#30340;&#36719;&#20214;&#65288;&#24223;&#35805;&#65289;&#65292;&#29992;&#26469;&#36741;&#21161;Mac&#29992;&#25143;&#22312;Mac&#31995;&#32479;&#19979;&#65288;&#36824;&#26159;&#24223;&#35805;&#65289;&#19979;&#36733;&#38899;&#20048;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/eXcFL.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#30340;&#29305;&#24615;&#36824;&#26159;&#21872;&#21990;&#19968;&#19979;&#21543;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#25903;&#25345;&#26080;&#25439;&#38899;&#20048;&#65288;flac&#65289;&#30340;&#25628;&#32034;&#19979;&#36733;&#65292;&#25903;&#25345;&#19979;&#36733;&#26080;&#25439;&#38899;&#20048;&#21518;&#33258;&#21160;&#36716;&#25442;&#20026;iTunes&#21487;&#35782;&#21035;&#30340;&#26080;&#25439;&#26684;&#24335;&#65288;alac m4a&#65289;&lt;/p&gt;
&lt;p&gt;2&#12289;&#25903;&#25345;&#19979;&#36733;MP3&#38899;&#20048;&#21518;&#33258;&#21160;&#28155;&#21152;&#19987;&#36753;&#23553;&#38754;&#12289;&#28155;&#21152;&#27468;&#35789;&lt;/p&gt;
&lt;p&gt;3&#12289;&#20248;&#20808;&#36873;&#25321;&#39640;&#30721;&#29575;&#65292;&#38899;&#20048;&#36136;&#37327;&#19968;&#30446;&#20102;&#28982;&#65292;&#36866;&#21512;&#21508;&#31181;&#26080;&#25439;&#25511;&#12290;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#30340;&#19979;&#36733;&#20445;&#23384;&#30446;&#24405;&#12289;&#36719;&#20214;&#30340;&#19968;&#20123;&#35774;&#32622;&#37117;&#22312;&#33756;&#21333; &#8211; &#20559;&#22909;&#35774;&#32622;&#37324;&#38754;&#65292;&#25512;&#33616;&#22823;&#23478;&#20808;&#36827;&#34892;&#35774;&#32622;&#12290;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#30340;&#32570;&#28857;&#25105;&#20063;&#19981;&#22810;&#35828;&#20102;&#65292;&#27605;&#31455;&#26159;&#20004;&#22825;&#23601;&#23436;&#24037;&#30340;&#20316;&#21697;&#65292;&#25105;&#22312;&#36719;&#20214;&#37324;&#38754;&#21152;&#20837;&#20102;&#27604;&#36739;&#23436;&#21892;&#30340;&#33258;&#21160;&#26356;&#26032;&#26426;&#21046;&#65288;&#24223;&#35805;&#65292;&#21035;&#20154;&#30340;&#29616;&#25104;&#30340;&#24211;&#65289;&#65292;&#21518;&#32493;&#30340;&#21151;&#33021;&#36824;&#26377;BUG&#30340;&#20462;&#22797;&#36719;&#20214;&#20250;&#33258;&#21160;&#26816;&#26597;&#26356;&#26032;&#30340;&#12290;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#24744;&#22312;&#20351;&#29992;&#36807;&#31243;&#20013;&#21457;&#29616;&#20160;&#20040;&#38382;&#39064;&#30340;&#35805;&#65292;&#21035;&#24536;&#20102;&#21453;&#39304;&#19968;&#19979;&#65292;&#35874;&#35874;&#25903;&#25345;&#65374;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#36719;&#20214;&#30830;&#23454;&#23545;&#24744;&#36215;&#21040;&#20102;&#24110;&#21161;&#65292;&#21487;&#20197;&#32771;&#34385;&#25424;&#36192;&#20316;&#32773;&#20197;&#24179;&#34913;&#22495;&#21517;&#12289;&#31354;&#38388;&#25903;&#20986;&#36153;&#29992;&#65292;&#25424;&#36192;&#22320;&#22336;&#65306;&lt;a href="http://donate.4321.la/"&gt;http://donate.4321.la/&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#20877;&#27425;&#24863;&#35874;&#21508;&#20301;&#30340;&#25903;&#25345;&#65281;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#19979;&#36733;&#22320;&#22336;&#65306;
&lt;a href="http://martianlaboratory.com/musicseekerx/MusicSeekerX303.zip"&gt;http://martianlaboratory.com/musicseekerx/MusicSeekerX303.zip&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-08-28-musicseekerx</guid><pubDate>Sun, 28 Aug 2011 23:47:00 GMT</pubDate></item><item><title>DynamicLyrics &#8211; &#22312;&#33756;&#21333;&#26639;&#26174;&#31034;iTunes&#27468;&#26354;&#27468;&#35789;&#30340;&#25554;&#20214;[1.1&#21457;&#24067;]</title><link>http://blog.4321.la/article/2011-08-13-dynamiclyrics</link><description>&lt;p&gt;{% blockquote %}
2011&#24180;10&#26376;29&#21457;&#24067;1.1&#29256;&#26412;
&#26356;&#26032;&#20869;&#23481;&#22914;&#19979;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#27468;&#35789;&#20999;&#25442;&#28155;&#21152;&#28176;&#38544;&#12289;&#28176;&#26174;&#29305;&#25928;&#65292;&#26356;&#21152;&#24179;&#28369;&lt;/p&gt;
&lt;p&gt;2&#12289;&#20462;&#27491;&#36719;&#20214;&#36816;&#34892;&#36807;&#31243;&#20013;&#19981;&#33021;&#36864;&#20986;iTunes&#30340;BUG&lt;/p&gt;
&lt;p&gt;3&#12289;&#28155;&#21152;&#20840;&#37096;&#27468;&#35789;&#22797;&#21046;&#12289;LRC&#20869;&#23481;&#22797;&#21046;&#21151;&#33021;&lt;/p&gt;
&lt;p&gt;4&#12289;&#20248;&#21270;&#37096;&#20998;&#26680;&#24515;&#31639;&#27861;&#65292;&#35843;&#25972;&#30028;&#38754;&#25991;&#23383;&#25552;&#31034;&#32454;&#33410;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#22320;&#22336;&#35831;&#35265;&#25991;&#31456;&#32467;&#23614;&#65292;&#22914;&#26524;&#24744;&#26159;&#31532;&#19968;&#27425;&#20351;&#29992;&#26412;&#36719;&#20214;&#65292;&#25512;&#33616;&#24744;&#32784;&#24515;&#38405;&#35835;&#19968;&#19979;&#19979;&#38754;&#30340;&#20171;&#32461;&#12290;
 {% endblockquote %}&lt;/p&gt;
&lt;p&gt;Martian&#26159;&#19968;&#20301;&#21916;&#27426;&#21548;&#21508;&#31181;&#40479;&#35821;&#30340;&#27468;&#30340;&#20154;&#65292;&#21548;&#19981;&#25026;&#20063;&#19981;&#30693;&#36947;&#27468;&#26159;&#19981;&#26159;&#39640;&#38597;&#65292;&#34429;&#35828;&#21608;&#22260;&#20154;&#20063;&#27809;&#20960;&#20010;&#21548;&#25026;&#30340;&#65292;&#20294;&#26159;&#22825;&#22825;&#27809;&#20107;&#21548;&#37027;&#20123;&#27468;&#35789;&#27604;&#22269;&#20135;&#29233;&#24773;&#27468;&#36824;&#20108;&#30340;&#27468;&#23454;&#22312;&#26159;&#26377;&#25439;&#33529;&#26524;&#30005;&#33041;&#22768;&#21345;&#12290;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;Martian&#20915;&#23450;&#20889;&#19968;&#20010;&#34507;&#30140;&#30340;&#25554;&#20214;&#65292;&#29992;&#26469;&#25903;&#25345;iTunes&#30340;&#27468;&#35789;&#26174;&#31034;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#20294;&#26159;Martian&#21457;&#29616;&#65292;Windows&#36951;&#30041;&#19979;&#26469;&#30340;&#26368;&#22823;&#21270;&#20064;&#24815;&#25381;&#20043;&#19981;&#21435;&#65292;&#27809;&#20107;&#23601;&#25226;Safari&#30340;&#31383;&#21475;&#25289;&#21040;&#20840;&#23631;&#30340;Matian&#21457;&#29616;&#65292;&#23631;&#24149;&#19968;&#28857;&#31354;&#37117;&#26408;&#26377;&#20102;&#65292;(&#65507;&#9661;&#65507;&#8221;)&lt;/p&gt;
&lt;p&gt;&#25152;&#20197;&#65292;&#25105;&#23601;&#20915;&#23450;&#65292;&#36825;&#20010;&#36719;&#20214;&#19968;&#23450;&#35201;&#39034;&#24102;&#25226;&#26631;&#39064;&#26639;&#37027;&#28857;&#31354;&#38388;&#32473;&#25377;&#20303;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/T44rX.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#32769;&#35268;&#30697;&#65292;&#20877;&#24223;&#35805;&#19968;&#19979;&#36719;&#20214;&#30340;&#29305;&#24615;&#21543;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#36719;&#20214;&#21551;&#21160;&#21518;&#27809;&#26377;&#30028;&#38754;&#65292;&#19981;&#35201;&#20197;&#20026;&#36719;&#20214;&#26159;&#20160;&#20040;&#26408;&#39532;&#25110;&#32773;&#30149;&#27602;&#20043;&#31867;&#30340;&#22351;&#19996;&#35199;&#65292;&#22312;Unix&#31995;&#32479;&#19979;&#27809;&#24377;&#31383;&#35753;&#20320;&#36755;&#23494;&#30721;&#25105;&#21487;&#26159;&#36830;&#20010;&#31995;&#32479;&#25991;&#20214;&#37117;&#35835;&#21462;&#19981;&#21040;&#12290;(&#65507;_&#65507;|||)&lt;/p&gt;
&lt;p&gt;2&#12289;&#36719;&#20214;&#20250;&#33258;&#21160;&#21551;&#21160;iTunes&#65292;&#20294;&#26159;&#19981;&#20250;&#33258;&#21160;&#25773;&#25918;&#65292;&#36827;&#21435;&#25214;&#19968;&#39318;&#20320;&#21916;&#27426;&#30340;&#27468;&#65292;&#28982;&#21518;&#25773;&#25918;&#21363;&#21487;&lt;/p&gt;
&lt;p&gt;3&#12289;&#25105;&#30456;&#20449;&#21508;&#20301;&#29992;iTunes&#21548;&#27468;&#30340;&#26524;&#31881;&#24212;&#35813;&#19981;&#20250;&#25226;ID3&#26631;&#31614;&#24324;&#24471;&#19968;&#22604;&#31946;&#28034;&#21543;&#65292;&#21482;&#35201;&#27468;&#26354;&#21517;&#37324;&#38754;&#19981;&#24102;&#25324;&#21495;&#20043;&#31867;&#30340;&#31526;&#21495;&#65292;&#27809;&#26377;&#32321;&#20307;&#20013;&#25991;&#30340;&#35805;&#65292;DynamicLyrics&#37117;&#20250;&#24110;&#20320;&#33258;&#21160;&#25628;&#32034;&#27468;&#35789;&#65292;&#28982;&#21518;&#26174;&#31034;&#22312;&#26631;&#39064;&#26639;&#19978;&lt;/p&gt;
&lt;p&gt;4&#12289;&#22914;&#26524;&#26080;&#27861;&#33258;&#21160;&#25214;&#21040;&#27468;&#35789;&#65292;&#21333;&#20987;&#33756;&#21333;&#65292;&#36873;&#25321;&#25628;&#32034;&#27468;&#35789;&#65292;&#23601;&#20250;&#26377;&#20010;&#26694;&#20986;&#26469;&#35753;&#20320;&#36873;&#25321;&#27468;&#35789;&#65292;&#25628;&#32034;&#21518;&#21452;&#20987;&#23601;&#21487;&#20197;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/2uZXu.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;5&#12289;&#30005;&#20449;&#32447;&#36335;&#30340;&#26379;&#21451;&#35831;&#27880;&#24847;&#65292;&#19981;&#31649;&#36719;&#20214;&#33258;&#21160;&#21305;&#37197;&#27468;&#35789;&#25104;&#21151;&#19982;&#21542;&#65292;&#25512;&#33616;&#24744;&#37117;&#25171;&#24320;&#25628;&#32034;&#27468;&#35789;&#31383;&#21475;&#65292;&#36873;&#25321;&#30005;&#20449;&#26381;&#21153;&#22120;&#20197;&#21518;&#25628;&#32034;&#19968;&#27425;&#27468;&#35789;&#65292;&#36825;&#26679;&#36719;&#20214;&#20250;&#35760;&#24405;&#20320;&#30340;&#26381;&#21153;&#22120;&#65292;&#33258;&#21160;&#25628;&#32034;&#27468;&#35789;&#20250;&#33258;&#21160;&#36873;&#25321;&#30005;&#20449;&#26381;&#21153;&#22120;&#12290;&lt;/p&gt;
&lt;p&gt;6&#12289;&#21333;&#20987;&#33756;&#21333;&#37324;&#38754;&#30340;&#36864;&#20986;&#36864;&#20986;&#36719;&#20214;&#65292;&#24403;&#28982;&#20320;&#20063;&#21487;&#20197;&#21435;&#32467;&#26463;&#36827;&#31243;&#12290;&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#65292;&#39034;&#24102;&#35828;&#19968;&#19979;&#36719;&#20214;&#30340;&#32570;&#28857;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#26080;&#27861;&#35782;&#21035;&#20869;&#32622;&#30340;Lrc&#27468;&#35789;&#25110;&#32773;&#26159;&#21516;&#25991;&#20214;&#30446;&#24405;&#30340;Lrc&#27468;&#35789;&#65292;&#21482;&#25903;&#25345;&#26381;&#21153;&#22120;&#19978;&#30340;&#27468;&#35789;&#12290;&#36825;&#20010;&#32570;&#28857;&#25105;&#20250;&#24930;&#24930;&#25913;&#36827;&#30340;&#65292;&#20294;&#26159;Martian&#34507;&#30140;&#30340;&#25216;&#26415;&#35753;&#20182;&#36827;&#23637;&#32531;&#24930;&#65292;&#25152;&#20197;&#35831;&#21508;&#20301;&#29702;&#35299;&#12290;&lt;/p&gt;
&lt;p&gt;2&#12289;&#26080;&#27861;&#23548;&#20986;Lrc&#27468;&#35789;&#65292;&#19979;&#20010;&#29256;&#26412;&#20250;&#25903;&#25345;&#30340;&#12290;&lt;/p&gt;
&lt;p&gt;3&#12289;&#21487;&#33021;&#26377;&#19968;&#20123;&#26080;&#27861;&#39044;&#30693;&#30340;&#38169;&#35823;&#65292;&#27604;&#22914;&#20869;&#23384;&#27844;&#28431;&#12290;(&#65507;&#9661;&#65507;&#8221;)&lt;/p&gt;
&lt;p&gt;&#24635;&#20043;&#23601;&#26159;&#36825;&#26679;&#65292;&#20316;&#20026;&#19968;&#20301;&#21018;&#25509;&#35302;Cocoa&#24320;&#21457;&#27169;&#24335;&#30340;&#33510;&#36924;&#30340;&#31243;&#24207;&#21592;&#65292;&#24076;&#26395;&#22823;&#23478;&#33021;&#22815;&#35845;&#35299;&#12290;&lt;/p&gt;
&lt;p&gt;&#21478;&#22806;&#65292;Martian&#30340;&#21608;&#22260;&#24456;&#23569;&#26377;&#29992;Mac&#30340;&#20154;&#65292;&#25152;&#20197;&#24076;&#26395;&#22823;&#23478;&#27979;&#35797;&#20197;&#21518;&#22914;&#26524;&#26377;&#20160;&#20040;&#38382;&#39064;&#65292;&#35831;&#21521;&#25105;&#30340;&#21338;&#23458;&#21453;&#39304;&#19968;&#19979;&#65292;&#26041;&#20415;&#25105;&#36827;&#34892;&#22788;&#29702;&#35299;&#20915;&#12290;&lt;/p&gt;
&lt;p&gt;&#21999;&#65374;&#23601;&#26159;&#36825;&#26679;&#65374;(&#65377;T&#969;T)&#65417;&#9734;&#65381;&#65439;:*:&lt;/p&gt;
&lt;p&gt;&#22909;&#65292;&#19979;&#38754;&#25918;&#20986;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://down.4321.la/DynamicLyrics.zip"&gt;http://down.4321.la/DynamicLyrics.zip&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-08-13-dynamiclyrics</guid><pubDate>Sat, 13 Aug 2011 23:36:00 GMT</pubDate></item><item><title>MusicSeeker Plug-in for iYY 1.0</title><link>http://blog.4321.la/article/2011-08-09-iyy-qqmusic</link><description>&lt;p&gt;&#24180;&#21021;&#30340;&#26102;&#20505;&#20837;&#25163;&#20102;MacBook Pro&#65292;&#24320;&#22987;&#20102;&#35299;Mac OS X&#31995;&#32479;&#12290;&lt;/p&gt;
&lt;p&gt;&#21457;&#29616;&#24120;&#29992;&#30340;&#36719;&#20214;&#22522;&#26412;&#37117;&#26377;&#21487;&#26367;&#20195;&#26041;&#26696;&#65292;&#20294;&#26159;&#25773;&#25918;&#38899;&#20048;&#12289;&#26174;&#31034;&#27468;&#35789;&#22987;&#32456;&#25214;&#19981;&#21040;&#23436;&#32654;&#30340;&#31243;&#24207;&#12290;&lt;/p&gt;
&lt;p&gt;&#26368;&#36817;&#21457;&#29616;&#20102;iYY&#36825;&#27454;&#38899;&#20048;&#36719;&#20214;&#65292;&#36719;&#20214;&#30340;&#30028;&#38754;&#38750;&#24120;&#21326;&#20029;&#65292;&#21516;&#26102;&#25903;&#25345;&#27468;&#35789;&#25628;&#32034;&#19982;&#26174;&#31034;&#21151;&#33021;&#65292;&#31867;&#20284;&#20110;Windows&#19979;&#30340;&#21315;&#21315;&#38745;&#21548;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://www.beyondcow.com/iyy/plugin/img/qqmusic.png" /&gt;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#36719;&#20214;&#30340;&#21151;&#33021;&#24688;&#22909;&#28385;&#36275;&#22823;&#37096;&#20998;&#20154;&#30340;&#38656;&#27714;&#65292;&#21457;&#29616;&#30340;&#20960;&#27454;&#36719;&#20214;BUG&#25105;&#20063;&#24456;&#24555;&#23601;&#25214;&#21040;&#20316;&#32773;&#65292;&#24182;&#32852;&#31995;&#20182;&#35299;&#20915;&#20102;&#38382;&#39064;&#12290;&lt;/p&gt;
&lt;p&gt;&#20110;&#26159;&#25105;&#23601;&#24320;&#24037;&#24320;&#21457;&#20102;&#19968;&#27454;&#25554;&#20214;&#65292;&#23558;MusicSeeker&#30340;&#37096;&#20998;&#21151;&#33021;&#20570;&#21040;&#25554;&#20214;&#37324;&#38754;&#65292;&#23454;&#29616;&#39640;&#21697;&#36136;&#38899;&#20048;&#30340;&#26080;&#25439;&#19979;&#36733;&#19982;&#25628;&#32034;&#65292;&#20351;&#29992;iYY&#30340;&#29992;&#25143;&#33021;&#26041;&#20415;&#22320;&#19979;&#36733;&#38899;&#20048;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/FZlzx.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&#25554;&#20214;&#29305;&#24615;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#25903;&#25345;&#39640;&#30721;&#29575;MP3&#19979;&#36733;&#65292;&#25628;&#32034;&#26102;&#20505;&#33258;&#21160;&#26174;&#31034;&#26368;&#39640;&#30721;&#29575;&#30340;&#38899;&#36136;&lt;/p&gt;
&lt;p&gt;2&#12289;&#25903;&#25345;FLAC&#26080;&#25439;&#19979;&#36733;&#65292;&#21516;&#26102;&#19981;&#21916;&#27426;FLAC&#30340;&#26379;&#21451;&#20063;&#21487;&#20197;&#36873;&#25321;&#19979;&#36733;320Kbps&#30340;MP3&lt;/p&gt;
&lt;p&gt;&#36825;&#27454;&#25554;&#20214;&#21482;&#33021;&#22312;iYY&#37324;&#38754;&#36816;&#34892;&#65292;&#22914;&#26524;&#26377;&#38656;&#35201;&#30340;&#26379;&#21451;&#21487;&#20197;&#21040;iYY&#30340;&#23448;&#26041;&#32593;&#31449;&#19979;&#36733;&#12290;&lt;/p&gt;
&lt;p&gt;&#21478;&#22806;&#29420;&#31435;&#36816;&#34892;&#30340;MusicSeekerX&#19982;MusicSorterX&#27491;&#22312;&#24320;&#21457;&#35745;&#21010;&#20013;&#65292;&#25964;&#35831;&#21508;&#20301;&#26399;&#24453;&#65281;&lt;/p&gt;
&lt;p&gt;iYY&#23448;&#26041;&#32593;&#31449;&#65306;http://beyondcow.com/iyy/&lt;/p&gt;
&lt;p&gt;iYY&#23448;&#26041;&#25554;&#20214;&#19979;&#36733;&#65306;http://beyondcow.com/iyy/#tab4&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-08-09-iyy-qqmusic</guid><pubDate>Tue, 09 Aug 2011 23:33:00 GMT</pubDate></item><item><title>MusicSeeker &#8211; &#27468;&#26354;&#12289;&#19987;&#36753;&#22270;&#29255;&#12289;&#27468;&#35789;&#20840;&#33258;&#21160;&#19979;&#36733;&#24037;&#20855; Version 2.0</title><link>http://blog.4321.la/article/2011-05-07-musicseeker2</link><description>&lt;p&gt;MusicSeeker 2.0 &#26159;&#19968;&#27454;&#22522;&#20110;MusicDonwloader&#35774;&#35745;&#24605;&#24819;&#30340;&#65292;&#20026;iPhone&#12289;iPod Touch&#12289;Android&#31561;&#22823;&#23631;&#24149;&#35302;&#25720;&#25163;&#26426;&#12289;MP4&#24320;&#21457;&#30340;&#38899;&#20048;&#19979;&#36733;&#36719;&#20214;&#65292;&#22522;&#20110;MusicSeeker&#31532;&#19968;&#20010;&#29256;&#26412;&#23436;&#21892;&#25913;&#36827;&#32780;&#26469;&#12290;&lt;/p&gt;
&lt;p&gt;MusicSeeker 2.0&#36719;&#20214;&#29305;&#24615;&#65306;&lt;/p&gt;
&lt;p&gt;0 &#33258;&#21160;&#36873;&#25321;&#26368;&#39640;&#30721;&#29575;MP3&#38899;&#36136;&#65288;320Kbps&#65289;&#12289;&#33258;&#21160;&#19979;&#36733;&#23548;&#20837;&#19987;&#36753;&#22270;&#29255;&#12289;&#33258;&#21160;&#19979;&#36733;LRC&#27468;&#35789;&#12289;&#33258;&#21160;&#19979;&#36733;&#25903;&#25345;iTunes&#30340;&#38745;&#24577;&#27468;&#35789;&lt;/p&gt;
&lt;p&gt;1 &#37319;&#29992;&#20840;&#26032;&#30340;UI&#35774;&#35745;&#65292;&#22522;&#20110;Windows Aero&#24605;&#24819;&#12290;&lt;/p&gt;
&lt;p&gt;2 &#28155;&#21152;&#26080;&#25439;&#38899;&#20048;&#65288;FLAC\APE&#65289;&#28304;&#65288;&#20165;&#25903;&#25345;&#37096;&#20998;&#27468;&#26354;&#65289;&#12290;&lt;/p&gt;
&lt;p&gt;3 &#28155;&#21152;&#23545;Windows-64Bit&#30340;&#21407;&#29983;&#25903;&#25345;&#65288;&#38750;WOW64&#65289;&#12290;&lt;/p&gt;
&lt;p&gt;4 &#28155;&#21152;&#38899;&#20048;&#35270;&#21548;&#21151;&#33021;&#12289;&#38899;&#20048;&#20998;&#20139;&#21151;&#33021;&#12290;&lt;/p&gt;
&lt;p&gt;5 &#28155;&#21152;&#19979;&#36733;&#30446;&#24405;&#35774;&#32622;&#21151;&#33021;&#12290;&lt;/p&gt;
&lt;p&gt;6 &#28155;&#21152;&#20840;&#23616;&#24322;&#24120;&#25429;&#33719;&#65292;&#19968;&#23450;&#31243;&#24230;&#38450;&#27490;&#36719;&#20214;&#23849;&#28291;&#12290;&lt;/p&gt;
&lt;p&gt;7 &#20462;&#22797;&#27468;&#26354;&#19979;&#36733;&#27468;&#35789;&#28151;&#20081;&#30340;BUG&#12290;&lt;/p&gt;
&lt;p&gt;8 &#20462;&#22797;&#19979;&#36733;&#27468;&#26354;&#37325;&#21517;&#30340;BUG&#65292;&#37319;&#29992;&#8220;&#27468;&#26354;&#21517; &#8211; &#27468;&#25163;&#21517;.&#25193;&#23637;&#21517;&#8221;&#30340;&#21629;&#21517;&#26041;&#24335;&#12290;&lt;/p&gt;
&lt;p&gt;9 &#21435;&#38500;&#37096;&#20998;&#32321;&#20887;&#30340;&#36873;&#39033;&#65292;&#21024;&#38500;&#33258;&#21160;&#28155;&#21152;&#21040;iTunes&#30340;&#21151;&#33021;&#65288;&#22810;&#21344;&#29992;&#30913;&#30424;&#31354;&#38388;&#65289;&#12290;&lt;/p&gt;
&lt;p&gt;10 &#21024;&#38500;&#37096;&#20998;&#36719;&#20214;&#29305;&#25928;&#21160;&#30011;&#65292;&#22686;&#21152;&#36719;&#20214;&#36816;&#34892;&#27969;&#30021;&#24230;&#12290;&lt;/p&gt;
&lt;p&gt;11 &#28155;&#21152;&#23545;&#20302;&#30721;&#29575;&#38899;&#20048;&#30340;&#25628;&#32034;&#25903;&#25345;&#65292;&#23436;&#21892;&#25628;&#32034;&#31639;&#27861;&#65292;&#38899;&#20048;&#24211;&#36164;&#28304;&#26356;&#21152;&#20840;&#38754;&#65281;&lt;/p&gt;
&lt;p&gt;12 &#36827;&#19968;&#27493;&#23436;&#21892;&#23545;&#26085;&#25991;&#12289;&#38889;&#25991;&#25628;&#32034;&#20248;&#21270;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/Z4htO.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#20171;&#32461;&#65306;MusicSeeker&#31532;&#19968;&#29256;&#21457;&#24067;&#20197;&#26469;&#65292;&#30528;&#23454;&#35299;&#20915;&#20102;&#35768;&#22810;&#32593;&#21451;&#19979;&#36733;&#38899;&#20048;&#30340;&#38382;&#39064;&#65292;&#34429;&#28982;&#36719;&#20214;&#26159;&#20174;MusicDownloader&#19978;&#23436;&#21892;&#32780;&#26469;&#65292;&#20294;&#26159;&#20173;&#28982;&#23384;&#22312;&#30528;&#19968;&#20123;&#38382;&#39064;&#65292;&#36825;&#20010;&#29256;&#26412;&#22312;&#20462;&#22797;&#38382;&#39064;&#30340;&#21516;&#26102;&#65292;&#20063;&#36827;&#19968;&#27493;&#30340;&#21152;&#24378;&#20102;&#36719;&#20214;&#30340;&#26131;&#29992;&#24615;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#20840;&#26032;&#35774;&#35745;&#30340;UI&#65306; &#30382;&#32932;&#35774;&#35745; &#8211; &#24651;&#26143;&#65288;http://yistring.com/ifun/&#65289;&#65292;&#24863;&#35874;&#24651;&#26143;&#23545;&#36719;&#20214;&#30340;&#24320;&#21457;&#25552;&#20379;&#30028;&#38754;&#35774;&#35745;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/yyIVx.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#28155;&#21152;&#20102;&#25628;&#32034;&#26234;&#33021;&#25552;&#31034;&#21151;&#33021;&#65292;&#26041;&#20415;&#25628;&#32034;&#27468;&#26354;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/8Bami.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#28155;&#21152;&#20102;&#27468;&#26354;&#35797;&#21548;&#21151;&#33021;&#12289;&#22797;&#21046;&#27468;&#26354;&#35797;&#21548;&#22320;&#22336;&#12289;&#20998;&#20139;&#24494;&#21338;&#21151;&#33021;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/0M04y.png" /&gt;&lt;/p&gt;
&lt;p&gt;MusicSeeker&#28155;&#21152;&#20102;&#23545;&#27468;&#26354;&#20449;&#24687;&#30340;&#32534;&#36753;&#21151;&#33021;&#30340;&#25903;&#25345;&#65292;&#22914;&#26524;&#24744;&#24819;&#35201;&#19979;&#36733;&#30340;&#27468;&#26354;&#30340;&#21517;&#31216;&#36807;&#20110;&#32321;&#20887;&#65292;&#25110;&#32773;&#19987;&#36753;&#21517;&#31216;&#38169;&#35823;&#23548;&#33268;&#26080;&#27861;&#25214;&#21040;&#27491;&#30830;&#30340;&#19987;&#36753;&#22270;&#29255;&#65292;&#22343;&#21487;&#20197;&#22312;&#28155;&#21152;&#19979;&#36733;&#20219;&#21153;&#30340;&#26102;&#20505;&#36827;&#34892;&#20462;&#25913;&#12290;PS&#65306;&#21333;&#20987;&#8220;&#24212;&#29992;&#8221;&#30340;&#21516;&#26102;&#31243;&#24207;&#20250;&#37325;&#26032;&#26681;&#25454;&#19987;&#36753;&#26469;&#33719;&#21462;&#19987;&#36753;&#22270;&#29255;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/tcIwk.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#21015;&#34920;&#20013;&#28155;&#21152;&#20102;&#21491;&#38190;&#33756;&#21333;&#65292;&#21516;&#26102;&#36890;&#36807;&#21452;&#20987;&#19979;&#36733;&#21015;&#34920;&#20063;&#21487;&#20197;&#26469;&#36805;&#36895;&#23450;&#20301;&#21040;&#25991;&#20214;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/ijNh7.png" /&gt;&lt;/p&gt;
&lt;p&gt;Version2.0&#37324;&#38754;&#28155;&#21152;&#20102;&#36719;&#20214;&#35774;&#32622;&#65292;&#25903;&#25345;&#35774;&#32622;&#38899;&#20048;&#19979;&#36733;&#20445;&#23384;&#36335;&#24452;&#12289;&#26080;&#25439;&#38899;&#20048;&#26684;&#24335;&#65288;FLAC&#25110;APE&#65289;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/FvH2R.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#19979;&#26469;&#30340;&#27468;&#26354;&#22343;&#24050;&#32463;&#21547;&#26377;&#27468;&#35789;&#21644;&#19987;&#36753;&#22270;&#29255;&#65292;&#26159;&#23436;&#20840;&#20860;&#23481;iTunes&#30340;&#65292;&#19978;&#22270;&#26159;&#22312;&#25105;&#30340;iTouch&#37324;&#30340;&#25773;&#25918;&#25928;&#26524;&#12290;&lt;/p&gt;
&lt;p&gt;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#27468;&#35789;&#12289;&#19987;&#36753;&#22270;&#29255;&#20840;&#37096;&#37117;&#26159;&#19968;&#38190;&#19979;&#36733;&#65292;&#23436;&#20840;&#19981;&#38656;&#35201;&#25163;&#21160;&#20877;&#21435;&#25628;&#32034;&#36164;&#28304;&#65281;&lt;/p&gt;
&lt;p&gt;&#35201;&#36816;&#34892;MusicSeeker&#65292;&#24744;&#30340;PC&#24517;&#39035;&#23433;&#35013;&#26377;Microsoft .Net Framework 3.5 SP1&#20197;&#21450;&#24494;&#36719;&#38597;&#40657;&#23383;&#20307;&#65292;&#22914;&#26524;&#24744;&#20351;&#29992;&#30340;Windows 7/Vista&#31995;&#32479;&#65292;&#21017;&#31995;&#32479;&#24050;&#32463;&#33258;&#24102;&#65292;&#26080;&#38656;&#20877;&#27425;&#23433;&#35013;&#65292;&#22914;&#26524;&#24744;&#29992;&#30340;&#26159;Windows Xp&#31995;&#32479;&#65292;&#21017;&#20063;&#35831;&#19979;&#36733;&#25105;&#20204;&#30340;&#36719;&#20214;&#36827;&#34892;&#36816;&#34892;&#65292;&#22914;&#26524;&#32570;&#23569;&#20197;&#19978;&#32452;&#20214;&#65292;&#31243;&#24207;&#20250;&#32473;&#20986;&#25552;&#31034;&#65292;&#21516;&#26102;&#32473;&#20986;&#20855;&#20307;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://down.4321.la/MusicSeekerPlus.zip"&gt;http://down.4321.la/MusicSeekerPlus.zip&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#65288;&#25903;&#25345;&#36805;&#38647;&#31561;&#19979;&#36733;&#24037;&#20855;&#65289;&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#26356;&#26032;&#65306;2011&#24180;5&#26376;9&#26085;
&#26356;&#26032;&#20869;&#23481;&#65306; &#20462;&#22797;&#26080;&#25439;&#38899;&#20048;&#37096;&#20998;&#19979;&#36733;&#22320;&#22336;&#38169;&#35823;&#30340;BUG&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-05-07-musicseeker2</guid><pubDate>Sat, 07 May 2011 23:27:00 GMT</pubDate></item><item><title>KissXiami &#8211; &#36731;&#37327;&#32423;&#22312;&#32447;&#34430;&#31859;&#38899;&#20048;&#19979;&#36733;&#32593;&#31449;&#19978;&#32447;</title><link>http://blog.4321.la/article/2011-05-07-kissxiami</link><description>&lt;p&gt;KissXiami.com&#26159;&#25105;&#22312;&#24320;&#21457;MusicSeeker&#21644;MusicSorter&#36825;&#26679;&#30340;.NET WPF&#26550;&#26500;&#30340;&#19996;&#35199;&#26102;&#30340;&#19994;&#20313;&#20316;&#21697;&#65292;&#20027;&#35201;&#26159;&#24819;&#32451;&#32451;PHP&#65292;&#32593;&#31449;&#38750;&#30408;&#21033;&#65292;&#26080;&#24191;&#21578;&#65292;&#31616;&#27905;&#30340;&#30028;&#38754;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#20320;&#30452;&#25509;&#25171;&#24320;KissXiami.com&#30340;&#35805;&#65292;&#20272;&#35745;&#20250;&#22833;&#26395;&#8230;&#8230;&#26159;&#30340;&#65292;&#32593;&#31449;&#31616;&#38475;&#21040;&#36830;&#20010;&#39318;&#39029;&#37117;&#26408;&#26377;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#37027;&#22914;&#20309;&#20351;&#29992;&#21602;&#65311;&lt;/p&gt;
&lt;p&gt;&#26041;&#27861;&#24456;&#31616;&#21333;&#65306;&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&#19978;&#34430;&#31859;&#32593;&#31449;&#19978;&#25214;&#21040;&#33258;&#24049;&#20013;&#24847;&#30340;&#21333;&#26354;&#12289;&#19987;&#36753;&#12289;&#27468;&#25163;&#39029;&#38754;&#12289;&#31934;&#36873;&#38598;&#39029;&#38754;&#12290;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65306;&#20174;&#27983;&#35272;&#22120;&#25171;&#24320;&#39029;&#38754;&#12290;&lt;/p&gt;
&lt;p&gt;&#20197;&#19978;&#20004;&#27493;&#20570;&#19981;&#22909;&#30340;&#20154;&#35831;&#33258;&#35273;&#21435;&#20070;&#24215;&#20080;&#19968;&#26412;&#32769;&#24180;&#20154;&#23398;&#30005;&#33041;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#20363;&#22914;&#27492;&#26102;&#25171;&#24320;&#30340;&#39029;&#38754;&#30340;&#32593;&#22336;&#26159;&#65306;http://www.xiami.com/song/1769196206&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#65292;&#25226;&#40736;&#26631;&#25918;&#22312;&#22320;&#22336;&#26639;&#19978;&#65292;&#23545;&#65292;&#23601;&#26159;&#26174;&#31034;&#22320;&#22336;&#30340;&#37027;&#19996;&#35199;&#65288;&#25454;&#35828;&#26377;&#19968;&#20010;O&#24320;&#22836;&#30340;&#27983;&#35272;&#22120;&#20250;&#25226;&#22320;&#22336;&#21518;&#38754;&#37096;&#20998;&#38544;&#34255;&#65292;&#28857;&#19968;&#19979;&#23601;&#21487;&#20197;&#20102;&#8230;&#8230;&#65289;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/TBsO2.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#26356;&#25913;&#32593;&#22336;&#65292;&#25226;www.xiami.com&#25913;&#25104;www.kissxiami.com&#65292;&#20854;&#23454;&#35828;&#26126;&#30333;&#20102;&#65292;&#23601;&#26159;&#22312;xiami&#21069;&#38754;&#21152;&#19978;&#19968;&#20010;kiss&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/jlaRL.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#65292;&#25353;&#19979;&#20146;&#29233;&#30340;&#22238;&#36710;&#38190;&#65292;&#23601;&#26159;&#38190;&#30424;&#19978;&#26631;&#26377;Enter&#30340;&#37027;&#20010;&#25353;&#38190;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/9ywms.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#32593;&#39029;&#36733;&#20837;&#23436;&#27605;&#20197;&#21518;&#23601;&#20250;&#33258;&#21160;&#25506;&#27979;&#27468;&#26354;&#30340;&#19979;&#36733;&#22320;&#22336;&#65292;&#38899;&#36136;&#26159;&#34430;&#31859;&#30340;&#35797;&#21548;&#38899;&#36136;&#65292;&#24456;&#25619;&#65292;&#20294;&#26159;&#24635;&#27604;&#27809;&#26377;&#22909;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#20320;&#24819;&#36861;&#27714;&#26356;&#23436;&#32654;&#30340;&#38899;&#36136;&#65292;&#36824;&#26159;&#25512;&#33616;&#24744;&#30475;&#30475;&#25105;&#32769;&#26089;&#23601;&#21457;&#24067;&#20102;&#30340;&#37027;&#19968;&#27454;&#36719;&#20214;&#65306;MusicSeeker&lt;/p&gt;
&lt;p&gt;&#33267;&#20110;&#19979;&#36733;&#65292;&#34429;&#28982;&#35828;&#36805;&#38647;&#20063;&#19981;&#26159;&#19981;&#21487;&#20197;&#65292;&#20294;&#26159;&#25105;&#27979;&#35797;&#36824;&#26159;&#29992;&#30446;&#26631;&#21478;&#23384;&#20026;&#19979;&#36733;&#30340;&#25928;&#26524;&#26368;&#22909;&#65292;&#36805;&#38647;&#26377;&#26102;&#20505;&#26377;&#36895;&#24230;&#26377;&#26102;&#20505;&#27809;&#26377;&#30340;&#25402;&#40635;&#28902;&#30340;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#23601;&#20889;&#36825;&#20040;&#22810;&#21543;&#65292;&#30446;&#21069;KissXiami&#25903;&#25345;&#21333;&#26354;&#12289;&#19987;&#36753;&#12289;&#27468;&#25163;&#39029;&#38754;&#12289;&#31934;&#36873;&#38598;&#65292;&#20351;&#29992;&#30340;&#26041;&#27861;&#37117;&#19968;&#26679;&#65292;&#37117;&#26159;&#25226;&#32593;&#22336;&#37324;&#30340;xiami.com&#21069;&#38754;&#21152;&#19978;kiss&#21363;&#21487;&lt;/p&gt;
&lt;p&gt;&#24863;&#35874;&#24744;&#30340;&#25903;&#25345;&#65292;&#26377;&#20219;&#20309;&#38382;&#39064;&#25110;&#32773;&#24847;&#35265;&#24314;&#35758;&#35831;&#20174;&#19979;&#38754;&#35780;&#35770;&#65292;&#25110;&#32773;&#32473;&#25105;&#21457;E-Mail&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-05-07-kissxiami</guid><pubDate>Sat, 07 May 2011 23:31:00 GMT</pubDate></item><item><title>MusicSorter + MusicNamer &#8211; &#25972;&#29702;&#38899;&#20048;&#65311;No Problem!</title><link>http://blog.4321.la/article/2011-04-08-musicsorter-musicnamer</link><description>&lt;p&gt;MusicSeeker&#21457;&#24067;&#20197;&#21518;&#26377;&#24456;&#22810;&#30340;&#26379;&#21451;&#25903;&#25345;&#25105;&#65292;&#21516;&#26102;&#26377;&#24456;&#22810;&#20154;&#25552;&#20986;&#24320;&#21457;&#19968;&#27454;&#25972;&#29702;&#29616;&#26377;&#38899;&#20048;&#30340;&#36719;&#20214;&#65292;&#26029;&#26029;&#32493;&#32493;&#30340;&#24320;&#21457;&#20102;&#19968;&#20010;&#26376;&#65292;&#22522;&#26412;&#23436;&#24037;&#20102;&#65292;&#23601;&#26159;&#24744;&#29616;&#22312;&#27491;&#22312;&#30475;&#30340;&#36719;&#20214;&#8212;&#8212;MusicSorter&#12290;&lt;/p&gt;
&lt;p&gt;MusicSorter&#26159;&#19968;&#27454;&#25972;&#29702;&#24050;&#26377;&#38899;&#20048;&#12289;&#33258;&#21160;&#19979;&#36733;&#19987;&#36753;&#22270;&#29255;&#12289;&#19979;&#36733;&#38745;&#24577;&#27468;&#35789;&#20445;&#23384;&#21040;iTunes&#31561;&#36719;&#20214;&#21487;&#20197;&#35782;&#21035;&#30340;&#26631;&#31614;&#20013;&#30340;&#36719;&#20214;&#65292;&#38750;&#24120;&#36866;&#21512;iPhone&#12289;iPod Touch&#31561;&#22823;&#23631;&#24149;&#31561;&#25903;&#25345;&#19987;&#36753;&#22270;&#29255;&#26174;&#31034;&#30340;&#25163;&#26426;&#12289;MP4&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#26368;&#21518;&#26356;&#26032;&#65306;2011&#24180;6&#26376;7&#26085; 16:01:54&lt;/p&gt;
&lt;p&gt;&#26356;&#26032;&#20869;&#23481;&#65306;1&#12289;&#20462;&#22797;&#27468;&#35789;&#31639;&#27861;&#30340;&#19968;&#22788;BUG 2&#12289;&#28155;&#21152;&#25163;&#21160;&#36873;&#25321;&#27468;&#35789; &#25163;&#21160;&#25628;&#32034;&#27468;&#35789;&#30340;&#21151;&#33021;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/aNNoS.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#24863;&#35874;&#24651;&#26143;&#21516;&#23398;(http://yistring.com/ifun/)&#36719;&#20214;&#24320;&#21457;&#25552;&#20379;&#30340;&#30382;&#32932;&#35774;&#35745;&#65292;&#36229;&#36190;&#65281;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#21551;&#21160;&#30028;&#38754;&#22914;&#19979;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/2Eap1.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25209;&#37327;&#19979;&#36733;&#25130;&#22270;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/rUo4p.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25972;&#29702;&#25928;&#26524;&#25130;&#22270;&#65306;&lt;/p&gt;
&lt;p&gt;&#27468;&#26354;&#30340;&#19987;&#36753;&#22270;&#29255;&#24050;&#32463;&#20117;&#28982;&#26377;&#24207;&#65292;&#36825;&#26102;&#20505;&#23548;&#20837;iTunes&#31561;&#36719;&#20214;&#23601;&#38750;&#24120;&#26041;&#20415;&#30465;&#20107;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/ifskJ.png" /&gt;&lt;/p&gt;
&lt;p&gt;2011&#24180;6&#26376;7&#26085; &#26356;&#26032;&#20869;&#23481;&#35828;&#26126;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/fnX0S.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&#27468;&#26354;&#21491;&#38190; &#8211; &#32534;&#36753;&#27468;&#26354;&#27468;&#35789;&#20013;&#65292;&#28155;&#21152;&#21151;&#33021;&#65292;&#26041;&#20415;&#25163;&#21160;&#25628;&#32034;&#27468;&#35789;&#12290;&lt;/p&gt;
&lt;p&gt;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&lt;/p&gt;
&lt;p&gt;&#34917;&#20805;&#35828;&#26126;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#35201;&#36816;&#34892;MusicSorter&#65292;&#24744;&#30340;PC&#24517;&#39035;&#23433;&#35013;&#26377;Microsoft .Net Framework 3.5 SP1&#20197;&#21450;&#24494;&#36719;&#38597;&#40657;&#23383;&#20307;&#65292;&#22914;&#26524;&#24744;&#20351;&#29992;&#30340;Windows 7/Vista&#31995;&#32479;&#65292;&#21017;&#31995;&#32479;&#24050;&#32463;&#33258;&#24102;&#65292;&#26080;&#38656;&#20877;&#27425;&#23433;&#35013;&#65292;&#22914;&#26524;&#24744;&#29992;&#30340;&#26159;Windows XP&#31995;&#32479;&#65292;&#21017;&#20063;&#35831;&#19979;&#36733;&#25105;&#20204;&#30340;&#36719;&#20214;&#36827;&#34892;&#36816;&#34892;&#65292;&#22914;&#26524;&#32570;&#23569;&#20197;&#19978;&#32452;&#20214;&#65292;&#31243;&#24207;&#20250;&#32473;&#20986;&#25552;&#31034;&#65292;&#21516;&#26102;&#32473;&#20986;&#20855;&#20307;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&lt;/p&gt;
&lt;p&gt;&#65288;&#22914;&#26524;&#24744;&#30340;&#30005;&#33041;&#24050;&#32463;&#25104;&#21151;&#36816;&#34892;MusicSeeker&#65292;&#21017;&#36816;&#34892;MusicSorter&#23601;&#19981;&#20250;&#26377;&#20219;&#20309;&#38382;&#39064;&#65292;&#21516;&#26102;MusicSorter&#38024;&#23545;64&#20301;&#31995;&#32479;&#36827;&#34892;&#20102;&#19987;&#38376;&#20248;&#21270;&#65292;&#25903;&#25345;&#21407;&#29983;64&#20301;&#27169;&#24335;&#19979;&#36816;&#34892;&#65281;&#65289;&lt;/p&gt;
&lt;p&gt;2&#12289;&#36719;&#20214;&#24403;&#21069;&#22788;&#20110;&#27979;&#35797;&#38454;&#27573;&#65292;&#24378;&#28872;&#25512;&#33616;&#24744;&#22312;&#24320;&#21551;&#25209;&#37327;&#19979;&#36733;&#21069;&#22791;&#20221;&#24744;&#30340;&#27468;&#26354;&#65281;&lt;/p&gt;
&lt;p&gt;3&#12289;&#20851;&#20110;&#36719;&#20214;&#30340;&#20351;&#29992;&#25945;&#31243;&#65292;&#35831;&#26597;&#30475;MusicSorter&#30340;&#36719;&#20214;&#20351;&#29992;&#25945;&#31243;&#65292;&#22240;&#20026;&#25105;&#23545;UI&#20132;&#20114;&#19981;&#26159;&#24456;&#22312;&#34892;&#65292;&#24076;&#26395;&#22823;&#23478;&#22810;&#22810;&#35845;&#35299;&#65292;&#32784;&#24515;&#35835;&#19968;&#19979;&#25945;&#31243;&#65292;&#26377;&#20219;&#20309;&#20351;&#29992;&#19978;&#30340;&#38382;&#39064;&#35831;&#30452;&#25509;&#22238;&#22797;&#35813;&#25991;&#31456;&#25110;&#32773;&#32473;&#25105;&#21457;E-Mail&#65292;&#25910;&#21040;&#37038;&#20214;&#30340;&#31532;&#19968;&#26102;&#38388;&#20250;&#22238;&#22797;&#22823;&#23478;&#30340;&#65281;&lt;/p&gt;
&lt;p&gt;&#25945;&#31243;&#20256;&#36865;&#38376;&#65306;http://blog.4321.la/2011/04/318.html&lt;/p&gt;
&lt;p&gt;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&lt;/p&gt;
&lt;p&gt;MusicNamer&#65306;&lt;/p&gt;
&lt;p&gt;MusicSorter&#30340;&#24320;&#21457;&#31163;&#19981;&#24320;Shindo&#21516;&#23398;&#30340;&#25903;&#25345;&#65292;&#26412;&#27425;&#21457;&#24067;&#20013;&#32852;&#21512;&#21457;&#24067;MusicSorter&#19982;MusicNamer&#36825;&#20004;&#27454;&#36719;&#20214;&#65292;MusicNamer&#26159;&#19968;&#27454;&#26681;&#25454;&#27468;&#26354;ID3&#26631;&#31614;&#33258;&#21160;&#37325;&#21629;&#21517;&#36719;&#20214;&#30340;&#36731;&#37327;&#32423;&#24037;&#20855;&#65292;&#22522;&#20110;Windows SDK&#24320;&#21457;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/D3Ddq.jpg" /&gt;&lt;/p&gt;
&lt;p&gt;&#26356;&#22810;&#20449;&#24687;&#65292;&#35831;&#35775;&#38382;MusicNamer&#21457;&#24067;&#39029;&#65306;&lt;a href="http://sdou.net/2011/04/133.html"&gt;http://sdou.net/2011/04/133.html&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#22320;&#22336;&#65288;MusicSorter + MusicNamer&#65289;&lt;/p&gt;
&lt;p&gt;&#30452;&#25509;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;a href="http://down.4321.la/MusicSorterNamer20110607.zip"&gt;http://down.4321.la/MusicSorterNamer20110607.zip&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#24863;&#35874;&#21508;&#20301;&#30340;&#25903;&#25345;&#65292;&#27426;&#36814;&#22823;&#23478;&#25552;&#20986;&#24847;&#35265;&#24314;&#35758;&#65292;&#24744;&#30340;&#25903;&#25345;&#26159;&#25105;&#20204;&#26368;&#22823;&#30340;&#21160;&#21147;&#65281;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-04-08-musicsorter-musicnamer</guid><pubDate>Fri, 08 Apr 2011 23:18:00 GMT</pubDate></item><item><title>MusicSorter&#20351;&#29992;&#25945;&#31243;</title><link>http://blog.4321.la/article/2011-04-05-musicsorter-faq</link><description>&lt;p&gt;&#39318;&#20808;&#65292;&#24863;&#35874;&#24744;&#36873;&#29992;MusicSorter&#20316;&#20026;&#24744;&#30340;&#38899;&#20048;&#25972;&#29702;&#36719;&#20214;&#65292;&#25512;&#33616;&#24744;&#20180;&#32454;&#38405;&#35835;&#19979;&#38754;&#30340;&#25945;&#31243;&#65292;&#20197;&#33719;&#24471;&#26356;&#21152;&#30340;&#29992;&#25143;&#20307;&#39564;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#25945;&#31243;&#19968;&#65306;&#28155;&#21152;&#27468;&#26354;&lt;/p&gt;
&lt;p&gt;&#21551;&#21160;&#36719;&#20214;&#65292;&#31561;&#24453;Loading&#30011;&#38754;&#32467;&#26463;&#65292;&#21333;&#20987;&#36719;&#20214;&#24038;&#19979;&#35282;&#30340;&#8220;&lt;img alt="image" src="http://i.imgur.com/1XHS8.png" /&gt;&#8221;&#25353;&#38062;&#21363;&#21487;&lt;/p&gt;
&lt;p&gt;&#22312;&#28155;&#21152;&#23545;&#35805;&#26694;&#20013;&#65292;&#24744;&#21487;&#20197;&#22810;&#36873;&#25991;&#20214;&#65292;&#25110;&#32773;&#25353;Ctrl+A&#20840;&#36873;&#19968;&#20010;&#25991;&#20214;&#22841;&#20869;&#30340;&#25152;&#26377;&#25991;&#20214;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/b1sqP.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#24403;&#21069;&#29256;&#26412;&#20165;&#25903;&#25345;MP3&#31867;&#22411;&#30340;&#25991;&#20214;&#65292;&#20854;&#23427;&#31867;&#22411;&#30340;&#25991;&#20214;&#20250;&#33258;&#21160;&#24573;&#30053;&#65292;&#26080;&#38656;&#25163;&#21160;&#25490;&#38500;&lt;/p&gt;
&lt;p&gt;&#25945;&#31243;&#20108;&#65306;&#36873;&#20013;&#27468;&#26354;&#12289;&#33258;&#21160;&#19979;&#36733;&#19987;&#36753;&#22270;&#29255;&#12289;&#27468;&#26354;&#27468;&#35789;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/s7DLX.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#28155;&#21152;&#27468;&#26354;&#20043;&#21518;&#65292;&#22914;&#26524;&#27468;&#26354;&#26412;&#36523;&#24050;&#32463;&#24102;&#26377;&#19987;&#36753;&#22270;&#29255;&#12289;&#27468;&#35789;&#30340;&#35805;&#65292;&#36719;&#20214;&#21491;&#38754;&#23601;&#20250;&#26377;&lt;img alt="image" src="http://i.imgur.com/Xl4vC.png" /&gt;&#30340;&#25552;&#31034;&lt;/p&gt;
&lt;p&gt;&#36873;&#20013;&#19968;&#27454;&#19981;&#21547;&#19987;&#36753;&#22270;&#29255;&#25110;&#32773;&#27468;&#35789;&#30340;&#27468;&#26354;&#65292;&#31243;&#24207;&#23601;&#20250;&#33258;&#21160;&#24320;&#22987;&#25628;&#32034;&#65292;&#24182;&#22312;&#21491;&#36793;&#26174;&#31034;&#20986;&#26469;&#25628;&#32034;&#20986;&#26469;&#30340;&#19987;&#36753;&#23553;&#38754;&#30340;&#32467;&#26524;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/U9uRD.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#19987;&#36753;&#23553;&#38754;&#30340;&#20004;&#20391;&#26377;&#26102;&#20505;&#26377;&#8220;&amp;lt;&#8220;&#8221;&amp;gt;&#8221;&#30340;&#25353;&#38062;&#65292;&#24847;&#21619;&#30528;&#26377;&#22810;&#20010;&#19987;&#36753;&#22270;&#29255;&#20379;&#24744;&#36873;&#25321;&#12290;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#25628;&#32034;&#19981;&#21040;&#32467;&#26524;&#65292;&#35831;&#22312;&#19979;&#38754;&#30340;&#8221;&#27468;&#26354;&#20449;&#24687;&#8220;&#37324;&#38754;&#36827;&#34892;&#20462;&#25913;&#65292;&#28982;&#21518;&#25353;&#22238;&#36710;&#38190;&#37325;&#26032;&#35843;&#29992;&#36719;&#20214;&#33258;&#21160;&#25628;&#32034;&lt;/p&gt;
&lt;p&gt;&#23545;&#20110;&#19987;&#36753;&#22270;&#29255;&#38169;&#35823;&#30340;&#27468;&#26354;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#23545;&#27468;&#26354;&#20449;&#24687;&#20462;&#25913;&#24182;&#25353;&#22238;&#36710;&#38190;&#30340;&#26041;&#27861;&#26469;&#37325;&#26032;&#28608;&#27963;&#36719;&#20214;&#25628;&#32034;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/qjLI5.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#24403;&#27468;&#26354;&#19987;&#36753;&#22270;&#29255;OK&#21518;&#65292;&#23601;&#21487;&#20197;&#21333;&#20987;&#8220;&#20445;&#23384;&#8221;&#25353;&#38062;&#20445;&#23384;&#20462;&#25913;&#21040;&#27468;&#26354;&#20102;&#65281;&lt;/p&gt;
&lt;p&gt;&#36825;&#26102;&#27468;&#26354;&#21015;&#34920;&#30340;&#24038;&#36793;&#23545;&#24212;&#30340;&#27468;&#26354;&#20063;&#20250;&#26174;&#31034;&#20986;&#27468;&#26354;&#24050;&#32463;&#21253;&#21547;&#19987;&#36753;&#22270;&#29255;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/iB6vu.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25945;&#31243;&#19977;&#65306;&#25163;&#21160;&#32534;&#36753;&#27468;&#35789;&#12289;&#21024;&#38500;&#27468;&#35789;&#25110;&#19987;&#36753;&#22270;&#29255;&lt;/p&gt;
&lt;p&gt;&#21491;&#38190;&#21333;&#20987;&#27468;&#26354;&#39033;&#30446;&#65292;&#20250;&#24377;&#20986;&#24555;&#25463;&#33756;&#21333;&#65292;&#25903;&#25345;&#32534;&#36753;&#12289;&#21024;&#38500;&#27468;&#26354;&#27468;&#35789;&#65292;&#21024;&#38500;&#19987;&#36753;&#22270;&#29255;&#12290;&lt;/p&gt;
&lt;p&gt;&#26041;&#20415;&#22312;&#19987;&#36753;&#22270;&#29255;&#25110;&#27468;&#26354;&#27468;&#35789;&#38169;&#35823;&#30340;&#26102;&#20505;&#36827;&#34892;&#20154;&#24037;&#20462;&#25913;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/6i8De.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/h99Zk.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25945;&#31243;&#22235;&#65306;&#25209;&#37327;&#19979;&#36733;&lt;/p&gt;
&lt;p&gt;&#25209;&#37327;&#19979;&#36733;&#36866;&#29992;&#20110;&#27468;&#26354;&#36739;&#22810;&#12289;&#27468;&#26354;ID3&#24050;&#32463;&#27604;&#36739;&#25972;&#40784;&#30340;&#24773;&#20917;&#65292;&#22914;&#26524;&#24744;&#30340;&#27468;&#26354;&#22823;&#22810;&#37117;&#26159;&#30334;&#24230;&#19979;&#36733;&#30340;&#65292;ID3&#26631;&#31614;&#24182;&#19981;&#26159;&#38750;&#24120;&#20934;&#30830;&#65292;&#21017;&#25209;&#37327;&#19979;&#36733;&#30340;&#20307;&#39564;&#20250;&#22240;&#27492;&#22823;&#22823;&#25240;&#25187;&#12290;&lt;/p&gt;
&lt;p&gt;&#21478;&#22806;&#36719;&#20214;&#22788;&#20110;&#27979;&#35797;&#38454;&#27573;&#65292;&#24378;&#28872;&#25512;&#33616;&#24744;&#22312;&#25209;&#37327;&#19979;&#36733;&#20043;&#21069;&#22791;&#20221;&#24744;&#30340;&#27468;&#26354;&#65292;&#22914;&#26524;&#36935;&#21040;&#20219;&#20309;&#25209;&#37327;&#19979;&#36733;&#36807;&#31243;&#20013;&#36719;&#20214;&#23849;&#28291;&#12289;&#27468;&#26354;&#25439;&#22351;&#30340;&#38382;&#39064;&#65292;&#35831;&#21450;&#26102;&#32852;&#31995;&#25105;&#20204;&#12290;&lt;/p&gt;
&lt;p&gt;&#25209;&#37327;&#19979;&#36733;&#30340;&#26041;&#27861;&#38750;&#24120;&#31616;&#21333;&#65292;&#28155;&#21152;&#27468;&#26354;&#12289;&#21333;&#20987;&#8221;&#19979;&#36733;&#20840;&#37096;&#27468;&#26354;&#27468;&#35789;&#8220;&#21363;&#21487;&#65281;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#21069;&#25512;&#33616;&#24744;&#20851;&#38381;&#36805;&#38647;&#31561;&#21344;&#29992;&#24102;&#23485;&#30340;&#36719;&#20214;&#65292;&#20197;&#21152;&#24555;&#36719;&#20214;&#19979;&#36733;&#19987;&#36753;&#22270;&#29255;&#30340;&#36895;&#24230;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/Tcwmu.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#30340;&#22823;&#27010;&#20351;&#29992;&#26041;&#27861;&#23601;&#26159;&#36825;&#26679;&#20102;&#65292;&#26377;&#20219;&#20309;&#30340;&#38382;&#39064;&#35831;&#20174;&#36719;&#20214;&#21457;&#24067;&#24086;&#20869;&#30041;&#35328;&#22238;&#22797;&#25110;&#32773;&#36890;&#36807;E-Mail&#12289;&#24494;&#21338;&#32852;&#31995;&#25105;&#65292;&#36825;&#31687;&#25991;&#31456;&#20851;&#38381;&#22238;&#22797;&#65292;&#19981;&#28982;&#23454;&#22312;&#26159;&#24537;&#19981;&#36807;&#26469;&#65292;&#21621;&#21621;&#12290;&lt;/p&gt;
&lt;p&gt;&#20877;&#27425;&#24863;&#35874;&#24744;&#30340;&#25903;&#25345;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-04-05-musicsorter-faq</guid><pubDate>Tue, 05 Apr 2011 23:15:00 GMT</pubDate></item><item><title>MusicSeeker&#8212;&#8212;&#27468;&#26354;&#12289;&#19987;&#36753;&#22270;&#29255;&#12289;&#27468;&#35789;&#20840;&#33258;&#21160;&#19979;&#36733;&#24037;&#20855;</title><link>http://blog.4321.la/article/2011-03-05-musicseeker</link><description>&lt;p&gt;MusicSeeker&#26159;&#19968;&#27454;&#22522;&#20110;MusicDonwloader&#35774;&#35745;&#24605;&#24819;&#30340;&#65292;&#20026;iPhone&#12289;iPod Touch&#12289;Android&#31561;&#22823;&#23631;&#24149;&#35302;&#25720;&#25163;&#26426;&#12289;MP4&#24320;&#21457;&#30340;&#38899;&#20048;&#19979;&#36733;&#36719;&#20214;&#12290;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#21517;&#31216;&#65306;MusicSeeker&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#29305;&#24615;&#65306;&#33258;&#21160;&#36873;&#25321;&#26368;&#39640;&#30721;&#29575;&#65288;320Kbps&#65289;&#12289;&#33258;&#21160;&#19979;&#36733;&#23548;&#20837;&#19987;&#36753;&#22270;&#29255;&#12289;&#33258;&#21160;&#19979;&#36733;LRC&#27468;&#35789;&#12289;&#33258;&#21160;&#19979;&#36733;&#25903;&#25345;iTunes&#30340;&#38745;&#24577;&#27468;&#35789;&#12289;&#33258;&#21160;&#28155;&#21152;&#21040;iTunes&#38899;&#20048;&#24211;&#12290;&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#26356;&#26032;&#65306;2011&#24180;3&#26376;20&#26085;13:30:04&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/M8LbA.png" /&gt;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#36719;&#20214;&#20171;&#32461;&#65306;&#20171;&#20110;&#24456;&#22810;&#26379;&#21451;&#23545;&#25105;&#30340;MusicDownloader&#30340;&#25903;&#25345;&#65292;&#20197;&#21450;&#26087;&#29256;&#36951;&#30041;&#30340;&#35832;&#22810;&#38382;&#39064;&#65292;&#36825;&#27425;&#25105;&#19987;&#38376;&#25277;&#26102;&#38388;&#36827;&#34892;&#20102;&#20840;&#26032;&#30340;&#24320;&#21457;&#65292;&#26088;&#22312;&#35299;&#20915;&#38382;&#39064;&#21644;&#26356;&#22909;&#30340;&#32473;&#22823;&#23478;&#25552;&#20379;&#26381;&#21153;&#12290;&#26032;&#29256;MusicSeeker&#22312;MusicDownloader&#30340;&#22522;&#30784;&#19978;&#28155;&#21152;&#20102;&#30721;&#29575;&#26174;&#31034;&#12289;&#20302;&#30721;&#29575;&#25991;&#20214;&#19979;&#36733;&#25903;&#25345;&#12289;LRC&#27468;&#35789;&#21450;&#38745;&#24577;&#27468;&#35789;&#19979;&#36733;&#25903;&#25345;&#12290;&lt;/p&gt;
&lt;p&gt;&#20840;&#26032;&#35774;&#35745;&#30340;UI&#65306; &#30382;&#32932;&#35774;&#35745; &#8211; &#24651;&#26143;&#65288;&lt;a href="http://yistring.com/ifun/"&gt;http://yistring.com/ifun/&lt;/a&gt;&#65289;&#65292;&#24863;&#35874;&#24651;&#26143;&#23545;&#36719;&#20214;&#30340;&#24320;&#21457;&#25552;&#20379;&#30028;&#38754;&#35774;&#35745;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/FAvLo.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#26032;&#29256;&#30340;MusicSeeker&#28155;&#21152;&#20102;&#23545;&#27468;&#26354;&#20449;&#24687;&#30340;&#32534;&#36753;&#21151;&#33021;&#30340;&#25903;&#25345;&#65292;&#22914;&#26524;&#24744;&#24819;&#35201;&#19979;&#36733;&#30340;&#27468;&#26354;&#30340;&#21517;&#31216;&#36807;&#20110;&#32321;&#20887;&#65292;&#25110;&#32773;&#19987;&#36753;&#21517;&#31216;&#38169;&#35823;&#23548;&#33268;&#26080;&#27861;&#25214;&#21040;&#27491;&#30830;&#30340;&#19987;&#36753;&#22270;&#29255;&#65292;&#22343;&#21487;&#20197;&#22312;&#28155;&#21152;&#19979;&#36733;&#20219;&#21153;&#30340;&#26102;&#20505;&#36827;&#34892;&#20462;&#25913;&#12290;PS&#65306;&#21333;&#20987;&#8220;&#24212;&#29992;&#8221;&#30340;&#21516;&#26102;&#31243;&#24207;&#20250;&#37325;&#26032;&#26681;&#25454;&#19987;&#36753;&#26469;&#33719;&#21462;&#19987;&#36753;&#22270;&#29255;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/ZTIDI.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#27468;&#26354;&#20250;&#33258;&#21160;&#19979;&#36733;&#21040; &#25105;&#30340;&#25991;&#26723; &#8211; &#25105;&#30340;&#38899;&#20048; &#30446;&#24405;&#65292;&#24403;&#28982;&#24744;&#20063;&#21487;&#20197;&#36890;&#36807;&#21452;&#20987;&#19979;&#36733;&#21015;&#34920;&#26469;&#36805;&#36895;&#23450;&#20301;&#21040;&#25991;&#20214;&lt;/p&gt;
&lt;p&gt;LRC&#27468;&#35789;&#33258;&#21160;&#19979;&#36733;&#65292;&#24182;&#20445;&#23384;&#21040;&#38899;&#20048;&#25152;&#22312;&#30446;&#24405;&#65292;&#19982;&#38899;&#20048;&#25991;&#20214;&#21516;&#25991;&#20214;&#21517;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/m6Pff.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#21246;&#36873;&#20102;&#8220;&#33258;&#21160;&#19979;&#36733;&#19987;&#36753;&#22270;&#29255;&#8221;&#8220;&#33258;&#21160;&#19979;&#36733;&#27468;&#35789;&#8221;&#31561;&#21151;&#33021;&#65292;&#19979;&#36733;&#19979;&#26469;&#30340;&#22270;&#29255;&#26159;&#23436;&#20840;&#20860;&#23481;iTunes&#30340;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/UFico.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#22312;&#25105;&#30340;iPod Touch&#37324;&#38754;&#30340;&#25773;&#25918;&#25928;&#26524;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/qr3lU.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#26368;&#37325;&#35201;&#30340;&#26159;&#65292;&#27468;&#35789;&#12289;&#19987;&#36753;&#22270;&#29255;&#20840;&#37096;&#37117;&#26159;&#19968;&#38190;&#19979;&#36733;&#65292;&#23436;&#20840;&#19981;&#38656;&#35201;&#25163;&#21160;&#20877;&#21435;&#25628;&#32034;&#36164;&#28304;&#65281;&lt;/p&gt;
&lt;p&gt;&#35201;&#36816;&#34892;MusicSeeker&#65292;&#24744;&#30340;PC&#24517;&#39035;&#23433;&#35013;&#26377;Microsoft .Net Framework 3.5 SP1&#20197;&#21450;&#24494;&#36719;&#38597;&#40657;&#23383;&#20307;&#65292;&#22914;&#26524;&#24744;&#20351;&#29992;&#30340;Windows 7/Vista&#31995;&#32479;&#65292;&#21017;&#31995;&#32479;&#24050;&#32463;&#33258;&#24102;&#65292;&#26080;&#38656;&#20877;&#27425;&#23433;&#35013;&#65292;&#22914;&#26524;&#24744;&#29992;&#30340;&#26159;Windows Xp&#31995;&#32479;&#65292;&#21017;&#20063;&#35831;&#19979;&#36733;&#25105;&#20204;&#30340;&#36719;&#20214;&#36827;&#34892;&#36816;&#34892;&#65292;&#22914;&#26524;&#32570;&#23569;&#20197;&#19978;&#32452;&#20214;&#65292;&#31243;&#24207;&#20250;&#32473;&#20986;&#25552;&#31034;&#65292;&#21516;&#26102;&#32473;&#20986;&#20855;&#20307;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&lt;/p&gt;
&lt;p&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/p&gt;
&lt;p&gt;&#30452;&#25509;&#19979;&#36733; &#8211; &lt;a href="http://down.4321.la/MusicSeeker20110320.zip"&gt;http://down.4321.la/MusicSeeker20110320.zip&lt;/a&gt; &#65288;&#25903;&#25345;&#36805;&#38647;&#31561;&#19979;&#36733;&#24037;&#20855;&#65289;&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#26356;&#26032;&#65306;2011&#24180;3&#26376;20&#26085;13:30:37&lt;/p&gt;
&lt;p&gt;&#26356;&#26032;&#29256;&#26412;&#65306;0.11&lt;/p&gt;
&lt;p&gt;&#26356;&#26032;&#20869;&#23481;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#20462;&#22797;&#24050;&#30693;&#23849;&#28291;&#38382;&#39064;&#12289;&#27468;&#35789;&#21305;&#37197;&#19981;&#20934;&#30340;&#38382;&#39064;&lt;/p&gt;
&lt;p&gt;2&#12289;&#22686;&#21152;&#38889;&#25991;&#25628;&#32034;&#25903;&#25345;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#65288;MusicSeeker&#30446;&#21069;&#20165;&#26159;&#20174;MusicDownloader&#19978;&#32487;&#32493;&#24320;&#21457;&#32780;&#26469;&#30340;&#31532;&#19968;&#20010;&#29256;&#26412;&#65292;&#22312;&#20572;&#27490;MusicDownloader&#39033;&#30446;&#30340;&#21516;&#26102;&#65292;MusicSeeker&#21518;&#32493;&#29256;&#26412;&#23558;&#20250;&#32473;&#22823;&#23478;&#24102;&#26469;&#26356;&#20840;&#30340;&#27468;&#26354;&#26354;&#24211;&#12289;&#35797;&#21548;&#31561;&#26356;&#21152;&#23454;&#29992;&#30340;&#21151;&#33021;&#65292;&#25964;&#35831;&#26399;&#24453;&#12290;&#65289;&lt;/strong&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-03-05-musicseeker</guid><pubDate>Sat, 05 Mar 2011 23:08:00 GMT</pubDate></item><item><title>&#20351;&#29992;WPF&#21019;&#24314;&#20855;&#26377;&#28176;&#21464;&#25928;&#26524;&#30340;&#25353;&#38062;&#29305;&#25928;</title><link>http://blog.4321.la/article/2011-02-17-wpf-button</link><description>&lt;p&gt;&#23545;&#20110;&#25105;&#36825;&#26679;&#30340;&#19981;&#20250;C++&#65292;&#19981;&#20250;GDI+&#65292;&#19981;&#31934;&#36890;Photoshop&#30340;&#24754;&#20652;&#20154;&#22763;&#26469;&#35828;&#65292;&#24819;&#23454;&#29616;&#21326;&#20029;&#30340;&#30028;&#38754;&#65292;&#21807;&#26377;&#20351;&#29992;WPF&#65292;&#34429;&#28982;&#23427;&#23646;&#20110;&#25176;&#31649;&#24179;&#21488;&#65292;&#36816;&#34892;&#25928;&#29575;&#20063;&#38750;&#24120;&#20302;&#65292;&#20294;&#26159;&#22312;UI&#35774;&#35745;&#19978;&#30830;&#23454;&#26159;&#38750;&#24120;&#30340;&#32473;&#21147;&#12290;&lt;/p&gt;
&lt;p&gt;&#20808;&#25918;&#19968;&#24352;&#25928;&#26524;&#22270;&#65306;&lt;/p&gt;
&lt;p&gt;&#27491;&#24120;&#29366;&#24577;&#25928;&#26524;&#65306;&lt;img alt="WPF" src="http://i.imgur.com/ubqSI.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#40736;&#26631;&#24748;&#20572;&#25928;&#26524;&#65306;&lt;img alt="WPF" src="http://i.imgur.com/eBe4B.png" /&gt;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#21516;&#26102;&#36825;&#26399;&#38388;&#21547;&#26377;&#30340;&#28176;&#21464;&#22806;&#21457;&#20809;&#29305;&#25928;&#65292;&#22270;&#29255;&#19978;&#30475;&#19981;&#20986;&#26469;&#25928;&#26524;&#65292;&#22823;&#23478;&#21487;&#20197;&#19979;&#36733;&#25105;&#30340;320Kbps&#38899;&#20048;&#19979;&#36733;&#21161;&#25163;&#21363;&#21487;&#30475;&#21040;&#25928;&#26524;&#65292;&#25110;&#32773;&#23558;&#19979;&#25991;&#30340;&#20195;&#30721;&#33258;&#24049;&#35843;&#35797;&#20986;&#26469;&#21363;&#21487;&#12290;&lt;/p&gt;
&lt;p&gt;{% blockquote %}
&#36716;&#36733;&#35831;&#27880;&#26126; http://www.4321.la 
{% endblockquote %}&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65292;&#20351;&#29992;Microsoft Expression Blend 4&#26032;&#24314;&#19968;&#20010;WPF 3.5&#24037;&#31243;&#65292;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="WPF" src="http://i.imgur.com/eBe4B.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65292;&#20351;&#29992;&#24038;&#20391;&#24037;&#20855;&#26639;&#28155;&#21152;&#19968;&#20010;Button&#21040;&#23458;&#25143;&#21306;&#20013;
&lt;img alt="image" src="http://i.imgur.com/XX26G.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/SFaaS.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#19977;&#27493;&#65292;&#36873;&#20013;&#25353;&#38062;&#65292;&#20197;&#27492;&#21333;&#20987;&#33756;&#21333;&#23545;&#35937; &#8211; &#32534;&#36753;&#26679;&#24335; &#8211; &#32534;&#36753;&#21103;&#26412;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/vMyRj.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#20026;&#20102;&#26041;&#20415;&#20197;&#21518;&#23558;&#30456;&#21516;&#30340;&#26679;&#24335;&#24212;&#29992;&#21040;&#21035;&#30340;&#25353;&#38062;&#20013;&#65292;&#25512;&#33616;&#36873;&#25321;&#23450;&#20041;&#20301;&#32622;&#20026;&#8220;&#24212;&#29992;&#31243;&#24207;&#8221;&#65292;&#21516;&#26102;&#36215;&#19968;&#20010;&#22909;&#35760;&#30340;&#21517;&#23383;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/pSMiG.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#21333;&#20987;&#30830;&#23450;&#25353;&#38062;&#20197;&#21518;&#65292;&#31243;&#24207;&#20250;&#33258;&#21160;&#25171;&#24320;App.xaml&#25991;&#20214;&#65292;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/anP8m.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#31532;&#22235;&#27493;&#65292;&#20999;&#25442;&#21040;XAML&#32534;&#36753;&#27169;&#24335;&#65292;&#36890;&#36807;&#25970;&#20195;&#30721;&#26469;&#23454;&#29616;&#19968;&#20010;&#32474;&#20029;&#30340;&#25353;&#38062;&#65292;&#20808;&#23454;&#29616;&#26356;&#25913;&#40664;&#35748;&#30340;&#39068;&#33394;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/DNKaf.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#20999;&#25442;&#21040;XAML&#27169;&#24335;&#65292;&#39039;&#26102;&#23601;&#20250;&#20986;&#29616;&#24456;&#22810;&#30340;&#20195;&#30721;&#65288;&#22914;&#22270;&#65289;&#65292;&#19981;&#36807;&#24494;&#36719;&#36824;&#26159;&#27604;&#36739;&#20183;&#20041;&#30340;&#65292;&#21047;&#23376;&#12289;&#23646;&#24615;&#30340;&#21517;&#31216;&#37117;&#26159;&#29992;&#30340;&#27604;&#36739;&#36890;&#20439;&#30340;&#33521;&#35821;&#8230;&#8230;&#27809;&#26377;&#20160;&#20040;mov&#21834;pop&#21834;push&#21834;&#20160;&#20040;&#30340;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/4YnYm.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#65292;&#20808;&#20462;&#25913;ButtonNormalBackground&#36825;&#20010;LinearGradientBrush&#65288;&#32447;&#24615;&#28176;&#21464;&#21047;&#23376;&#65292;&#26356;&#22810;&#20449;&#24687;&#21442;&#32771;MSDN&#65292;&#20256;&#36865;&#38376;&#65289;&#65292;&#25226;Windows7/Vista&#33258;&#24102;&#30340;&#37027;&#31181;&#28784;&#40657;&#28176;&#21464;&#30340;&#25353;&#38062;&#25913;&#25104;&#30333;&#28784;&#28176;&#21464;&#12290;&lt;/p&gt;
&lt;p&gt;&#31995;&#32479;&#33258;&#21160;&#29983;&#25104;&#30340;&#20195;&#30721;&#26159;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;LinearGradientBrush x:Key="ButtonNormalBackground" EndPoint="0,1" StartPoint="0,0"&amp;gt;
  &amp;lt;GradientStop Color="#F3F3F3" Offset="0"/&amp;gt;
  &amp;lt;GradientStop Color="#EBEBEB" Offset="0.5"/&amp;gt;
  &amp;lt;GradientStop Color="#DDDDDD" Offset="0.5"/&amp;gt;
  &amp;lt;GradientStop Color="#CDCDCD" Offset="1"/&amp;gt;
&amp;lt;/LinearGradientBrush&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#23558;&#20182;&#20462;&#25913;&#25104;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;LinearGradientBrush x:Key="ButtonNormalBackground" EndPoint="0,1" StartPoint="0,0"&amp;gt;
   &amp;lt;GradientStop Color="#fefefe" Offset="0"/&amp;gt; &amp;lt;!--&#38750;&#40736;&#26631;Hover&#30340;&#32972;&#26223;&#39068;&#33394;--&amp;gt;
   &amp;lt;GradientStop Color="#fefefe" Offset="0.5"/&amp;gt;
   &amp;lt;GradientStop Color="#efefef" Offset="0.5"/&amp;gt;
   &amp;lt;GradientStop Color="#efefef" Offset="1"/&amp;gt;
&amp;lt;/LinearGradientBrush&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#65288;&#24403;&#28982;&#22914;&#26524;&#26377;&#33258;&#24049;&#21916;&#27426;&#30340;&#39068;&#33394;&#20063;&#21487;&#20197;&#26356;&#25913;&#19978;&#21435;&#65292;&#25110;&#32773;&#20063;&#21487;&#20197;&#22810;&#21152;&#20960;&#20010;&#39068;&#33394;&#28176;&#21464;&#65292;Color&#26159;&#39068;&#33394;&#65292;Offset&#26159;&#20301;&#32622;&#65289;&lt;/p&gt;
&lt;p&gt;&#21040;&#36825;&#37324;&#21487;&#20197;F5&#36816;&#34892;&#19968;&#19979;&#65292;&#38750;&#40736;&#26631;Hover&#30340;&#26102;&#20505;&#65292;&#23601;&#24050;&#32463;&#29983;&#25928;&#20102;&#65281;&lt;/p&gt;
&lt;p&gt;&#31532;&#20116;&#27493;&#65292;&#20462;&#25913;&#40736;&#26631;Hover&#26102;&#20505;&#30340;&#39068;&#33394;&#20197;&#21450;&#28176;&#21464;&#25928;&#26524;&lt;/p&gt;
&lt;p&gt;&#36825;&#26102;&#20505;&#21457;&#29616;&#19979;&#38754;&#30340;&#20195;&#30721;&#19981;&#32473;&#21147;&#20102;&#65292;&#24494;&#36719;&#27809;&#26377;Hover&#21834;&#20160;&#20040;&#30340;&#36825;&#26679;&#30340;&#25935;&#24863;&#20851;&#38190;&#35789;&#22312;&#37324;&#38754;&#65292;&#21482;&#33021;&#33258;&#24049;&#21407;&#21019;&#20102;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#22312;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Style x:Key="ButtonStyle" TargetType="{x:Type Button}"&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#37324;&#38754;&#28155;&#21152;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Style.Resources&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#20877;&#28155;&#21152;&#20004;&#20010;Storyboard&#65292;&#29992;&#26469;&#26174;&#31034;&#28176;&#21464;&#25928;&#26524;&#65288;&#36825;&#31181;&#26102;&#20505;&#36824;&#26159;&#25970;&#20195;&#30721;&#26368;&#22909;&#65292;&#19981;&#25512;&#33616;&#29992;&#20160;&#20040;&#21487;&#35270;&#21270;&#35774;&#35745;&#22120;&#65289;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/b6K9I.png" /&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Style.Resources&amp;gt;
  &amp;lt;Storyboard x:Key="ButtonHover"&amp;gt;
    &amp;lt;DoubleAnimationUsingKeyFrames BeginTime="00:00:00" Storyboard.TargetProperty="(UIElement.BitmapEffect).(OuterGlowBitmapEffect.GlowSize)"&amp;gt;
    &amp;lt;SplineDoubleKeyFrame KeyTime="00:00:00.2000000" Value="5" /&amp;gt;
    &amp;lt;/DoubleAnimationUsingKeyFrames&amp;gt;
  &amp;lt;/Storyboard&amp;gt;
  &amp;lt;Storyboard x:Key="ButtonWithoutHover"&amp;gt;
    &amp;lt;DoubleAnimationUsingKeyFrames BeginTime="00:00:00" Storyboard.TargetProperty="(UIElement.BitmapEffect).(OuterGlowBitmapEffect.GlowSize)"&amp;gt;
    &amp;lt;SplineDoubleKeyFrame KeyTime="00:00:00.1000000" Value="0" /&amp;gt;
    &amp;lt;/DoubleAnimationUsingKeyFrames&amp;gt;
  &amp;lt;/Storyboard&amp;gt;
&amp;lt;/Style.Resources&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#20851;&#20110;&#19978;&#38754;&#30340;&#20195;&#30721;&#30340;&#20316;&#29992;&#65292;&#22823;&#23478;&#21487;&#20197;&#23545;&#29031;MSDN&#29702;&#35299;&#19968;&#19979;&#65292;&lt;a href="http://www.microsoft.com/china/MSDN/library/windev/longhorn/storyboardstory.mspx?mfr=true"&gt;http://www.microsoft.com/china/MSDN/library/windev/longhorn/storyboardstory.mspx?mfr=true&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#28982;&#21518;&#25105;&#20204;&#22312;&#19979;&#38754;&#28155;&#21152;&#20004;&#20010;&#35302;&#21457;&#22120;&#65288;Style.Triggers&#65289;&#65292;&#31532;&#19968;&#20010;&#35302;&#21457;&#22120;&#21516;&#26102;&#23454;&#29616;&#20004;&#20010;&#21151;&#33021;&#65306;&#21551;&#21160;Storyboard&#65292;&#20462;&#25913;&#25353;&#38062;&#39068;&#33394;&#65307;&#31532;&#20108;&#20010;&#35302;&#21457;&#22120;&#32465;&#23450;&#30340;&#26159;IsPressed&#20107;&#20214;&#65292;&#35753;&#25353;&#38062;&#25353;&#20303;&#30340;&#26102;&#20505;&#20462;&#25913;&#32972;&#26223;&#39068;&#33394;&#20026;&#28784;&#33394;&#65292;&#36825;&#26679;&#23601;&#26377;&#25353;&#19979;&#30340;&#24863;&#35273;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/a3nO9.png" /&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;    &amp;lt;Style.Triggers&amp;gt;
    &amp;lt;Trigger Property="IsMouseOver" Value="True"&amp;gt;
     &amp;lt;Trigger.ExitActions&amp;gt;
    &amp;lt;BeginStoryboard x:Name="ButtonWithoutHover_BeginStoryboard" Storyboard="{StaticResource ButtonWithoutHover}"/&amp;gt;
     &amp;lt;/Trigger.ExitActions&amp;gt;
     &amp;lt;Trigger.EnterActions&amp;gt;
    &amp;lt;BeginStoryboard Storyboard="{StaticResource ButtonHover}"/&amp;gt;
     &amp;lt;/Trigger.EnterActions&amp;gt;
     &amp;lt;Setter Property="Background"&amp;gt;
    &amp;lt;Setter.Value&amp;gt;
     &amp;lt;LinearGradientBrush EndPoint="0,1" StartPoint="0,0"&amp;gt;
             &amp;lt;GradientStop Color="White" Offset="0"/&amp;gt; &amp;lt;!--&#40736;&#26631;Hover&#30340;&#32972;&#26223;&#39068;&#33394;--&amp;gt;
             &amp;lt;GradientStop Color="#fbfcfe" Offset="0.5"/&amp;gt;
             &amp;lt;GradientStop Color="#d4e8fe" Offset="0.5"/&amp;gt;
             &amp;lt;GradientStop Color="#fbfcfe" Offset="1"/&amp;gt;
           &amp;lt;/LinearGradientBrush&amp;gt;
    &amp;lt;/Setter.Value&amp;gt;
     &amp;lt;/Setter&amp;gt;
     &amp;lt;Setter Property="Foreground" Value="#FF34AFF6"/&amp;gt;
       &amp;lt;/Trigger&amp;gt;
       &amp;lt;Trigger Property="IsPressed" Value="True"&amp;gt;
        &amp;lt;Trigger.ExitActions&amp;gt;
       &amp;lt;StopStoryboard BeginStoryboardName="ButtonWithoutHover_BeginStoryboard"/&amp;gt;
        &amp;lt;/Trigger.ExitActions&amp;gt;
        &amp;lt;Trigger.EnterActions&amp;gt;
       &amp;lt;BeginStoryboard x:Name="ButtonWithoutHover_BeginStoryboard1" Storyboard="{StaticResource ButtonWithoutHover}"/&amp;gt;
        &amp;lt;/Trigger.EnterActions&amp;gt;
         &amp;lt;Setter Property="Background" Value="#eaeaea" /&amp;gt;
         &amp;lt;Setter Property="Foreground" Value="Gray"/&amp;gt;
       &amp;lt;/Trigger&amp;gt;
       &amp;lt;/Style.Triggers&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#20877;&#22238;&#22836;&#30475;&#30475;&#20004;&#20010;Storyboard&#65292;&#20462;&#25913;&#20102;&#25353;&#38062;&#30340;OuterGlowBitmapEffect&#65288;&#22806;&#21457;&#20809;&#65289;&#29305;&#24615;&#65292;&#27880;&#24847;&#26159;&#20462;&#25913;&#65292;&#25152;&#20197;&#22914;&#26524;&#21407;&#26469;&#19981;&#23384;&#22312;&#36825;&#20010;&#23646;&#24615;&#30340;&#35805;&#65292;&#20250;&#20986;&#38169;&#65292;&#25152;&#20197;&#20877;&#22312;Triggers&#21518;&#38754;&#28155;&#21152;&#19968;&#20010;Setter&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/0VIsb.png" /&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Setter Property="BitmapEffect"&amp;gt;
  &amp;lt;Setter.Value&amp;gt;
    &amp;lt;OuterGlowBitmapEffect GlowColor="#9ecaf4" GlowSize="0" /&amp;gt;
  &amp;lt;/Setter.Value&amp;gt;
&amp;lt;/Setter&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#26102;&#20505;&#21487;&#20197;&#25353;&#19979;F5&#36816;&#34892;&#19968;&#19979;&#30475;&#19968;&#19979;&#25928;&#26524;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#31532;&#20845;&#27493;&#65292;&#20462;&#22797;BUG&lt;/p&gt;
&lt;p&gt;&#36825;&#26102;&#22823;&#23478;&#20250;&#21457;&#29616;&#65292;&#36763;&#33510;&#33258;&#24049;&#20889;&#30340;&#22806;&#21457;&#20809;&#12289;&#28176;&#21464;&#12289;&#32972;&#26223;&#20462;&#25913;&#31561;&#29305;&#25928;&#20840;&#37096;&#21448;&#34987;Windows&#33258;&#24102;&#30340;&#25928;&#26524;&#32473;&#35206;&#30422;&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#20854;&#23454;&#27491;&#26159;&#22240;&#20026;&#25105;&#20204;&#20043;&#21069;&#36873;&#25321;&#32534;&#36753;&#26679;&#24335;&#30340;&#26102;&#20505;&#36873;&#25321;&#20102;&#32534;&#36753;&#21103;&#26412;&#65292;&#24494;&#36719;&#33258;&#21160;&#25226;&#40664;&#35748;&#30340;&#25353;&#38062;&#26679;&#24335;&#32473;Copy&#36827;&#26469;&#20102;&#65292;&#26041;&#20415;&#36827;&#19968;&#27493;&#20462;&#25913;&#65292;&#25152;&#20197;&#26032;&#24314;&#26679;&#24335;&#30340;&#21516;&#26102;&#20063;&#38656;&#35201;&#21024;&#38500;&#25481;&#19981;&#38656;&#35201;&#30340;&#26679;&#24335;&#12290;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#23558;&lt;Setter Property="Template"&gt;&#20013;&#30340;&lt;ControlTemplate.Triggers&gt;&#21024;&#25481;&#65292;&#21024;&#25481;&#40664;&#35748;&#30340;&#35302;&#21457;&#22120;&#12290;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/LgBpr.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#20877;&#23558;Microsoft_Windows_Themes:ButtonChrome&#37324;&#30340;RenderMouseOver="{TemplateBinding IsMouseOver}" RenderPressed="{TemplateBinding IsPressed}" RenderDefaulted="{TemplateBinding IsDefaulted}"&#36825;&#37096;&#20998;&#21024;&#25481;&#21363;&#21487;&#12290;&lt;/p&gt;
&lt;p&gt;&#27492;&#26102;&#25972;&#20010;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Setter Property="Template"&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#30340;&#20195;&#30721;&#20026;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;&amp;lt;Setter Property="Template"&amp;gt;
 &amp;lt;Setter.Value&amp;gt;
  &amp;lt;ControlTemplate TargetType="{x:Type Button}"&amp;gt;
   &amp;lt;Microsoft_Windows_Themes:ButtonChrome x:Name="Chrome" BorderBrush="{TemplateBinding BorderBrush}" Background="{TemplateBinding Background}"  SnapsToDevicePixels="true"&amp;gt;
    &amp;lt;ContentPresenter HorizontalAlignment="{TemplateBinding HorizontalContentAlignment}" Margin="{TemplateBinding Padding}" RecognizesAccessKey="True" SnapsToDevicePixels="{TemplateBinding SnapsToDevicePixels}" VerticalAlignment="{TemplateBinding VerticalContentAlignment}"/&amp;gt;
   &amp;lt;/Microsoft_Windows_Themes:ButtonChrome&amp;gt;
  &amp;lt;/ControlTemplate&amp;gt;
 &amp;lt;/Setter.Value&amp;gt;
&amp;lt;/Setter&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#23436;&#25104;&#65281;&lt;/p&gt;
&lt;p&gt;&#36825;&#26679;&#25105;&#20204;&#23601;&#23454;&#29616;&#20102;&#19968;&#20010;&#27604;&#36739;&#28418;&#20142;&#30340;&#25353;&#38062;&#30340;&#26679;&#24335;&#65292;F5&#36816;&#34892;&#19968;&#19979;&#65292;&#24050;&#32463;&#27809;&#26377;BUG&#20102;&#12290;&lt;/p&gt;
&lt;p&gt;&#25193;&#23637;&#65292;&#23558;&#24050;&#26377;&#30340;&#26679;&#24335;&#24212;&#29992;&#21040;&#26032;&#28155;&#21152;&#30340;&#25353;&#38062;&#20013;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#38656;&#35201;&#25226;&#26032;&#24314;&#25353;&#38062;&#21516;&#26102;&#24212;&#29992;&#36825;&#20010;&#26679;&#24335;&#30340;&#35805;&#65292;&#24456;&#31616;&#21333;&#65292;&#21482;&#38656;&#35201;&#35774;&#32622;Button&#30340;Style="{DynamicResource ButtonStyle}"&lt;/p&gt;
&lt;p&gt;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="image" src="http://i.imgur.com/zO3z0.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#33267;&#27492;&#23601;&#20840;&#37096;&#23436;&#25104;&#20102;&#65292;&#27809;&#25163;&#24037;&#20889;API&#65292;&#19981;&#29992;&#33258;&#24049;&#25630;&#31070;&#39532;HDC&#65292;&#36830;Photoshop&#20063;&#27809;&#24320;&#65292;&#25970;&#20195;&#30721;&#23601;&#21487;&#20197;&#23454;&#29616;&#38750;&#24120;&#28418;&#20142;&#30340;&#25353;&#38062;&#26679;&#24335;&#12290;&lt;/p&gt;
&lt;p&gt;&#38468;&#24405;   &#23436;&#24037;&#21518;&#30340;XAML&#25353;&#38062;&#26679;&#24335;&#37096;&#20998;&#20195;&#30721;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;    &amp;lt;Style x:Key="ButtonFocusVisual"&amp;gt;
        &amp;lt;Setter Property="Control.Template"&amp;gt;
            &amp;lt;Setter.Value&amp;gt;
                &amp;lt;ControlTemplate&amp;gt;
                    &amp;lt;Rectangle Stroke="Black" StrokeDashArray="1 2" StrokeThickness="1" Margin="2" SnapsToDevicePixels="true"/&amp;gt;
                &amp;lt;/ControlTemplate&amp;gt;
            &amp;lt;/Setter.Value&amp;gt;
        &amp;lt;/Setter&amp;gt;
    &amp;lt;/Style&amp;gt;
    &amp;lt;LinearGradientBrush x:Key="ButtonNormalBackground" EndPoint="0,1" StartPoint="0,0"&amp;gt;
        &amp;lt;GradientStop Color="#fefefe" Offset="0"/&amp;gt; &amp;lt;!--&#38750;&#40736;&#26631;Hover&#30340;&#32972;&#26223;&#39068;&#33394;--&amp;gt;
        &amp;lt;GradientStop Color="#fefefe" Offset="0.5"/&amp;gt;
        &amp;lt;GradientStop Color="#efefef" Offset="0.5"/&amp;gt;
        &amp;lt;GradientStop Color="#efefef" Offset="1"/&amp;gt;
    &amp;lt;/LinearGradientBrush&amp;gt;
    &amp;lt;SolidColorBrush x:Key="ButtonNormalBorder" Color="#FF707070"/&amp;gt;
    &amp;lt;Style x:Key="ButtonStyle" TargetType="{x:Type Button}"&amp;gt;
        &amp;lt;Style.Resources&amp;gt;
            &amp;lt;Storyboard x:Key="ButtonHover"&amp;gt;
                &amp;lt;DoubleAnimationUsingKeyFrames BeginTime="00:00:00" Storyboard.TargetProperty="(UIElement.BitmapEffect).(OuterGlowBitmapEffect.GlowSize)"&amp;gt;
                    &amp;lt;SplineDoubleKeyFrame KeyTime="00:00:00.2000000" Value="5" /&amp;gt;
                &amp;lt;/DoubleAnimationUsingKeyFrames&amp;gt;
            &amp;lt;/Storyboard&amp;gt;

            &amp;lt;Storyboard x:Key="ButtonWithoutHover"&amp;gt;
                &amp;lt;DoubleAnimationUsingKeyFrames BeginTime="00:00:00" Storyboard.TargetProperty="(UIElement.BitmapEffect).(OuterGlowBitmapEffect.GlowSize)"&amp;gt;
                    &amp;lt;SplineDoubleKeyFrame KeyTime="00:00:00.1000000" Value="0" /&amp;gt;
                &amp;lt;/DoubleAnimationUsingKeyFrames&amp;gt;
            &amp;lt;/Storyboard&amp;gt;
        &amp;lt;/Style.Resources&amp;gt;
        &amp;lt;Style.Triggers&amp;gt;
            &amp;lt;Trigger Property="IsMouseOver" Value="True"&amp;gt;
                &amp;lt;Trigger.ExitActions&amp;gt;
                    &amp;lt;BeginStoryboard x:Name="ButtonWithoutHover_BeginStoryboard" Storyboard="{StaticResource ButtonWithoutHover}"/&amp;gt;
                &amp;lt;/Trigger.ExitActions&amp;gt;
                &amp;lt;Trigger.EnterActions&amp;gt;
                    &amp;lt;BeginStoryboard Storyboard="{StaticResource ButtonHover}"/&amp;gt;
                &amp;lt;/Trigger.EnterActions&amp;gt;
                &amp;lt;Setter Property="Background"&amp;gt;
                    &amp;lt;Setter.Value&amp;gt;
                        &amp;lt;LinearGradientBrush EndPoint="0,1" StartPoint="0,0"&amp;gt;
                            &amp;lt;GradientStop Color="White" Offset="0"/&amp;gt; &amp;lt;!--&#40736;&#26631;Hover&#30340;&#32972;&#26223;&#39068;&#33394;--&amp;gt;
                            &amp;lt;GradientStop Color="#fbfcfe" Offset="0.5"/&amp;gt;
                            &amp;lt;GradientStop Color="#d4e8fe" Offset="0.5"/&amp;gt;
                            &amp;lt;GradientStop Color="#fbfcfe" Offset="1"/&amp;gt;
                        &amp;lt;/LinearGradientBrush&amp;gt;
                    &amp;lt;/Setter.Value&amp;gt;
                &amp;lt;/Setter&amp;gt;
                &amp;lt;Setter Property="Foreground" Value="#FF34AFF6"/&amp;gt;
            &amp;lt;/Trigger&amp;gt;
            &amp;lt;Trigger Property="IsPressed" Value="True"&amp;gt;
                &amp;lt;Trigger.ExitActions&amp;gt;
                    &amp;lt;StopStoryboard BeginStoryboardName="ButtonWithoutHover_BeginStoryboard"/&amp;gt;
                &amp;lt;/Trigger.ExitActions&amp;gt;
                &amp;lt;Trigger.EnterActions&amp;gt;
                    &amp;lt;BeginStoryboard x:Name="ButtonWithoutHover_BeginStoryboard1" Storyboard="{StaticResource ButtonWithoutHover}"/&amp;gt;
                &amp;lt;/Trigger.EnterActions&amp;gt;
                &amp;lt;Setter Property="Background" Value="#eaeaea" /&amp;gt;
                &amp;lt;Setter Property="Foreground" Value="Gray"/&amp;gt;
            &amp;lt;/Trigger&amp;gt;
        &amp;lt;/Style.Triggers&amp;gt;
        &amp;lt;Setter Property="BitmapEffect"&amp;gt;
            &amp;lt;Setter.Value&amp;gt;
                &amp;lt;OuterGlowBitmapEffect GlowColor="#9ecaf4" GlowSize="0" /&amp;gt;
            &amp;lt;/Setter.Value&amp;gt;
        &amp;lt;/Setter&amp;gt;
        &amp;lt;Setter Property="FocusVisualStyle" Value="{StaticResource ButtonFocusVisual}"/&amp;gt;
        &amp;lt;Setter Property="Background" Value="{StaticResource ButtonNormalBackground}"/&amp;gt;
        &amp;lt;Setter Property="BorderBrush" Value="{StaticResource ButtonNormalBorder}"/&amp;gt;
        &amp;lt;Setter Property="BorderThickness" Value="1"/&amp;gt;
        &amp;lt;Setter Property="Foreground" Value="{DynamicResource {x:Static SystemColors.ControlTextBrushKey}}"/&amp;gt;
        &amp;lt;Setter Property="FontFamily" Value="&#24494;&#36719;&#38597;&#40657;" /&amp;gt;
        &amp;lt;Setter Property="HorizontalContentAlignment" Value="Center"/&amp;gt;
        &amp;lt;Setter Property="VerticalContentAlignment" Value="Center"/&amp;gt;
        &amp;lt;Setter Property="Padding" Value="1"/&amp;gt;
        &amp;lt;Setter Property="Template"&amp;gt;
            &amp;lt;Setter.Value&amp;gt;
                &amp;lt;ControlTemplate TargetType="{x:Type Button}"&amp;gt;
                    &amp;lt;Microsoft_Windows_Themes:ButtonChrome x:Name="Chrome" SnapsToDevicePixels="true" Background="{TemplateBinding Background}" BorderBrush="{TemplateBinding BorderBrush}" &amp;gt;
                        &amp;lt;ContentPresenter HorizontalAlignment="{TemplateBinding HorizontalContentAlignment}" Margin="{TemplateBinding Padding}" VerticalAlignment="{TemplateBinding VerticalContentAlignment}" SnapsToDevicePixels="{TemplateBinding SnapsToDevicePixels}" RecognizesAccessKey="True"/&amp;gt;
                    &amp;lt;/Microsoft_Windows_Themes:ButtonChrome&amp;gt;
                &amp;lt;/ControlTemplate&amp;gt;
            &amp;lt;/Setter.Value&amp;gt;
        &amp;lt;/Setter&amp;gt;
    &amp;lt;/Style&amp;gt;
&lt;/code&gt;&lt;/pre&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-02-17-wpf-button</guid><pubDate>Thu, 17 Feb 2011 22:50:00 GMT</pubDate></item><item><title>WPF&#20223;&#36805;&#38647;7&#31616;&#26131;&#25991;&#26412;&#26694;&#28966;&#28857;&#31227;&#21160;&#29305;&#25928;</title><link>http://blog.4321.la/article/2011-02-11-thunder7skin</link><description>&lt;p&gt;&lt;img alt="Thunder7" src="http://i.imgur.com/QLV64.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#23454;&#29616;&#21407;&#29702;&#65306;&lt;/p&gt;
&lt;p&gt;&#22312;&#20027;&#31383;&#20307;&#19978;&#32472;&#21046;&#19968;&#20010;Border&#65292;&#28982;&#21518;&#27599;&#27425;&#25991;&#26412;&#26694;&#33719;&#24471;&#25110;&#32773;&#22833;&#21435;&#28966;&#28857;&#30340;&#26102;&#20505;&#21551;&#21160;&#19968;&#20010;StoryBoard&#26469;&#31227;&#21160;Border&#12290;
&lt;!-- more --&gt;&lt;/p&gt;
&lt;p&gt;&#28304;&#20195;&#30721;&#19979;&#36733;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://down.4321.la/Thunder7Textbox.rar"&gt;http://down.4321.la/Thunder7Textbox.rar&lt;/a&gt;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-02-11-thunder7skin</guid><pubDate>Fri, 11 Feb 2011 22:45:00 GMT</pubDate></item><item><title>&#34507;&#30140;&#30340;&#24320;&#21457;&#20102;&#19968;&#20010;PurePlayer&#38899;&#20048;&#25773;&#25918;&#22120;</title><link>http://blog.4321.la/article/2011-02-11-pureplayer</link><description>&lt;p&gt;&lt;img alt="PurePlayer" src="http://i.imgur.com/TVlzw.png" /&gt;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#22914;&#22270;&#25152;&#31034;&#65292;&#22522;&#20110;&#22522;&#20110;Win32&#25511;&#21046;&#21488;&#65292;&#22522;&#26412;&#23454;&#29616;&#20102;LRC&#27468;&#35789;&#31561;&#21151;&#33021;&#65292;&#24403;&#28982;&#20102;&#65292;&#19981;&#20934;&#22791;&#21457;&#24067;&#20986;&#26469;&#65292;&#33258;&#24049;&#29992;&#29992;&#23601;&#21487;&#20197;&#20102;&lt;/p&gt;
&lt;p&gt;&#20934;&#22791;&#23558;&#27468;&#35789;&#37096;&#20998;&#25972;&#29702;&#20986;&#26469;&#65292;&#23558;&#24605;&#36335;&#20889;&#19979;&#26469;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-02-11-pureplayer</guid><pubDate>Fri, 11 Feb 2011 22:48:00 GMT</pubDate></item><item><title>[Delphi]Lrc&#27468;&#35789;&#27169;&#22359;&#23454;&#29616; Part1&#8212;&#8212;&#26684;&#24335;&#21270;Lrc&#27468;&#35789;&#25991;&#20214;</title><link>http://blog.4321.la/article/2011-02-11-delphi-lrc-one</link><description>&lt;p&gt;&#26368;&#36817;&#38386;&#26469;&#26080;&#20107;&#65292;&#20110;&#26159;&#20934;&#22791;&#24320;&#21457;&#36866;&#21512;&#19968;&#27454;&#25773;&#25918;&#22120;&#65292;&#24517;&#19981;&#21487;&#23569;&#30340;&#23601;&#26159;Lrc&#27468;&#35789;&#26174;&#31034;&#37096;&#20998;&lt;/p&gt;
&lt;p&gt;&#20174;&#32593;&#19978;&#25214;&#20102;&#19968;&#20123;&#29616;&#25104;&#30340;&#31639;&#27861;&#65292;&#19981;&#26159;&#20570;&#24471;&#24456;&#25619;&#65292;&#23601;&#26159;&#20570;&#24471;&#22826;&#38712;&#27668;&#65292;&#19968;&#28857;&#37117;&#30475;&#19981;&#25026;&#65292;&#20110;&#26159;&#33258;&#24049;&#24819;&#20102;&#19968;&#20010;&#24605;&#36335;&#12290;&lt;/p&gt;
&lt;p&gt;1&#12289;&#25353;&#34892;&#35835;&#21462;LRC&#27468;&#35789;&#65292;&#20998;&#26512;&#27599;&#19968;&#34892;&#30340;&#26631;&#31614; procedure Anylize(s:string)
2&#12289;&#23558;&#25152;&#26377;&#26631;&#31614;&#25972;&#29702;&#20986;&#26469;&#65292;&#27468;&#35789;&#30340;&#26102;&#38388;&#26631;&#31614;&#25442;&#31639;&#25104;Longint (ToTime)&#65292;&#23384;&#21040;&#19968;&#20010;&#21160;&#24577;&#25968;&#32452;&#20013;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;Lyric=record
    Time:Longint; //&#26102;&#38388;
    Content:string; //&#20869;&#23481;
    Line:Integer; //&#31532;&#20960;&#34892;&#65292;&#20026;&#20197;&#21518;&#30340;GDI+&#28378;&#21160;&#26174;&#31034;&#20570;&#20934;&#22791;
end;
var
    Lrc:array of Lyric;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;3&#12289;&#36827;&#34892;&#24555;&#36895;&#25490;&#24207;&#65292;&#25353;&#29031;Time&#21319;&#24207;&#25490;&#24207;&#12290;&lt;/p&gt;
&lt;p&gt;4&#12289;&#25773;&#25918;&#26102;&#19981;&#20572;&#36827;&#34892;&#20108;&#20998;&#26597;&#25214;&#65292;&#23558;&#26597;&#25214;&#20986;&#26469;&#30340;&#32467;&#26524;&#26174;&#31034;&#21363;&#21487;&#12290;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#26681;&#25454;&#36825;&#20010;&#24605;&#36335;&#65292;&#25105;&#20204;&#26469;&#32534;&#20889;&#20195;&#30721;&lt;/p&gt;
&lt;p&gt;&#39318;&#20808;&#26469;&#30475;&#19968;&#27573;LRC&#27468;&#35789;&#65292;&#20102;&#35299;&#19968;&#19979;LRC&#27468;&#35789;&#30340;&#32467;&#26500;&#65306;
[ti:Crawling]&lt;/p&gt;
&lt;p&gt;[ar:Linkin Park]&lt;/p&gt;
&lt;p&gt;[al:Hybrid Theory]&lt;/p&gt;
&lt;p&gt;[00:00.00]Linkin Park &#8211; Crawling&lt;/p&gt;
&lt;p&gt;[00:11.50]&lt;/p&gt;
&lt;p&gt;[02:23.74][01:26.89][00:23.40]Crawling in my skin&lt;/p&gt;
&lt;p&gt;[02:28.11][01:31.31][00:27.74]These wounds they will not heal&lt;/p&gt;
&lt;p&gt;[02:32.58][01:35.70][00:32.35]Fear is how I fall&lt;/p&gt;
&lt;p&gt;[02:37.11][01:40.27][00:36.60]Confusing what is real&lt;/p&gt;
&lt;p&gt;[00:41.90]&lt;/p&gt;
&lt;p&gt;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&lt;/p&gt;
&lt;p&gt;[03:00.99]There&#8217;s something inside me that pulls beneath the surface&lt;/p&gt;
&lt;p&gt;[03:05.49]Consuming, confusing what is real&lt;/p&gt;
&lt;p&gt;[03:09.78]This lack of self control I fear is never ending&lt;/p&gt;
&lt;p&gt;[03:14.42]Controlling, confusing what is real&lt;/p&gt;
&lt;p&gt;[03:22.93][03:21.08]&lt;/p&gt;
&lt;p&gt;[03:26.09]&lt;strong&gt;&lt;em&gt;*END&lt;/em&gt;&lt;/strong&gt;*&lt;/p&gt;
&lt;p&gt;&#19978;&#38754;&#30340;[ti:Crawling]&#31561;&#31561;&#26159;&#26631;&#35782;&#26631;&#31614;(ID-Tags)&#65292;&#29992;&#26469;&#26631;&#31034;&#33402;&#20154;&#21517;&#12289;&#27468;&#26354;&#21517;&#12289;&#19987;&#36753;&#21517;&#12289;LRC&#32534;&#32773;&#12289;&#26102;&#38388;&#34917;&#20607;&#31561;&#65292;&#23545;&#25105;&#20204;&#26469;&#35828;&#26368;&#26377;&#29992;&#30340;&#26159;&#26102;&#38388;&#34917;&#20607;&#65292;&#22788;&#29702;&#20063;&#30456;&#23545;&#31616;&#21333;&#65292;&#19981;&#36807;&#32463;&#36807;&#25105;&#30340;&#27979;&#35797;&#36825;&#20010;&#19996;&#35199;&#23454;&#38469;&#24212;&#29992;&#36215;&#26469;&#19981;&#26159;&#24456;&#22810;&#65292;&#23588;&#20854;&#26159;&#20174;&#32593;&#19978;&#19979;&#36733;&#30340;&#27468;&#35789;&#65292;&#25152;&#20197;&#26242;&#26102;&#19981;&#32771;&#34385;&#65292;&#26377;&#20852;&#36259;&#30340;&#26379;&#21451;&#21487;&#20197;&#22312;&#31639;&#27861;&#19978;&#21152;&#19978;&#36825;&#20010;&#26102;&#38388;&#34917;&#20607;&#30340;&#22788;&#29702;&#12290;&lt;/p&gt;
&lt;p&gt;&#24418;&#24335;&#20026;"[mm:ss.ff]"&#25110;"[mm:ss.fff]"&#30340;&#26631;&#31614;&#20026;&#26102;&#38388;&#26631;&#31614;(Time-Tags)&#65292;&#25968;&#23383;&#37117;&#26159;&#38750;&#36127;&#25972;&#25968;&#65292;&#24418;&#24335;&#20063;&#24456;&#31616;&#21333;&#65292;&#20294;&#26159;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#21518;&#38754;&#27627;&#31186;&#30340;&#20301;&#25968;&#65292;&#22914;&#26524;&#26159;&#23567;&#20110;&#19977;&#20301;&#30340;&#35805;&#38656;&#35201;&#20174;&#21518;&#38754;&#34917;&#38646;&#12290;&lt;/p&gt;
&lt;p&gt;&#20934;&#22791;&#24037;&#20316;&#23436;&#27605;&#65292;&#24320;&#24037;&#65281;&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&lt;/p&gt;
&lt;p&gt;&#35835;&#20837;Lrc&#27468;&#35789;&#25991;&#20214;&#12290;&lt;/p&gt;
&lt;p&gt;&#36825;&#20010;&#27627;&#26080;&#25216;&#26415;&#21547;&#37327;&#65292;&#19982;&#26222;&#36890;&#25991;&#26412;&#25991;&#20214;&#35835;&#21462;&#26041;&#24335;&#19968;&#26679;&#65292;&#25918;&#21040;String&#37324;&#21363;&#21487;&#12290;&lt;/p&gt;
&lt;p&gt;&#25105;&#20351;&#29992;&#30340;&#26159;TFileStream&#31867;&#35835;&#20837;&#30340;&#25991;&#20214;&#65292;&#19981;&#20877;&#36184;&#36848;&#65292;&#22823;&#23478;&#21487;&#20197;&#30452;&#25509;&#35895;&#27468;&#25628;&#32034;delphi&#35835;&#21462;&#25991;&#26412;&#25991;&#20214;&#30340;&#20363;&#23376;&#23601;&#21487;&#20197;&#12290;&lt;/p&gt;
&lt;p&gt;&#31532;&#20108;&#27493;&#65306;&lt;/p&gt;
&lt;p&gt;&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#65292;&#27599;&#34892;&#27599;&#34892;&#30340;&#20998;&#26512;Lrc&#25991;&#20214;&#12290;&lt;/p&gt;
&lt;p&gt;&#21442;&#32771;&#27491;&#21017;&#34920;&#36798;&#24335;&#30340;&#25163;&#20876;&#65288;- &#8211; &#27599;&#27425;&#20889;&#27491;&#21017;&#24517;&#39035;&#30475;&#65292;&#37027;&#35821;&#27861;&#31616;&#30452;&#8230;&#8230;&#65289;&#65292;&#20889;&#20102;&#19968;&#20010;&#27491;&#21017;&#34920;&#36798;&#24335;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;^((\[\d+:\d+\.\d+\])+)(.*?)$
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#20010;&#27491;&#21017;&#34920;&#36798;&#24335;&#33021;&#22815;&#19968;&#34892;&#19968;&#34892;&#65288;preMultiLine&#65289;&#30340;&#65288;^$&#65289;&#30340;&#21305;&#37197;&#21547;&#26377;&#26102;&#38388;&#26631;&#31614;&#30340;Lrc&#27468;&#35789;&#65292;&#21516;&#26102;&#23558;&#27491;&#21017;&#21305;&#37197;&#32467;&#26524;&#30340;&#20998;&#32452;[1]&#21644;&#20998;&#32452;[3]&#21363;&#26102;&#26102;&#38388;&#26631;&#31614;&#30340;&#20869;&#23481;&#21644;&#24403;&#21069;&#34892;&#30340;&#27468;&#35789;&#20869;&#23481;&#25552;&#21462;&#20986;&#26469;&#65292;&#38750;&#24120;&#26041;&#20415;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#27599;&#34892;&#27468;&#35789;&#20013;&#21487;&#33021;&#21547;&#26377;&#22810;&#20010;&#26102;&#38388;&#26631;&#31614;&#65292;&#22312;&#27491;&#21017;&#20013;&#20351;&#29992;+&#38480;&#23450;&#31526;&#21363;&#21487;&#27491;&#24120;&#21305;&#37197;&#12290;&lt;/p&gt;
&lt;p&gt;&#23454;&#29616;&#20195;&#30721;&#22914;&#19979;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;procedure Anylize(s:string); //&#36890;&#36807;&#27491;&#21017;&#34920;&#36798;&#24335;&#35299;&#26512;&#27468;&#35789;
const
 RegEx:string='^((\[\d+:\d+\.\d+\])+)(.*?);' //&#27491;&#21017;&#34920;&#36798;&#24335;
var
 Reg:TPerlRegEx;
 a,b:String;
 I,ACount:Integer;
 AStrings: TStringList;
begin   
Reg:=TPerlRegEx.Create();
Reg.Options:=[preMultiLine,preCaseLess]; //&#37325;&#35201;&#65306;&#35774;&#32622;&#21305;&#37197;&#27169;&#24335;&#65306;&#22810;&#34892;
Reg.Subject:=s;
Reg.RegEx:=RegEx;
 try
   while Reg.MatchAgain do
   begin
    a:=Reg.Groups[1]; //&#26102;&#38388;&#26631;&#31614;
    b:=Reg.Groups[3]; //&#27468;&#35789;&#20869;&#23481;
     AStrings:=TStringList.Create;
    try
      ACount:=ExtractStrings(['[',']'], [], PChar(a), AStrings);
      //&#23558;&#26102;&#38388;&#26631;&#31614;&#30340;[]&#25324;&#21495;&#26367;&#25442;&#25481;&#65292;&#21516;&#26102;&#36827;&#34892;&#25991;&#26412;&#20998;&#21106;&#65292;&#23558;&#22810;&#20010;&#26102;&#38388;&#26631;&#31614;&#20998;&#20998;&#21106;&#25104;TStringList
      for I := 0 to ACount-1 do
      begin
        SetLength(Lrc,Length(Lrc)+1);
        //&#21152;&#20837;&#25104;&#21592;
        Lrc[Length(Lrc)-1].Time:=ToTime(AStrings[I]);
        Lrc[Length(Lrc)-1].Content:=b;
        //&#23545;&#20110;&#21333;&#34892;&#22810;&#20010;&#26102;&#38388;&#26631;&#31614;&#30340;&#24773;&#20917; &#33258;&#21160;&#25286;&#24320;&#22788;&#29702;
        //&#20363;&#22914;&#65306;[02:37.11][01:40.27][00:36.60]Confusing what is real
        //&#23558;&#35782;&#21035;&#20026;&#19977;&#21477; &#21363;&#27599;&#21477;&#20998;&#21035;&#26159;
        //[02:37.11]Confusing what is real
        //[01:40.27]Confusing what is real
        //[00:36.60]Confusing what is real
      end;
    finally
      AStrings.Free;
    end;
   end;
 finally
   Reg.Free;
 end;

QuickSort(0, Length(Lrc)-1); //&#24555;&#25490;
//Lrc&#27468;&#35789;&#22823;&#22810;&#25968;&#24050;&#32463;&#23616;&#37096;&#26377;&#24207;&#65292;&#38500;&#38750;&#26159;&#21333;&#34892;&#22810;&#26631;&#31614;&#24773;&#20917;&#25110;&#32773;&#32534;&#20889;&#32773;&#25925;&#24847;&#25214;&#20107;&#65292;&#25152;&#20197;&#20351;&#29992;&#24555;&#25490;&#26102;&#38388;&#22797;&#26434;&#24230;&#19981;&#20250;&#24456;&#39640;
Lrc[0].Line:=3; 
//&#35774;&#32622;&#39318;&#34892;&#20026;&#31532;&#19977;&#34892; &#36825;&#26679;&#36827;&#34892;&#28378;&#21160;&#26174;&#31034;&#26102; &#31532;&#19968;&#34892;&#27468;&#35789;&#26174;&#31034;&#22312;&#20013;&#38388;&#65292;&#22312;&#20197;&#21518;&#30340;&#31687;&#31456;&#20013;&#20250;&#35814;&#32454;&#35828;&#26126;
 LrcInAll:=Lrc[0].Content;
 for I := 1 to Length(LRC) - 1 do
 begin
  Lrc[I].Line:=Lrc[I-1].Line+CalculateLines(I-1);
  LrcInAll:=LrcInAll+ #13#10 + Lrc[I].Content;
 end; //&#23558;&#25152;&#26377;&#27468;&#35789;&#37117;&#20445;&#23384;&#19968;&#36941;
end;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#31532;&#19977;&#27493;&#65306;&lt;/p&gt;
&lt;p&gt;&#20851;&#20110;&#23558;&#26102;&#38388;&#26631;&#31614;&#36716;&#25442;&#25104;Longint&#65292;&#21482;&#38656;&#35201;&#23558;&#21508;&#20010;&#37096;&#20998;&#20570;&#20056;&#27861;&#28982;&#21518;&#24819;&#21152;&#21363;&#21487;&lt;/p&gt;
&lt;p&gt;&#20855;&#20307;&#23454;&#29616;&#20195;&#30721;&#65306;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;function ToTime(s:string):Longint;
const
 RegEx:string='^(\d+):(\d+)(\.(\d+))?;'
 //&#20351;&#29992;&#27491;&#21017;&#34920;&#36798;&#24335;&#23558;&#27599;&#37096;&#20998;&#20998;&#21035;&#21462;&#20986;&#26469;&#65292;&#24403;&#28982;&#20063;&#21487;&#20197;&#36827;&#34892;&#23383;&#31526;&#20018;&#20998;&#21106;&#65292;&#25105;&#36825;&#37324;&#27604;&#36739;&#25042;&#23601;&#30452;&#25509;&#29992;&#27491;&#21017;&#20102;
var
 Reg:TPerlRegEx;
 ans:Integer;
 ms:string;
begin
 Reg:=TPerlRegEx.Create();
 try
   Reg.Options:=[preCaseLess];
   Reg.Subject:=s;
   Reg.RegEx:=RegEx;
   if Reg.Match then
   begin
     ms:=Reg.Groups[4];
     if Length(ms)=1 then ms:=ms+'00';
     if Length(ms)=2 then ms:=ms+'0'; //&#23545;&#20110;&#27627;&#31186;&#65292;&#36827;&#34892;&#34917;&#38646;&#25805;&#20316;
     ans:=(StrToInt(Reg.Groups[1]) * 60 * 1000)+(StrToInt(Reg.Groups[2])*1000)+StrToInt(ms);
   end;
 finally
   Reg.Free;
   Result:=ans;
 end;
end;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#31532;&#22235;&#27493;&#65306;&lt;/p&gt;
&lt;p&gt;&#24555;&#36895;&#25490;&#24207;&#31639;&#27861;&#65292;&#36825;&#20010;&#23454;&#22312;&#26159;&#27809;&#26377;&#20160;&#20040;&#22909;&#35828;&#30340;&#65292;&#25490;&#24207;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#23558;&#27468;&#35789;&#25353;&#27491;&#24120;&#39034;&#24207;&#20840;&#37096;&#36755;&#20986;&#65292;&#26041;&#20415;&#20570;&#28378;&#21160;&#23383;&#24149;&#65292;&#21516;&#26102;&#20063;&#26041;&#20415;&#20108;&#20998;&#26597;&#25214;&#12290;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;procedure QuickSort(const left, right: Integer);
//QSort &#19981;&#35299;&#37322;
  procedure swap(const i, j: Integer);
  var
    vT: Integer;
    vS: String;
  begin
    if i = j then Exit;
    vT := Lrc[i].Time;
    Lrc[i].Time := Lrc[j].Time;
    Lrc[j].Time := vT; 
    vS := Lrc[i].Content;
    Lrc[i].Content := Lrc[j].Content;
    Lrc[j].Content := vS;
  end;
var
  vL, vR: Integer;
begin
  if left &amp;gt;= right then Exit;
  vL := left;
  vR := right + 1;
  while True do
  begin
    while vL + 1 &amp;lt; Length(Lrc) do
    begin
      Inc(vL);
      if Lrc[vL].Time &amp;gt;= Lrc[left].Time then Break;
    end;
    while vR - 1 &amp;lt; Length(Lrc) do
    begin
      Dec(vR);
      if Lrc[vR].Time &amp;lt;= Lrc[left].Time then Break;
    end;
    if vL &amp;gt;= vR then Break;
    swap(vL, vR);
  end;
  swap(left, vR);
  QuickSort(left, vR - 1);
  QuickSort(vR + 1, right);
end;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#36825;&#26679;&#65292;&#25105;&#20204;&#23601;&#24050;&#32463;&#25104;&#21151;&#22320;&#35299;&#26512;&#20102;Lrc&#27468;&#35789;&#65292;&#24182;&#23558;&#23427;&#23384;&#25918;&#22312;&#20869;&#23384;&#65288;&#21160;&#24577;&#25968;&#32452;&#65289;&#37324;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-02-11-delphi-lrc-one</guid><pubDate>Fri, 11 Feb 2011 22:29:00 GMT</pubDate></item><item><title>LRC IS A MUST! &#8212;&#8212; LRC&#27468;&#35789;&#19979;&#36733;&#22120;</title><link>http://blog.4321.la/article/2011-01-03-lrc-is-a-must</link><description>&lt;p&gt;&lt;img alt="LRC" src="http://i.imgur.com/dP4p5.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#21517;&#31216;&#65306;Lrc is a must! 
&#36719;&#20214;&#29256;&#26412;&#65306;1.0 &lt;br /&gt;
&#26368;&#21518;&#26356;&#26032;&#65306;2011&#24180;1&#26376;3&#26085;10:58:56&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#20248;&#28857;&#65306;&#30456;&#23545;&#20110;&#20854;&#23427;&#21516;&#31867;&#36719;&#20214;&#65292;&#26041;&#20415;&#26131;&#29992;&#19981;&#25954;&#35828;&#65292;&#20294;&#26159;&#27468;&#35789;&#24211;&#30456;&#24403;&#20840;&#65281;&lt;/strong&gt;&lt;/p&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#26368;&#36817;&#20174;&#26576;&#30693;&#21517;&#21548;&#27468;&#36719;&#20214;&#25442;&#21040;&#20102;&#21326;&#20029;&#30340;AirPlay&#8230;&#8230;&#20294;&#26159;AirPlay&#30340;LRC&#27468;&#35789;&#19979;&#36733;&#37096;&#20998;&#38750;&#24120;&#30340;&#19981;&#32473;&#21147;&#12290;&lt;/p&gt;
&lt;p&gt;&#25152;&#20197;&#23601;&#20998;&#26512;&#20102;&#20043;&#21069;&#37027;&#20010;&#36719;&#20214;&#30340;LRC&#19979;&#36733;&#31639;&#27861;&#65292;&#28982;&#21518;&#24320;&#21457;&#20102;&#36825;&#27454;&#36719;&#20214;&#12290;&lt;/p&gt;
&lt;p&gt;&#20351;&#29992;&#26041;&#27861;&#65306;&lt;/p&gt;
&lt;p&gt;&#31532;&#19968;&#27493;&#65306;&#19979;&#36733;&#24182;&#21551;&#21160;&#36719;&#20214; 
&#31532;&#20108;&#27493;&#65306;&#25214;&#21040;&#38656;&#35201;&#19979;&#36733;&#30340;&#27468;&#26354;&#25152;&#22312;&#30446;&#24405;&#65292;&#28982;&#21518;&#25226;&#27468;&#26354;&#36873;&#20013;&#65292;&#25903;&#25345;&#22810;&#36873;&#65292;&#25302;&#25341;&#21040;&#36719;&#20214;&#30028;&#38754;&#20013;&#12290; 
&#65288;&#20165;&#25903;&#25345;MP3&#26684;&#24335;&#65289; 
&lt;img alt="LRC" src="http://i.imgur.com/nHnab.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#30340;&#19977;&#20010;&#21306;&#22495;&#20998;&#21035;&#26159;&#65306;&lt;/p&gt;
&lt;p&gt;&#9312; &#20320;&#25302;&#25341;&#36827;&#26469;&#30340;&#27468;&#26354;&#21015;&#34920; 
&#9313; &#21452;&#20987;&#19968;&#20010;&#27468;&#26354;&#65292;&#20986;&#26469;&#30340;&#25628;&#32034;&#32467;&#26524; 
&#9314; &#21452;&#20987;&#19968;&#20010;&#25628;&#32034;&#32467;&#26524;&#65292;&#20986;&#26469;&#30340;&#27468;&#35789;&lt;/p&gt;
&lt;p&gt;&#25302;&#25341;&#36827;&#21435;&#27468;&#26354;&#21518;&#65292;&#36719;&#20214;&#20250;&#33258;&#21160;&#35835;&#21462;ID3&#26631;&#31614;&#65292;&#22914;&#26524;&#27809;&#26377;&#38382;&#39064;&#30340;&#35805;&#65292;&#21452;&#20987;&#27468;&#26354;&#23601;&#21487;&#20197;&#25628;&#32034;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#35835;&#21462;&#22833;&#36133;&#30340;&#35805;&#65292;&#21487;&#20197;&#22312;&#19979;&#38754;&#30340;Search&#21306;&#22495;&#36827;&#34892;&#30456;&#20851;&#20462;&#25913;&#21518;&#21333;&#20987;[Click]&#25353;&#38062;&lt;/p&gt;
&lt;p&gt;&lt;img alt="LRC" src="http://i.imgur.com/zxhW0.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#25214;&#21040;&#20013;&#24847;&#30340;&#27468;&#35789;&#21518;&#65292;&#23601;&#21487;&#20197;&#21333;&#20987;SaveToFile&#25353;&#38062;&#65292;LRC&#27468;&#35789;&#23558;&#33258;&#21160;&#20445;&#23384;&#21040;&#19982;&#27468;&#26354;&#21516;&#25991;&#20214;&#22841;&#30340;&#20301;&#32622;&#65292;&#24182;&#19988;&#19982;&#27468;&#26354;&#25991;&#20214;&#21516;&#25991;&#20214;&#21517;&#12290;&#25928;&#26524;&#22914;&#19979;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="LRC" src="http://i.imgur.com/dtSjW.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://down.4321.la/LRC-Downloader.rar"&gt;http://down.4321.la/LRC-Downloader.rar&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#37319;&#29992;Delphi XE&#24320;&#21457;&#65292;&#25152;&#20197;&#19981;&#29992;&#35013;&#20160;&#20040;.net&#24211;&#20102;&#65292;&#36719;&#20214;&#21046;&#20316;&#30340;&#26102;&#20505;&#27604;&#36739;&#20179;&#20419;&#65292;&#22240;&#20026;&#25105;&#36824;&#26377;&#20854;&#20182;&#30340;&#39033;&#30446;&#65292;&#25152;&#20197;&#30028;&#38754;&#27604;&#36739;&#25619;&#65292;&#24076;&#26395;&#22823;&#23478;&#35845;&#35299;&#12290;&lt;/p&gt;
&lt;p&gt;&#26377;&#20219;&#20309;&#24847;&#35265;&#24314;&#35758;&#35831;&#22312;&#19979;&#38754;&#25552;&#20986;&#65292;&#24744;&#30340;&#25903;&#25345;&#26159;&#25105;&#20204;&#26368;&#22823;&#30340;&#40723;&#21169;&lt;/p&gt;
&lt;p&gt;&#20813;&#36131;&#22768;&#26126;&#65306;
&#25152;&#26377;&#30340;&#20195;&#30721;&#12289;&#31243;&#24207;&#20165;&#20379;&#30740;&#31350;&#23398;&#20064;&#29992;&#65292;&#27809;&#26377;&#20219;&#20309;&#30408;&#21033;&#30446;&#30340;&#65292;&#35831;&#21508;&#20301;&#29992;&#25143;&#19979;&#36733;&#21518;&#21450;&#26102;&#21024;&#38500;&#12290; 
&#24320;&#21457;&#32773;&#23545;&#36719;&#20214;&#30340;&#20351;&#29992;&#20135;&#29983;&#30340;&#20219;&#20309;&#27861;&#24459;&#38382;&#39064;&#21450;&#36830;&#24102;&#36131;&#20219;&#27010;&#19981;&#36127;&#36131;&#12290;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2011-01-03-lrc-is-a-must</guid><pubDate>Mon, 03 Jan 2011 22:23:00 GMT</pubDate></item><item><title>[320kbps MusicDownloader]&#39640;&#28165;&#38899;&#20048;&#19979;&#36733;&#21161;&#25163; 1.4</title><link>http://blog.4321.la/article/2010-12-05-musicdownloader</link><description>&lt;p&gt;&lt;img alt="MusicDownloader" src="http://i.imgur.com/bDcY0.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#21517;&#31216;&#65306;[320kbps MusicDownloader]&#39640;&#28165;&#38899;&#20048;&#19979;&#36733;&#21161;&#25163;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#29256;&#26412;&#65306;1.4&lt;/p&gt;
&lt;p&gt;&#26368;&#21518;&#26356;&#26032;&#65306;2010&#24180;12&#26376;5&#26085;&lt;/p&gt;
&lt;h4&gt;&lt;strong&gt;MusicDownloader&#24050;&#32463;&#34987;MusicSeeker&#25152;&#26367;&#20195;&#65292;&#30446;&#21069;MusicDownloader&#24050;&#32463;&#20572;&#27490;&#24320;&#21457;&#65292;&#35831;&#19979;&#36733;&#26356;&#21152;&#23436;&#21892;&#30340;MusicSeeker&#65281;&lt;/strong&gt;&lt;/h4&gt;
&lt;!-- more --&gt;

&lt;p&gt;&#29256;&#26412;&#26356;&#26032;&#20869;&#23481;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#20462;&#27491;&#25628;&#32034;&#31639;&#27861;&#65292;&#23436;&#32654;&#36816;&#34892;&lt;/p&gt;
&lt;p&gt;2&#12289;&#28155;&#21152;&#35797;&#21548;&#21151;&#33021;&#65292;&#25171;&#24320;&#19979;&#36733;&#30446;&#24405;&#21151;&#33021;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#35828;&#26126;&#65306;&lt;/p&gt;
&lt;p&gt;1&#12289;&#31243;&#24207;&#37319;&#29992;&#20247;&#25152;&#21608;&#30693;&#30340;&#25509;&#21475;&#24320;&#21457;&#65292;&#19979;&#36733;&#39640;&#28165;320kbpsMP3&#38899;&#20048;&#12290;&lt;/p&gt;
&lt;p&gt;2&#12289;&#37319;&#29992;&#35910;&#29923;&#38899;&#20048;API&#65292;&#33258;&#21160;&#33719;&#21462;&#19987;&#36753;&#22270;&#29255;&#24182;&#20445;&#23384;&#22312;&#38899;&#20048;&#30340;ID3&#26631;&#31614;&#20013;&#12290;&lt;/p&gt;
&lt;p&gt;&#25130;&#22270;&#19982;&#21151;&#33021;&#19968;&#35272;&#65306;&lt;/p&gt;
&lt;p&gt;&lt;img alt="MusicDownloader" src="http://i.imgur.com/h8AYa.png" /&gt;&lt;/p&gt;
&lt;p&gt;&#30001;&#20110;&#25628;&#32034;&#31639;&#27861;&#38382;&#39064;&#65292;&#26080;&#27861;&#25628;&#32034;&#38500;&#20013;&#25991;&#12289;&#33521;&#25991;&#20043;&#22806;&#30340;&#20851;&#38190;&#23383;&#12290;&#25152;&#20197;&#22914;&#26524;&#24744;&#25628;&#32034;&#20854;&#20182;&#35821;&#35328;&#65288;&#22914;&#26085;&#25991;&#65289;&#65292;&#21487;&#20197;&#23581;&#35797;&#36755;&#20837;&#27468;&#21517;&#20013;&#30340;&#20013;&#25991;&#23383;&#31526;&#32780;&#24573;&#30053;&#20551;&#21517;&#31561;&#65292;&#21516;&#26102;&#36755;&#20837;&#27468;&#25163;&#26469;&#31934;&#30830;&#23450;&#20301;&#65292;&#25110;&#32773;&#20165;&#36755;&#20837;&#27468;&#25163;&#12290;&#65288;&#22914;&#19978;&#22270;&#25152;&#31034;&#65289;&lt;/p&gt;
&lt;p&gt;&lt;img alt="MusicDownloader" src="http://i.imgur.com/6iC8l.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img alt="MusicDownloader" src="http://i.imgur.com/ohftM.png" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&#19979;&#36733;&#22320;&#22336;&#65306;&#65288;&#25903;&#25345;&#36805;&#38647;&#31561;&#19979;&#36733;&#24037;&#20855;&#65289;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://down.4321.la/320kbps-MusicDownloader-1.4.rar"&gt;http://down.4321.la/320kbps-MusicDownloader-1.4.rar&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;MusicDownloader&#24050;&#32463;&#34987;MusicSeeker&#25152;&#26367;&#20195;&#65292;&#30446;&#21069;MusicDownloader&#24050;&#32463;&#20572;&#27490;&#24320;&#21457;&#65292;&#35831;&#19979;&#36733;&#26356;&#21152;&#23436;&#21892;&#30340;MusicSeeker&#65281;&lt;/p&gt;
&lt;p&gt;&#36719;&#20214;&#22522;&#20110;.Net FrameWork3.5&#24179;&#21488;&#65292;&#22914;&#26524;&#24744;&#30340;&#31995;&#32479;&#26159;Windows7/Vista&#65292;&#21017;&#24050;&#32463;&#33258;&#24102;&#65292;&#22914;&#26524;&#26159;XP&#65292;&#24744;&#21487;&#20197;&#20808;&#19979;&#36733;&#36719;&#20214;&#35797;&#19968;&#19979;&#65292;&#22914;&#26524;&#19981;&#33021;&#36816;&#34892;&#65292;&#35831;&#21040;http://www.crsky.com/soft/21819.html&#19979;&#36733;.Net FrameWork3.5&#21518;&#23433;&#35013;&#65281;&lt;/p&gt;
&lt;p&gt;&#22914;&#26524;&#24744;&#35273;&#24471;&#36719;&#20214;&#19981;&#38169;&#30340;&#35805;&#65292;&#24076;&#26395;&#24744;&#33021;&#25512;&#33616;&#32473;&#24744;&#30340;&#26379;&#21451;&#65292;&#36825;&#23545;&#25105;&#20204;&#26469;&#35828;&#26159;&#26368;&#22823;&#30340;&#25903;&#25345;&#65281;&lt;/p&gt;</description><guid isPermaLink="true">http://blog.4321.la/article/2010-12-05-musicdownloader</guid><pubDate>Sun, 05 Dec 2010 22:16:00 GMT</pubDate></item></channel></rss>